--------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\DELL\Desktop\Uni\2C1 Coursework\30152_logfile.log
  log type:  text
 opened on:   7 May 2024, 23:21:01

. use BNPT_small.dta, clear

. 
. /*
> ==============================================================================
> ==============================================================================
> =*/
. 
. *******INITIAL OVERVIEW OF THE DATASET******
. browse

. describe

Contains data from BNPT_small.dta
 Observations:         1,157                  
    Variables:            85                  2 Jan 2024 14:38
--------------------------------------------------------------------------------
Variable      Storage   Display    Value
    name         type    format    label      Variable label
--------------------------------------------------------------------------------
term            float   %9.0g                 municipal administration mandate
pop             float   %9.0g                 population estimate
pop_2           float   %9.0g                 populations estimate ^2
pop_3           float   %9.0g                 populations estimate ^3
fpm             float   %9.0g                 actual fpm transfers
fpm_hat         float   %9.0g                 theoretical fpm transfers
pop_cat         float   %9.0g                 population categories, see table 1
popnorm         float   %9.0g                 normalized population
popnorm_2       float   %9.0g                 normalized population ^2
popnorm_3       float   %9.0g                 normalized population ^3
treatnorm       float   %9.0g                 =1 if normalized population>0; =0
                                                otherwise
literacy        float   %9.0g                 literacy rate
urb             float   %9.0g                 fraction of houses in the city
                                                urban areas
income          float   %9.0g                 income per capita in reais (2000
                                                prices)
broad           float   %9.0g                 =1 if at least one (broad)
                                                corruption episode is reported
narrow          float   %9.0g                 =1 if at least one (narrow)
                                                corruption episode is reported
fraction_broad  float   %9.0g                 amount involved in (broad)
                                                corruption episodes over the
                                                total amount audited
fraction_narrow float   %9.0g                 amount involved in (narrow)
                                                corruption episodes over the
                                                total amount audited
before          float   %9.0g                 =1 if the release of the audit
                                                report occured before the
                                                elections
m_yschool       float   %9.0g                 years of schooling of the mayors
m_college       byte    %9.0g                 = 1 if mayor has at least college
                                                degree, =0 otherwise
opp_college     float   %9.0g                 fraction of opponents with at
                                                least college degree
opp_yschool     float   %9.0g                 average years of schooling of the
                                                pool of opponents
dumm0           float   %9.0g                 =1 if population estimate is
                                                between the mid-point of the
                                                first and second inter
dumm1           float   %9.0g                 =1 if population estimate is
                                                between the mid-point of the
                                                second and third inter
dumm2           float   %9.0g                 =1 if population estimate is
                                                between the mid-point of the
                                                third and fourth inter
dumm3           float   %9.0g                 =1 if population estimate is
                                                between the mid-point of the
                                                fourth and fifth inter
dumm4           float   %9.0g                 =1 if population estimate is
                                                between the mid-point of the
                                                fifth and sixth interv
dumm5           float   %9.0g                 =1 if population estimate is
                                                between the mid-point of the
                                                sixth and seventh inte
dumm6           float   %9.0g                 =1 if population estimate is
                                                between the mid-point of the
                                                seventh and eigth inte
dumm100         float   %9.0g                 =1 if population estimate is
                                                between the mid-point of the
                                                first and fourth inter
dumm200         float   %9.0g                 =1 if population estimate is
                                                between the mid-point of the
                                                fourth and eigth inter
fpm0            float   %9.0g                 actual fpm interacted with dumm0
fpm0hat         float   %9.0g                 theoretical fpm interacted with
                                                dumm0
dumm0_1         float   %9.0g                 pop interacted with dumm0
dumm0_2         float   %9.0g                 pop^2 estimate interacted with
                                                dumm0
dumm0_3         float   %9.0g                 pop^3 estimate interacted with
                                                dumm0
fpm1            float   %9.0g                 actual fpm interacted with dumm1
fpm1hat         float   %9.0g                 theoretical fpm interacted with
                                                dumm1
dumm1_1         float   %9.0g                 pop interacted with dumm1
dumm1_2         float   %9.0g                 pop^2 estimate interacted with
                                                dumm1
dumm1_3         float   %9.0g                 pop^3 estimate interacted with
                                                dumm1
fpm2            float   %9.0g                 actual fpm interacted with dumm2
fpm2hat         float   %9.0g                 theoretical fpm interacted with
                                                dumm2
dumm2_1         float   %9.0g                 pop interacted with dumm2
dumm2_2         float   %9.0g                 pop^2 estimate interacted with
                                                dumm2
dumm2_3         float   %9.0g                 pop^3 estimate interacted with
                                                dumm2
fpm3            float   %9.0g                 actual fpm interacted with dumm3
fpm3hat         float   %9.0g                 theoretical fpm interacted with
                                                dumm3
dumm3_1         float   %9.0g                 pop interacted with dumm3
dumm3_2         float   %9.0g                 pop^2 estimate interacted with
                                                dumm3
dumm3_3         float   %9.0g                 pop^3 estimate interacted with
                                                dumm3
fpm4            float   %9.0g                 actual fpm interacted with dumm4
fpm4hat         float   %9.0g                 theoretical fpm interacted with
                                                dumm4
dumm4_1         float   %9.0g                 pop interacted with dumm4
dumm4_2         float   %9.0g                 pop^2 estimate interacted with
                                                dumm4
dumm4_3         float   %9.0g                 pop^3 estimate interacted with
                                                dumm4
fpm5            float   %9.0g                 actual fpm interacted with dumm5
fpm5hat         float   %9.0g                 theoretical fpm interacted with
                                                dumm5
dumm5_1         float   %9.0g                 pop interacted with dumm5
dumm5_2         float   %9.0g                 pop^2 estimate interacted with
                                                dumm5
dumm5_3         float   %9.0g                 pop^3 estimate interacted with
                                                dumm5
fpm6            float   %9.0g                 actual fpm interacted with dumm6
fpm6hat         float   %9.0g                 theoretical fpm interacted with
                                                dumm6
dumm6_1         float   %9.0g                 pop interacted with dumm6
dumm6_2         float   %9.0g                 pop^2 estimate interacted with
                                                dumm6
dumm6_3         float   %9.0g                 pop^3 estimate interacted with
                                                dumm6
fpm100          float   %9.0g                 actual fpm interacted with dumm100
fpm100hat       float   %9.0g                 theoretical fpm interacted with
                                                dumm100
dumm100_1       float   %9.0g                 pop interacted with dumm100
dumm100_2       float   %9.0g                 pop^2 estimate interacted with
                                                dumm100
dumm100_3       float   %9.0g                 pop^3 estimate interacted with
                                                dumm100
fpm200          float   %9.0g                 actual fpm interacted with dumm200
fpm200hat       float   %9.0g                 theoretical fpm interacted with
                                                dumm200
dumm200_1       float   %9.0g                 pop interacted with dumm200
dumm200_2       float   %9.0g                 pop^2 estimate interacted with
                                                dumm200
dumm200_3       float   %9.0g                 pop^3 estimate interacted with
                                                dumm200
reelected       float   %9.0g                 =1 if the mayor is re-elected
rerun           float   %9.0g                 = 1 if the incumbent mayor re-run
noneligible     float   %9.0g                 =1 if the mayor is on her 2nd term
                                                (term limit)
city            str8    %9s                   city ID (string)
cityr           double  %10.0g                city ID (real)
region          double  %10.0g                region ID
state           double  %10.0g                state ID
cnobs           double  %10.0g                number of times city is observed
--------------------------------------------------------------------------------
Sorted by: 

. summ 

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        term |      1,157    2002.348    1.891666       2001       2005
         pop |      1,157    18351.82    9939.874       6846      50202
       pop_2 |      1,157    4.36e+08    4.86e+08   4.69e+07   2.52e+09
       pop_3 |      1,157    1.27e+13    2.11e+13   3.21e+11   1.27e+14
         fpm |      1,157     33.1425    12.33153   10.98567   74.55576
-------------+---------------------------------------------------------
     fpm_hat |      1,157    32.26595    12.68655   8.262003   77.53115
     pop_cat |      1,157    3.283492    1.880287          1          8
     popnorm |      1,157   -123.1896    1739.195      -3381       6053
   popnorm_2 |      1,157     3037361     3751070    1.77691   3.66e+07
   popnorm_3 |      1,157   -2.23e+08    1.70e+10  -3.86e+10   2.22e+11
-------------+---------------------------------------------------------
   treatnorm |      1,157    .4796889    .4998033          0          1
    literacy |      1,157    .5220047    .1281305   .2358437   .7724276
         urb |      1,157     .584716    .2192297   .0466786          1
      income |      1,157    144.4397    90.89251   19.37045   600.0566
       broad |      1,157    .7847882    .4111469          0          1
-------------+---------------------------------------------------------
      narrow |      1,157    .4606742    .4986666          0          1
fraction_b~d |      1,097    5.344712    10.41038          0   85.09793
fraction_n~w |      1,097    2.085471    6.510986          0    74.5644
      before |      1,157    .3362143    .4726175          0          1
   m_yschool |      1,157    11.52148    3.473528          1         15
-------------+---------------------------------------------------------
   m_college |      1,157    .3673293    .4822857          0          1
 opp_college |      1,157    .4371292    .3673259          0          1
 opp_yschool |      1,157    11.86224    2.635196          1         15
       dumm0 |      1,157    .3249784    .4685693          0          1
       dumm1 |      1,157    .1823682    .3863147          0          1
-------------+---------------------------------------------------------
       dumm2 |      1,157    .1858254    .3891339          0          1
       dumm3 |      1,157    .1158168    .3201434          0          1
       dumm4 |      1,157    .0916162    .2886082          0          1
       dumm5 |      1,157    .0605013    .2385164          0          1
       dumm6 |      1,157    .0388937    .1934252          0          1
-------------+---------------------------------------------------------
     dumm100 |      1,157     .693172    .4613768          0          1
     dumm200 |      1,157     .306828    .4613768          0          1
        fpm0 |      1,157      6.8655    10.14037          0   34.65461
     fpm0hat |      1,157    6.454965    9.553327          0   31.01676
     dumm0_1 |      1,157     3036.24    4457.026          0   11873.67
-------------+---------------------------------------------------------
     dumm0_2 |      1,157    2.91e+07    4.47e+07          0   1.41e+08
     dumm0_3 |      1,157    2.85e+11    4.68e+11          0   1.67e+12
        fpm1 |      1,157    5.265736    11.32863          0   39.08657
     fpm1hat |      1,157     5.09875     11.0448          0   40.62485
     dumm1_1 |      1,157    2476.824     5262.07          0      15268
-------------+---------------------------------------------------------
     dumm1_2 |      1,157    3.38e+07    7.24e+07          0   2.33e+08
     dumm1_3 |      1,157    4.63e+11    1.01e+12          0   3.56e+12
        fpm2 |      1,157    6.533995     13.9046          0   50.80996
     fpm2hat |      1,157    6.434247      13.695          0   46.52753
     dumm2_1 |      1,157    3299.349    6936.981          0   20362.33
-------------+---------------------------------------------------------
     dumm2_2 |      1,157    5.90e+07    1.25e+08          0   4.15e+08
     dumm2_3 |      1,157    1.06e+12    2.30e+12          0   8.44e+12
        fpm3 |      1,157    4.644195    12.96925          0    54.2821
     fpm3hat |      1,157    4.551242    12.73885          0   54.28211
     dumm3_1 |      1,157    2758.369    7657.485          0   27148.67
-------------+---------------------------------------------------------
     dumm3_2 |      1,157    6.62e+07    1.86e+08          0   7.37e+08
     dumm3_3 |      1,157    1.60e+12    4.58e+12          0   2.00e+13
        fpm4 |      1,157     4.34254    13.82592          0   62.03669
     fpm4hat |      1,157     4.29705    13.69777          0   62.03669
     dumm4_1 |      1,157    2788.698    8806.348          0   33919.67
-------------+---------------------------------------------------------
     dumm4_2 |      1,157    8.53e+07    2.71e+08          0   1.15e+09
     dumm4_3 |      1,157    2.62e+12    8.43e+12          0   3.90e+13
        fpm5 |      1,157    3.151232    12.51769          0   67.94665
     fpm5hat |      1,157    3.110643    12.38583          0   67.94665
     dumm5_1 |      1,157    2254.652     8901.83          0   40726.33
-------------+---------------------------------------------------------
     dumm5_2 |      1,157    8.43e+07    3.34e+08          0   1.66e+09
     dumm5_3 |      1,157    3.16e+12    1.26e+13          0   6.76e+13
        fpm6 |      1,157    2.339302    11.71984          0   74.55576
     fpm6hat |      1,157    2.319054    11.63533          0   77.53115
     dumm6_1 |      1,157    1737.683    8660.451          0      50202
-------------+---------------------------------------------------------
     dumm6_2 |      1,157    7.80e+07    3.91e+08          0   2.52e+09
     dumm6_3 |      1,157    3.51e+12    1.78e+13          0   1.27e+14
      fpm100 |      1,157    18.66523    13.90929          0   50.80996
   fpm100hat |      1,157    17.98796     13.6425          0   46.52753
   dumm100_1 |      1,157    8812.413    6649.223          0   20362.33
-------------+---------------------------------------------------------
   dumm100_2 |      1,157    1.22e+08    1.17e+08          0   4.15e+08
   dumm100_3 |      1,157    1.81e+12    2.16e+12          0   8.44e+12
      fpm200 |      1,157    14.47727     22.3497          0   74.55576
   fpm200hat |      1,157    14.27799    22.11197          0   77.53115
   dumm200_1 |      1,157    9539.402    14928.65          0      50202
-------------+---------------------------------------------------------
   dumm200_2 |      1,157    3.14e+08    5.47e+08          0   2.52e+09
   dumm200_3 |      1,157    1.09e+13    2.19e+13          0   1.27e+14
   reelected |      1,157    .2800346      .44921          0          1
       rerun |      1,157    .4727744    .4994741          0          1
 noneligible |      1,157     .318064    .4659259          0          1
-------------+---------------------------------------------------------
        city |          0
       cityr |      1,157     4570007     3099999       3893    9991292
      region |      1,157     4826498     3685459      40446    9556103
       state |      1,157     5010401     3286617     251425    8931088
       cnobs |      1,157    1.523768    .4996507          1          2

. 
. /*
> ==============================================================================
> ==============================================================================
> =*/
. 
. ******INSTALLING ANY REQUIRED PACKAGES******
. ssc install rdrobust
checking rdrobust consistency and verifying not already installed...
all files already exist and are up to date.

. ssc install cluster
checking cluster consistency and verifying not already installed...
all files already exist and are up to date.

. ssc install outreg2
checking outreg2 consistency and verifying not already installed...
all files already exist and are up to date.

. 
. /*
> ==============================================================================
> ==============================================================================
> =*/
. 
. ******SETTING UP THE FUZZY RD******
. 
. twoway (scatter fpm pop, mcolor(red)), ///
>        xtitle(Population) ytitle(Values) title(Graph of actual FPM transfer) x
> label(10189 13585 16981 23773 30565 37356 44148,labsize(tiny)) xline(10189 135
> 85 16981 23773 30565 37356 44148) legend(off)  

.            
. *Note: this graph is better/clearer        
. twoway (scatter fpm_hat pop, mcolor(blue)), ///
>        xtitle(Population) ytitle(Theoretical Transfers) title(Graph of theoret
> ical FPM transfer) xlabel(10189 13585 16981 23773 30565 37356 44148,labsize(ti
> ny)) xline(10189 13585 16981 23773 30565 37356 44148) legend(off)

.            
. *Plotting actual and predicted transfers against population to understand the 
> non-compliance
. twoway (scatter fpm pop) (scatter fpm_hat pop), ///
>         title(Actual vs Predicted transfers) ///
>         xtitle(Population) ///
>         ytitle(FPM transfers) ///
>         legend(label(1 Actual Transfers) label(2 Predicted FPM transfers))

. 
. /*
> ==============================================================================
> ==============================================================================
> =*/
. 
. ******TESTING THE VALIDITY OF AUTHOR'S FUZZY RD******
. 
. ***Author's specification***
. ivregress 2sls narrow pop pop_2 pop_3 (fpm=fpm_hat) i.term i.state,r cluster(c
> ityr)

Instrumental variables 2SLS regression            Number of obs   =      1,157
                                                  Wald chi2(30)   =     208.94
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.1223
                                                  Root MSE        =     .46699

                                (Std. err. adjusted for 854 clusters in cityr)
------------------------------------------------------------------------------
             |               Robust
      narrow | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         fpm |     .02148   .0099701     2.15   0.031      .001939    .0410211
         pop |  -.0000209   .0000321    -0.65   0.516    -.0000839    .0000421
       pop_2 |  -2.53e-10   1.01e-09    -0.25   0.803    -2.24e-09    1.74e-09
       pop_3 |   5.02e-15   1.27e-14     0.40   0.692    -1.98e-14    2.99e-14
             |
        term |
       2005  |   .0980591   .0521248     1.88   0.060    -.0041036    .2002217
             |
       state |
     505526  |  -.0729262   .1630821    -0.45   0.655    -.3925611    .2467088
     587449  |  -.1148898   .1694097    -0.68   0.498    -.4469267    .2171472
     597365  |  -.1375069   .1448246    -0.95   0.342    -.4213579    .1463442
     769751  |  -.0812533   .1923332    -0.42   0.673    -.4582195    .2957129
     892308  |  -.3848535   .1466652    -2.62   0.009     -.672312   -.0973949
     957849  |  -.2436467   .1608135    -1.52   0.130    -.5588353    .0715419
    1107433  |   -.173009   .1658181    -1.04   0.297    -.4980065    .1519885
    1250697  |  -.1358337   .1728071    -0.79   0.432    -.4745293    .2028619
    1381093  |  -.3717087   .1490381    -2.49   0.013    -.6638181   -.0795994
    2055503  |  -.4692087   .1746391    -2.69   0.007     -.811495   -.1269224
    2231416  |  -.3507365   .1521046    -2.31   0.021    -.6488561    -.052617
    2841968  |    .012439   .1737875     0.07   0.943    -.3281784    .3530563
    3299494  |  -.2847325    .192579    -1.48   0.139    -.6621805    .0927154
    3348128  |  -.1974808   .1699163    -1.16   0.245    -.5305106     .135549
    4383332  |  -.1068204    .257585    -0.41   0.678    -.6116777    .3980368
    5237566  |  -.3751211   .1720563    -2.18   0.029    -.7123452    -.037897
    5652332  |  -.1770117   .1800364    -0.98   0.326    -.5298766    .1758531
    5893022  |  -.3476897   .1626491    -2.14   0.033    -.6664762   -.0289033
    5964892  |  -.2434779    .148055    -1.64   0.100    -.5336604    .0467045
    6136824  |  -.1294767   .1928203    -0.67   0.502    -.5073975     .248444
    7914963  |  -.2871559    .176529    -1.63   0.104    -.6331464    .0588346
    8067344  |  -.4086954   .1414828    -2.89   0.004    -.6859966   -.1313942
    8725765  |  -.3383115   .1545544    -2.19   0.029    -.6412325   -.0353905
    8788516  |   -.178707   .1476246    -1.21   0.226    -.4680459    .1106319
    8931088  |  -.0523311   .1638527    -0.32   0.749    -.3734764    .2688143
             |
       _cons |   .3781725   .1920995     1.97   0.049     .0016645    .7546805
------------------------------------------------------------------------------
Endogenous: fpm
Exogenous:  pop pop_2 pop_3 2005.term 505526.state 587449.state 597365.state
            769751.state 892308.state 957849.state 1107433.state
            1250697.state 1381093.state 2055503.state 2231416.state
            2841968.state 3299494.state 3348128.state 4383332.state
            5237566.state 5652332.state 5893022.state 5964892.state
            6136824.state 7914963.state 8067344.state 8725765.state
            8788516.state 8931088.state fpm_hat

. ivregress 2sls broad pop pop_2 pop_3 (fpm=fpm_hat) i.term i.state,r cluster(ci
> tyr)

Instrumental variables 2SLS regression            Number of obs   =      1,157
                                                  Wald chi2(30)   =     129.54
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.0727
                                                  Root MSE        =     .39575

                                (Std. err. adjusted for 854 clusters in cityr)
------------------------------------------------------------------------------
             |               Robust
       broad | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         fpm |   .0186778   .0081618     2.29   0.022     .0026809    .0346747
         pop |  -.0000513   .0000261    -1.96   0.049    -.0001024   -1.26e-07
       pop_2 |   1.08e-09   8.17e-10     1.33   0.184    -5.17e-10    2.69e-09
       pop_3 |  -1.15e-14   1.02e-14    -1.12   0.263    -3.15e-14    8.61e-15
             |
        term |
       2005  |   .0846983   .0417346     2.03   0.042        .0029    .1664966
             |
       state |
     505526  |   .0177924   .1418539     0.13   0.900     -.260236    .2958209
     587449  |   -.074415   .1259915    -0.59   0.555    -.3213538    .1725238
     597365  |  -.0478907   .1170857    -0.41   0.683    -.2773745     .181593
     769751  |   .0807888   .1428127     0.57   0.572     -.199119    .3606966
     892308  |  -.2318234   .1326432    -1.75   0.081    -.4917992    .0281525
     957849  |  -.2590394   .1307619    -1.98   0.048    -.5153281   -.0027507
    1107433  |  -.0907363   .1296377    -0.70   0.484    -.3448215    .1633489
    1250697  |  -.1134228   .1327581    -0.85   0.393    -.3736239    .1467782
    1381093  |  -.0349928   .1278448    -0.27   0.784     -.285564    .2155784
    2055503  |  -.1721628   .1748472    -0.98   0.325     -.514857    .1705315
    2231416  |  -.2098894   .1224446    -1.71   0.086    -.4498765    .0300977
    2841968  |  -.0076003   .1269276    -0.06   0.952    -.2563739    .2411733
    3299494  |  -.2958078   .1658728    -1.78   0.075    -.6209125    .0292969
    3348128  |  -.0955763   .1881592    -0.51   0.611    -.4643616    .2732089
    4383332  |  -.1436732   .2801218    -0.51   0.608    -.6927019    .4053555
    5237566  |  -.2512339   .1416535    -1.77   0.076    -.5288696    .0264017
    5652332  |   -.190698   .1428061    -1.34   0.182    -.4705928    .0891968
    5893022  |  -.0988054   .1261612    -0.78   0.434    -.3460768     .148466
    5964892  |  -.0378039   .1217899    -0.31   0.756    -.2765077    .2008999
    6136824  |  -.1862024   .1574895    -1.18   0.237    -.4948761    .1224714
    7914963  |   -.244597   .1379793    -1.77   0.076    -.5150315    .0258374
    8067344  |  -.3367765   .1226054    -2.75   0.006    -.5770786   -.0964744
    8725765  |  -.1544323   .1231089    -1.25   0.210    -.3957213    .0868566
    8788516  |  -.1282327    .120832    -1.06   0.289     -.365059    .1085936
    8931088  |  -.0718105   .1274634    -0.56   0.573    -.3216341    .1780131
             |
       _cons |   .8984119   .1550316     5.80   0.000     .5945556    1.202268
------------------------------------------------------------------------------
Endogenous: fpm
Exogenous:  pop pop_2 pop_3 2005.term 505526.state 587449.state 597365.state
            769751.state 892308.state 957849.state 1107433.state
            1250697.state 1381093.state 2055503.state 2231416.state
            2841968.state 3299494.state 3348128.state 4383332.state
            5237566.state 5652332.state 5893022.state 5964892.state
            6136824.state 7914963.state 8067344.state 8725765.state
            8788516.state 8931088.state fpm_hat

. ivregress 2sls fraction_narrow pop pop_2 pop_3 (fpm=fpm_hat) i.term i.state,r 
> cluster(cityr)

Instrumental variables 2SLS regression            Number of obs   =      1,097
                                                  Wald chi2(30)   =      76.25
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.0234
                                                  Root MSE        =     6.4316

                                (Std. err. adjusted for 822 clusters in cityr)
------------------------------------------------------------------------------
             |               Robust
fraction_n~w | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         fpm |   .2933908   .1416028     2.07   0.038     .0158544    .5709272
         pop |  -.0010961   .0005096    -2.15   0.031     -.002095   -.0000973
       pop_2 |   3.05e-08   1.53e-08     1.99   0.046     4.87e-10    6.06e-08
       pop_3 |  -3.50e-13   1.72e-13    -2.04   0.042    -6.86e-13   -1.32e-14
             |
        term |
       2005  |  -2.293694   .6456559    -3.55   0.000    -3.559157   -1.028232
             |
       state |
     505526  |  -.2423926   1.286075    -0.19   0.851    -2.763052    2.278267
     587449  |   -.637801   1.740572    -0.37   0.714     -4.04926    2.773658
     597365  |  -1.192525   1.070567    -1.11   0.265    -3.290799    .9057482
     769751  |   .5767718   1.644239     0.35   0.726    -2.645878    3.799422
     892308  |  -.1253875    1.77529    -0.07   0.944    -3.604892    3.354117
     957849  |  -1.922552   1.223281    -1.57   0.116    -4.320139     .475035
    1107433  |  -2.075717   1.456188    -1.43   0.154    -4.929793    .7783595
    1250697  |  -2.615465   1.364356    -1.92   0.055    -5.289554    .0586246
    1381093  |  -.7666397   1.671864    -0.46   0.647    -4.043433    2.510154
    2055503  |   .2493627   2.305013     0.11   0.914     -4.26838    4.767105
    2231416  |  -2.486583    1.32894    -1.87   0.061    -5.091258    .1180927
    2841968  |  -2.128281   1.695406    -1.26   0.209    -5.451216    1.194654
    3299494  |  -2.303427   1.735385    -1.33   0.184    -5.704719    1.097866
    3348128  |   .2457607   .9615231     0.26   0.798     -1.63879    2.130311
    4383332  |   .2814787   1.210103     0.23   0.816     -2.09028    2.653238
    5237566  |  -.8909927   1.998165    -0.45   0.656    -4.807325    3.025339
    5652332  |  -3.011464   1.726697    -1.74   0.081    -6.395728    .3728002
    5893022  |  -2.442597   1.336802    -1.83   0.068     -5.06268     .177486
    5964892  |  -1.629577   1.037465    -1.57   0.116    -3.662971    .4038167
    6136824  |  -1.730302   1.734526    -1.00   0.318    -5.129911    1.669306
    7914963  |   -3.39275   1.770101    -1.92   0.055    -6.862084    .0765843
    8067344  |  -2.884287   .9759788    -2.96   0.003     -4.79717   -.9714033
    8725765  |  -2.212883   1.288346    -1.72   0.086    -4.737996    .3122296
    8788516  |  -1.607255   .9565511    -1.68   0.093     -3.48206    .2675511
    8931088  |   .2215571   1.797277     0.12   0.902    -3.301041    3.744155
             |
       _cons |   5.999275   2.586999     2.32   0.020      .928849     11.0697
------------------------------------------------------------------------------
Endogenous: fpm
Exogenous:  pop pop_2 pop_3 2005.term 505526.state 587449.state 597365.state
            769751.state 892308.state 957849.state 1107433.state
            1250697.state 1381093.state 2055503.state 2231416.state
            2841968.state 3299494.state 3348128.state 4383332.state
            5237566.state 5652332.state 5893022.state 5964892.state
            6136824.state 7914963.state 8067344.state 8725765.state
            8788516.state 8931088.state fpm_hat

. ivregress 2sls fraction_broad pop pop_2 pop_3 (fpm=fpm_hat) i.term i.state,r c
> luster(cityr)

Instrumental variables 2SLS regression            Number of obs   =      1,097
                                                  Wald chi2(30)   =     104.03
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.0413
                                                  Root MSE        =     10.188

                                (Std. err. adjusted for 822 clusters in cityr)
------------------------------------------------------------------------------
             |               Robust
fraction_b~d | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         fpm |    .219817   .2422435     0.91   0.364    -.2549716    .6946056
         pop |  -.0014346    .000811    -1.77   0.077    -.0030242     .000155
       pop_2 |   5.08e-08   2.29e-08     2.21   0.027     5.85e-09    9.57e-08
       pop_3 |  -6.32e-13   2.54e-13    -2.49   0.013    -1.13e-12   -1.35e-13
             |
        term |
       2005  |  -.3657622   1.086541    -0.34   0.736    -2.495344    1.763819
             |
       state |
     505526  |  -.5058102   2.023205    -0.25   0.803    -4.471219    3.459599
     587449  |   3.101752   2.897314     1.07   0.284     -2.57688    8.780384
     597365  |   2.752635   2.203543     1.25   0.212     -1.56623    7.071501
     769751  |   3.906793   5.680505     0.69   0.492    -7.226792    15.04038
     892308  |  -.0346828   2.323923    -0.01   0.988    -4.589488    4.520122
     957849  |  -.9502958   2.500838    -0.38   0.704    -5.851849    3.951257
    1107433  |  -.0564725   2.629071    -0.02   0.983    -5.209358    5.096413
    1250697  |   3.345313   3.313075     1.01   0.313    -3.148196    9.838821
    1381093  |  -.0510297   2.191965    -0.02   0.981    -4.347202    4.245142
    2055503  |  -.6368265   2.745909    -0.23   0.817     -6.01871    4.745057
    2231416  |   -1.93432   2.376049    -0.81   0.416     -6.59129     2.72265
    2841968  |   3.896288   3.407361     1.14   0.253    -2.782016    10.57459
    3299494  |  -2.267655   3.029588    -0.75   0.454    -8.205539    3.670229
    3348128  |   1.149893   2.962389     0.39   0.698    -4.656283    6.956068
    4383332  |   -1.16587   2.139665    -0.54   0.586    -5.359537    3.027798
    5237566  |   1.139016    3.25234     0.35   0.726    -5.235454    7.513486
    5652332  |   .2692897   3.117355     0.09   0.931    -5.840615    6.379194
    5893022  |  -.0931053   2.666397    -0.03   0.972    -5.319147    5.132937
    5964892  |   2.716189   2.959831     0.92   0.359    -3.084972    8.517351
    6136824  |   .0409689   3.230851     0.01   0.990    -6.291383     6.37332
    7914963  |  -2.448797   3.125241    -0.78   0.433    -8.574157    3.676562
    8067344  |  -3.309489   1.960734    -1.69   0.091    -7.152458    .5334802
    8725765  |  -1.148696   2.390387    -0.48   0.631    -5.833769    3.536377
    8788516  |  -.4905837   1.906596    -0.26   0.797    -4.227442    3.246275
    8931088  |   2.968174   3.045316     0.97   0.330    -3.000536    8.936883
             |
       _cons |   10.15386   3.993639     2.54   0.011     2.326475    17.98125
------------------------------------------------------------------------------
Endogenous: fpm
Exogenous:  pop pop_2 pop_3 2005.term 505526.state 587449.state 597365.state
            769751.state 892308.state 957849.state 1107433.state
            1250697.state 1381093.state 2055503.state 2231416.state
            2841968.state 3299494.state 3348128.state 4383332.state
            5237566.state 5652332.state 5893022.state 5964892.state
            6136824.state 7914963.state 8067344.state 8725765.state
            8788516.state 8931088.state fpm_hat

. 
. ***Validity checks for author's specifications***
. ivregress 2sls income pop pop_2 pop_3 (fpm=fpm_hat) i.term i.state,r cluster(c
> ityr)

Instrumental variables 2SLS regression            Number of obs   =      1,157
                                                  Wald chi2(30)   =    2294.21
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.6980
                                                  Root MSE        =      49.93

                                (Std. err. adjusted for 854 clusters in cityr)
------------------------------------------------------------------------------
             |               Robust
      income | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         fpm |   .1024011   1.086732     0.09   0.925    -2.027554    2.232357
         pop |   .0020954   .0040859     0.51   0.608    -.0059128    .0101036
       pop_2 |  -9.80e-09   1.34e-07    -0.07   0.942    -2.72e-07    2.52e-07
       pop_3 |  -1.35e-13   1.65e-12    -0.08   0.935    -3.37e-12    3.10e-12
             |
        term |
       2005  |  -4.739135   5.139766    -0.92   0.357    -14.81289     5.33462
             |
       state |
     505526  |   63.50251   21.10029     3.01   0.003     22.14671    104.8583
     587449  |  -74.68686   15.04597    -4.96   0.000    -104.1764    -45.1973
     597365  |  -107.3198   12.98497    -8.26   0.000    -132.7699   -81.86971
     769751  |  -39.58715   22.75527    -1.74   0.082    -84.18666    5.012361
     892308  |    69.5388    14.3286     4.85   0.000     41.45527    97.62233
     957849  |  -113.7443   13.98802    -8.13   0.000    -141.1603   -86.32823
    1107433  |  -82.20806   14.14966    -5.81   0.000    -109.9409   -54.47525
    1250697  |    29.1852   23.03195     1.27   0.205     -15.9566      74.327
    1381093  |  -84.00649   13.60792    -6.17   0.000    -110.6775   -57.33546
    2055503  |  -52.17193   15.26037    -3.42   0.001    -82.08171   -22.26215
    2231416  |   88.51957   15.61828     5.67   0.000     57.90831    119.1308
    2841968  |  -105.2205   16.94116    -6.21   0.000    -138.4246   -72.01646
    3299494  |   32.20595   19.86122     1.62   0.105    -6.721329    71.13322
    3348128  |  -17.67735   30.95326    -0.57   0.568    -78.34462    42.98992
    4383332  |  -38.94822   15.82826    -2.46   0.014    -69.97105   -7.925397
    5237566  |   40.38345   17.16315     2.35   0.019     6.744304     74.0226
    5652332  |  -92.21325    16.6832    -5.53   0.000    -124.9117   -59.51478
    5893022  |   48.84986   28.36526     1.72   0.085    -6.745031    104.4447
    5964892  |   90.63212   16.12422     5.62   0.000     59.02923     122.235
    6136824  |  -81.83527   16.07563    -5.09   0.000    -113.3429   -50.32761
    7914963  |  -104.3693   16.95305    -6.16   0.000    -137.5966    -71.1419
    8067344  |    73.2351    15.2388     4.81   0.000      43.3676    103.1026
    8725765  |    1.74471   15.93346     0.11   0.913    -29.48431    32.97373
    8788516  |  -74.97561   14.26161    -5.26   0.000    -102.9278   -47.02337
    8931088  |  -87.90809   15.47151    -5.68   0.000    -118.2317   -57.58448
             |
       _cons |   132.2556   22.73785     5.82   0.000     87.69027     176.821
------------------------------------------------------------------------------
Endogenous: fpm
Exogenous:  pop pop_2 pop_3 2005.term 505526.state 587449.state 597365.state
            769751.state 892308.state 957849.state 1107433.state
            1250697.state 1381093.state 2055503.state 2231416.state
            2841968.state 3299494.state 3348128.state 4383332.state
            5237566.state 5652332.state 5893022.state 5964892.state
            6136824.state 7914963.state 8067344.state 8725765.state
            8788516.state 8931088.state fpm_hat

. ivregress 2sls urb pop pop_2 pop_3 (fpm=fpm_hat) i.term i.state,r cluster(city
> r)

Instrumental variables 2SLS regression            Number of obs   =      1,157
                                                  Wald chi2(30)   =     510.81
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.4031
                                                  Root MSE        =      .1693

                                (Std. err. adjusted for 854 clusters in cityr)
------------------------------------------------------------------------------
             |               Robust
         urb | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         fpm |   .0005988   .0036919     0.16   0.871    -.0066373    .0078349
         pop |   4.54e-06   .0000119     0.38   0.704    -.0000189    .0000279
       pop_2 |   1.29e-10   3.73e-10     0.35   0.730    -6.02e-10    8.59e-10
       pop_3 |  -2.79e-15   4.47e-15    -0.62   0.533    -1.16e-14    5.98e-15
             |
        term |
       2005  |  -.0085307   .0175649    -0.49   0.627    -.0429572    .0258958
             |
       state |
     505526  |   .2367433   .0833507     2.84   0.005      .073379    .4001077
     587449  |   .2358637   .0815322     2.89   0.004     .0760636    .3956638
     597365  |   .0185508   .0767411     0.24   0.809    -.1318591    .1689606
     769751  |   .1845438   .0904957     2.04   0.041     .0071756    .3619121
     892308  |   .3191457   .0767466     4.16   0.000     .1687252    .4695662
     957849  |  -.0557178   .0817238    -0.68   0.495    -.2158934    .1044579
    1107433  |    .187297   .0789703     2.37   0.018     .0325181    .3420758
    1250697  |   .1070007    .085555     1.25   0.211    -.0606839    .2746854
    1381093  |   .1419912   .0885371     1.60   0.109    -.0315383    .3155208
    2055503  |   .0671414   .0821032     0.82   0.413    -.0937779    .2280607
    2231416  |   .3817056   .0768488     4.97   0.000     .2310847    .5323265
    2841968  |   .0746918   .0891143     0.84   0.402     -.099969    .2493526
    3299494  |   .2463407    .086823     2.84   0.005     .0761708    .4165107
    3348128  |   .3030492   .0863805     3.51   0.000     .1337465     .472352
    4383332  |   .0998013   .0927399     1.08   0.282    -.0819655    .2815681
    5237566  |   .2383654   .0827967     2.88   0.004     .0760868     .400644
    5652332  |   .0511255   .0837046     0.61   0.541    -.1129324    .2151835
    5893022  |   .3221829   .0762736     4.22   0.000     .1726895    .4716763
    5964892  |   .2271405   .0758772     2.99   0.003      .078424    .3758571
    6136824  |   .1295408   .1048224     1.24   0.217    -.0759074    .3349889
    7914963  |   .0327574    .084138     0.39   0.697    -.1321501    .1976648
    8067344  |    .215091   .0766338     2.81   0.005     .0648914    .3652905
    8725765  |   .2626792   .0776136     3.38   0.001     .1105594    .4147991
    8788516  |  -.0154082   .0763853    -0.20   0.840    -.1651207    .1343043
    8931088  |   .0190751   .0804807     0.24   0.813    -.1386641    .1768144
             |
       _cons |   .3052302   .0861734     3.54   0.000     .1363334     .474127
------------------------------------------------------------------------------
Endogenous: fpm
Exogenous:  pop pop_2 pop_3 2005.term 505526.state 587449.state 597365.state
            769751.state 892308.state 957849.state 1107433.state
            1250697.state 1381093.state 2055503.state 2231416.state
            2841968.state 3299494.state 3348128.state 4383332.state
            5237566.state 5652332.state 5893022.state 5964892.state
            6136824.state 7914963.state 8067344.state 8725765.state
            8788516.state 8931088.state fpm_hat

. ivregress 2sls literacy pop pop_2 pop_3 (fpm=fpm_hat) i.term i.state,r cluster
> (cityr)

Instrumental variables 2SLS regression            Number of obs   =      1,157
                                                  Wald chi2(30)   =    4543.50
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.7819
                                                  Root MSE        =     .05981

                                (Std. err. adjusted for 854 clusters in cityr)
------------------------------------------------------------------------------
             |               Robust
    literacy | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         fpm |    .002104   .0013082     1.61   0.108    -.0004601    .0046681
         pop |  -3.35e-06   4.36e-06    -0.77   0.442    -.0000119    5.20e-06
       pop_2 |   6.93e-11   1.43e-10     0.48   0.628    -2.11e-10    3.49e-10
       pop_3 |  -6.01e-16   1.77e-15    -0.34   0.735    -4.08e-15    2.88e-15
             |
        term |
       2005  |  -.0134703   .0062947    -2.14   0.032    -.0258077    -.001133
             |
       state |
     505526  |   .0393468   .0089511     4.40   0.000     .0218029    .0568907
     587449  |  -.1418197   .0156128    -9.08   0.000    -.1724202   -.1112192
     597365  |  -.1893832   .0120162   -15.76   0.000    -.2129345   -.1658319
     769751  |  -.0496981   .0223185    -2.23   0.026    -.0934415   -.0059547
     892308  |   .0920057   .0089511    10.28   0.000     .0744619    .1095496
     957849  |  -.1602719    .019781    -8.10   0.000     -.199042   -.1215018
    1107433  |  -.1630105   .0129474   -12.59   0.000     -.188387    -.137634
    1250697  |   .0081759   .0196101     0.42   0.677    -.0302591     .046611
    1381093  |  -.1705789   .0163208   -10.45   0.000    -.2025671   -.1385907
    2055503  |  -.1251596   .0266569    -4.70   0.000    -.1774061   -.0729132
    2231416  |   .0845593   .0111371     7.59   0.000     .0627309    .1063877
    2841968  |  -.2314343   .0197126   -11.74   0.000    -.2700703   -.1927983
    3299494  |  -.0048853   .0190306    -0.26   0.797    -.0421847    .0324141
    3348128  |  -.0447957   .0187576    -2.39   0.017    -.0815598   -.0080315
    4383332  |  -.0527076   .0118425    -4.45   0.000    -.0759185   -.0294967
    5237566  |    .051338   .0156206     3.29   0.001     .0207223    .0819537
    5652332  |  -.1824512   .0169465   -10.77   0.000    -.2156658   -.1492367
    5893022  |   .0108499   .0140787     0.77   0.441    -.0167437    .0384436
    5964892  |   .1112291   .0087559    12.70   0.000     .0940678    .1283904
    6136824  |  -.1411023   .0243998    -5.78   0.000    -.1889251   -.0932795
    7914963  |  -.1965391   .0169082   -11.62   0.000    -.2296785   -.1633996
    8067344  |    .114663   .0094981    12.07   0.000     .0960471    .1332789
    8725765  |  -.0016257    .016868    -0.10   0.923    -.0346863     .031435
    8788516  |   -.127547   .0121678   -10.48   0.000    -.1513956   -.1036985
    8931088  |  -.1496902    .014094   -10.62   0.000    -.1773139   -.1220665
             |
       _cons |   .5550084   .0214363    25.89   0.000     .5129939    .5970228
------------------------------------------------------------------------------
Endogenous: fpm
Exogenous:  pop pop_2 pop_3 2005.term 505526.state 587449.state 597365.state
            769751.state 892308.state 957849.state 1107433.state
            1250697.state 1381093.state 2055503.state 2231416.state
            2841968.state 3299494.state 3348128.state 4383332.state
            5237566.state 5652332.state 5893022.state 5964892.state
            6136824.state 7914963.state 8067344.state 8725765.state
            8788516.state 8931088.state fpm_hat

. 
. ***Robustness checks for the specifications with significant results***
. ivregress 2sls broad pop pop_2 pop_3 (fpm=fpm_hat) i.term i.state,r cluster(ci
> tyr), if inrange(popnorm, -1000, 1000)

Instrumental variables 2SLS regression            Number of obs   =        467
                                                  Wald chi2(30)   =     138.96
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.1294
                                                  Root MSE        =     .37262

                                (Std. err. adjusted for 400 clusters in cityr)
------------------------------------------------------------------------------
             |               Robust
       broad | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         fpm |   .0318632   .0132807     2.40   0.016     .0058335    .0578928
         pop |   -.000142   .0000648    -2.19   0.028    -.0002689   -.0000151
       pop_2 |   4.38e-09   2.30e-09     1.91   0.057    -1.22e-10    8.87e-09
       pop_3 |  -5.33e-14   2.98e-14    -1.79   0.074    -1.12e-13    5.08e-15
             |
        term |
       2005  |   .0213625   .0626906     0.34   0.733    -.1015088    .1442338
             |
       state |
     505526  |   .0724493   .1705685     0.42   0.671    -.2618588    .4067574
     587449  |  -.1496438   .2102233    -0.71   0.477     -.561674    .2623864
     597365  |  -.0951014   .1918134    -0.50   0.620    -.4710487    .2808459
     769751  |   .1856518   .1718669     1.08   0.280    -.1512011    .5225047
     892308  |  -.1781129   .1923117    -0.93   0.354    -.5550369     .198811
     957849  |  -.2707466   .2100402    -1.29   0.197    -.6824179    .1409246
    1107433  |  -.0549544   .1916727    -0.29   0.774    -.4306259    .3207172
    1250697  |  -.1818229   .2193229    -0.83   0.407    -.6116879     .248042
    1381093  |  -.2680653   .2162232    -1.24   0.215     -.691855    .1557245
    2055503  |  -.0916096    .223274    -0.41   0.682    -.5292187    .3459994
    2231416  |  -.3703279   .2096112    -1.77   0.077    -.7811583    .0405025
    2841968  |  -.1257998   .2129243    -0.59   0.555    -.5431237    .2915241
    3299494  |  -.4457177   .2438848    -1.83   0.068    -.9237231    .0322878
    3348128  |  -.1648285   .2624522    -0.63   0.530    -.6792253    .3495684
    4383332  |   .4652752   .1793348     2.59   0.009     .1137854     .816765
    5237566  |  -.2313961   .2239971    -1.03   0.302    -.6704224    .2076302
    5652332  |  -.3659181   .2352086    -1.56   0.120    -.8269185    .0950823
    5893022  |  -.1267125   .2210484    -0.57   0.566    -.5599594    .3065344
    5964892  |  -.0754469    .195712    -0.39   0.700    -.4590354    .3081416
    6136824  |  -.3397099   .2899448    -1.17   0.241    -.9079914    .2285715
    7914963  |  -.4678751   .2325373    -2.01   0.044    -.9236398   -.0121103
    8067344  |  -.5373272   .2022107    -2.66   0.008    -.9336529   -.1410016
    8725765  |  -.2740285   .2065123    -1.33   0.185    -.6787852    .1307281
    8788516  |  -.4010051   .2214858    -1.81   0.070    -.8351093    .0330991
    8931088  |   -.188737   .2138941    -0.88   0.378    -.6079618    .2304877
             |
       _cons |   1.368783   .3912738     3.50   0.000     .6019006    2.135666
------------------------------------------------------------------------------
Endogenous: fpm
Exogenous:  pop pop_2 pop_3 2005.term 505526.state 587449.state 597365.state
            769751.state 892308.state 957849.state 1107433.state
            1250697.state 1381093.state 2055503.state 2231416.state
            2841968.state 3299494.state 3348128.state 4383332.state
            5237566.state 5652332.state 5893022.state 5964892.state
            6136824.state 7914963.state 8067344.state 8725765.state
            8788516.state 8931088.state fpm_hat

. ivregress 2sls fraction_narrow pop pop_2 pop_3 (fpm=fpm_hat) i.term i.state,r 
> cluster(cityr), if inrange(popnorm, -1000, 1000)

Instrumental variables 2SLS regression            Number of obs   =        441
                                                  Wald chi2(30)   =      93.70
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.0543
                                                  Root MSE        =     6.0381

                                (Std. err. adjusted for 379 clusters in cityr)
------------------------------------------------------------------------------
             |               Robust
fraction_n~w | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         fpm |    .344781   .2267722     1.52   0.128    -.0996844    .7892465
         pop |  -.0012218    .001018    -1.20   0.230    -.0032172    .0007735
       pop_2 |   3.87e-08   3.17e-08     1.22   0.222    -2.34e-08    1.01e-07
       pop_3 |  -5.22e-13   3.72e-13    -1.40   0.161    -1.25e-12    2.08e-13
             |
        term |
       2005  |   -2.13735    1.05524    -2.03   0.043    -4.205582   -.0691183
             |
       state |
     505526  |  -.1895731    1.71425    -0.11   0.912    -3.549442    3.170296
     587449  |  -1.184662   2.647777    -0.45   0.655    -6.374208    4.004885
     597365  |   -.372142    1.87276    -0.20   0.842    -4.042684      3.2984
     769751  |  -1.025708   1.151785    -0.89   0.373    -3.283166     1.23175
     892308  |   2.996106   3.579984     0.84   0.403    -4.020534    10.01275
     957849  |  -2.336309   1.724626    -1.35   0.176    -5.716514    1.043896
    1107433  |  -1.762815   2.535253    -0.70   0.487     -6.73182    3.206191
    1250697  |  -3.648671   2.146334    -1.70   0.089    -7.855409    .5580667
    1381093  |   .6512019   2.778015     0.23   0.815    -4.793607    6.096011
    2055503  |     1.9682   4.111172     0.48   0.632    -6.089549    10.02595
    2231416  |  -3.078063   1.883648    -1.63   0.102    -6.769946    .6138192
    2841968  |  -3.379087   2.585941    -1.31   0.191    -8.447437    1.689264
    3299494  |   -4.69436    2.50525    -1.87   0.061    -9.604559    .2158394
    3348128  |   .6155637   1.407505     0.44   0.662    -2.143096    3.374223
    4383332  |   .6874902   1.704371     0.40   0.687    -2.653016    4.027996
    5237566  |   -1.38916   2.849546    -0.49   0.626    -6.974167    4.195847
    5652332  |  -3.009209   2.530653    -1.19   0.234    -7.969198    1.950779
    5893022  |   .8809691   3.814105     0.23   0.817    -6.594539    8.356478
    5964892  |  -1.096706   1.410456    -0.78   0.437    -3.861149    1.667738
    6136824  |   .7061531   2.869192     0.25   0.806     -4.91736    6.329666
    7914963  |  -3.890017   2.542027    -1.53   0.126    -8.872298    1.092263
    8067344  |  -3.351191   1.411293    -2.37   0.018    -6.117275   -.5851076
    8725765  |  -1.853044   1.797375    -1.03   0.303    -5.375834    1.669747
    8788516  |  -2.051574   1.312595    -1.56   0.118    -4.624214     .521066
    8931088  |  -2.235691   2.261927    -0.99   0.323    -6.668987    2.197605
             |
       _cons |   5.516136    5.32005     1.04   0.300    -4.910971    15.94324
------------------------------------------------------------------------------
Endogenous: fpm
Exogenous:  pop pop_2 pop_3 2005.term 505526.state 587449.state 597365.state
            769751.state 892308.state 957849.state 1107433.state
            1250697.state 1381093.state 2055503.state 2231416.state
            2841968.state 3299494.state 3348128.state 4383332.state
            5237566.state 5652332.state 5893022.state 5964892.state
            6136824.state 7914963.state 8067344.state 8725765.state
            8788516.state 8931088.state fpm_hat

. 
. /*
> ==============================================================================
> ==============================================================================
> =*/
.         
. ******DEFINING MY FUZZY RD SPECIFICATION*******
. 
. ***Plotting the population histogram to understand the frequency distribution 
> of the running variable***
. hist pop, freq xline(10189 13585 16981 23773 30565 37356 44148)
(bin=30, start=6846, width=1445.2)

. 
. ***Testing the number of observations around the cutoff***
. /***This is necessary to investigate as we want to know whether our dataset co
> ntains enough data points around the cutoffs and within the bandwidths or do s
> ome population thresholds consist mostly of noise around the cutoff. This inve
> stigation is motivated from the pareto-like distribution observed from the fre
> quency graph plotted above***/
. count if pop > 9189 & pop < 11189 
  147

. count if pop > 12585 & pop < 14585 
  136

. count if pop > 15981 & pop < 17981 
  89

. count if pop > 22773 & pop < 24773 
  34

. count if pop > 29565 & pop < 31565 
  33

. count if pop > 36356 & pop < 38356 
  22

. count if pop > 43148 & pop < 45148
  6

. 
. /***As it can be observed from the outcome above, only the first three populat
> ion cutoffs give us enough data points to run a valid RD. Therefore, for the r
> est of the RD specification - we will be working only with the first three thr
> esholds***/
. 
. ***RD Specification for change in corruption***
. /***The  outcome variable is narrow as we wish to observe the impact of fpm tr
> ansfers on instances of corruption. Here, using treatnorm as an instrument is 
> based on the premise that when using data relatively close to the cutoff, bein
> g just above the cutoff is a good enough instrument to the treatment. This giv
> es a strong first stage as well, as investigated below.  
> ***/
. ***Testing for the first stage***
. reg fpm treatnorm pop i.state, cluster(cityr), if inrange(popnorm, -1000, 1000
> ) & pop < 17981

Linear regression                               Number of obs     =        372
                                                F(26, 313)        =          .
                                                Prob > F          =          .
                                                R-squared         =     0.7761
                                                Root MSE          =     3.2205

                                (Std. err. adjusted for 314 clusters in cityr)
------------------------------------------------------------------------------
             |               Robust
         fpm | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
   treatnorm |   1.712932   .3402514     5.03   0.000     1.043463    2.382401
         pop |   .0016788   .0000723    23.23   0.000     .0015366     .001821
             |
       state |
     505526  |   3.266602   .8420583     3.88   0.000     1.609792    4.923413
     587449  |   7.691619   .8810511     8.73   0.000     5.958088    9.425151
     597365  |   6.030757   .6147004     9.81   0.000      4.82129    7.240225
     769751  |   .7202034   1.703768     0.42   0.673    -2.632084    4.072491
     892308  |    2.46882   .6804651     3.63   0.000     1.129956    3.807685
     957849  |   5.381013   1.744342     3.08   0.002     1.948895    8.813132
    1107433  |   6.431676   .7317517     8.79   0.000     4.991901     7.87145
    1250697  |   6.199587   .7112843     8.72   0.000     4.800084     7.59909
    1381093  |   3.167865    .770644     4.11   0.000     1.651568    4.684163
    2055503  |    1.69834   .8041356     2.11   0.035      .116145    3.280534
    2231416  |   6.800988   .7960252     8.54   0.000     5.234751    8.367225
    2841968  |   5.796838   2.243027     2.58   0.010     1.383522    10.21015
    3299494  |   10.57259   .9256265    11.42   0.000     8.751353    12.39383
    3348128  |    -4.2378   .5898233    -7.18   0.000     -5.39832   -3.077281
    4383332  |   -9.68552   .5384983   -17.99   0.000    -10.74505   -8.625986
    5237566  |   8.836941   1.075944     8.21   0.000     6.719945    10.95394
    5652332  |   9.954326    1.19418     8.34   0.000      7.60469    12.30396
    5893022  |   4.782838   .9042895     5.29   0.000     3.003583    6.562092
    5964892  |   3.466354   .8768424     3.95   0.000     1.741103    5.191604
    6136824  |   4.740771   3.193803     1.48   0.139    -1.543266    11.02481
    7914963  |   9.375107   .6843083    13.70   0.000     8.028681    10.72153
    8067344  |   5.242873   .7153771     7.33   0.000     3.835317    6.650429
    8725765  |   6.857879   .6003225    11.42   0.000     5.676701    8.039057
    8788516  |   2.005658   .7683011     2.61   0.009     .4939702    3.517346
    8931088  |   8.362782   .6291572    13.29   0.000      7.12487    9.600694
             |
       _cons |  -1.621935   1.058909    -1.53   0.127    -3.705414    .4615444
------------------------------------------------------------------------------

. predict fpm_firststage
(option xb assumed; fitted values)

. outreg2 treatnorm using firststage_spec.doc, bdec(3) nocons tex(nopretty) repl
> ace
firststage_spec.tex
firststage_spec.doc
dir : seeout

. ***Defining the fuzzy RD***
. ivregress 2sls narrow (fpm = treatnorm) pop i.state, cluster(cityr), if inrang
> e(popnorm, -1000, 1000) & pop < 17981

Instrumental variables 2SLS regression            Number of obs   =        372
                                                  Wald chi2(27)   =     430.21
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.0704
                                                  Root MSE        =     .48152

                                (Std. err. adjusted for 314 clusters in cityr)
------------------------------------------------------------------------------
             |               Robust
      narrow | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         fpm |   .0607244   .0291201     2.09   0.037       .00365    .1177987
         pop |  -.0000931   .0000501    -1.86   0.063    -.0001913    5.00e-06
             |
       state |
     505526  |   -.317932   .2611332    -1.22   0.223    -.8297436    .1938797
     587449  |  -.5530554    .337025    -1.64   0.101    -1.213612    .1075014
     597365  |  -.4070429   .2942298    -1.38   0.167    -.9837228    .1696369
     769751  |  -.3665704   .2875512    -1.27   0.202    -.9301604    .1970197
     892308  |   -.648477   .2383991    -2.72   0.007    -1.115731   -.1812233
     957849  |  -.4330704   .3447906    -1.26   0.209    -1.108848    .2427067
    1107433  |  -.5405053   .3002237    -1.80   0.072    -1.128933    .0479223
    1250697  |  -.6917048   .3248606    -2.13   0.033     -1.32842   -.0549898
    1381093  |  -.6653135   .2450276    -2.72   0.007    -1.145559   -.1850683
    2055503  |  -.6052187    .308681    -1.96   0.050    -1.210222   -.0002151
    2231416  |  -.7714142   .3073555    -2.51   0.012     -1.37382   -.1690085
    2841968  |  -.4673111   .3553497    -1.32   0.188    -1.163784    .2291616
    3299494  |  -.8873788   .4012967    -2.21   0.027    -1.673906   -.1008517
    3348128  |  -.2337859   .2950553    -0.79   0.428    -.8120836    .3445118
    4383332  |  -.1548218   .3260921    -0.47   0.635    -.7939506     .484307
    5237566  |  -.7151821   .3485466    -2.05   0.040    -1.398321   -.0320434
    5652332  |  -.6482978    .380318    -1.70   0.088    -1.393707    .0971118
    5893022  |   -.327172   .3166524    -1.03   0.302    -.9477993    .2934553
    5964892  |   -.233686   .2744149    -0.85   0.394    -.7715292    .3041572
    6136824  |  -.5875942   .3081875    -1.91   0.057    -1.191631    .0164422
    7914963  |  -.8226439   .3587953    -2.29   0.022     -1.52587   -.1194181
    8067344  |  -.8866965   .2624085    -3.38   0.001    -1.401008   -.3723852
    8725765  |  -.6759891   .2944162    -2.30   0.022    -1.253034    -.098944
    8788516  |  -.5764307   .2838334    -2.03   0.042    -1.132734   -.0201275
    8931088  |  -.5197531   .3293954    -1.58   0.115    -1.165356    .1258501
             |
       _cons |   .6176641   .2505354     2.47   0.014     .1266238    1.108704
------------------------------------------------------------------------------
Endogenous: fpm
Exogenous:  pop 505526.state 587449.state 597365.state 769751.state
            892308.state 957849.state 1107433.state 1250697.state
            1381093.state 2055503.state 2231416.state 2841968.state
            3299494.state 3348128.state 4383332.state 5237566.state
            5652332.state 5893022.state 5964892.state 6136824.state
            7914963.state 8067344.state 8725765.state 8788516.state
            8931088.state treatnorm

. outreg2 treatnorm using corruption_spec.doc, bdec(3) nocons tex(nopretty) repl
> ace
corruption_spec.tex
corruption_spec.doc
dir : seeout

. 
. ***RD Specification for change in the entrant's education***
. /**In terms of a good outcome variable - it really depends on what you believe
>  is more important as an indicator of education levels. When arguing for somet
> hing like the education of opposition - it might be a good idea to narrow down
>  of average years of schooling as it is more likely to be reflective of how ee
> ducated an avergae political oppsition contender is. However, both average yea
> rs of schooling and the fraction of opponents with a college degree has been u
> sed below. 
> **/
. ivregress 2sls opp_yschool (fpm = treatnorm) pop i.state i.term, cluster(cityr
> ), if inrange(popnorm, -1000, 1000) & pop < 17981

Instrumental variables 2SLS regression            Number of obs   =        372
                                                  Wald chi2(28)   =     200.59
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.1070
                                                  Root MSE        =     2.5118

                                (Std. err. adjusted for 314 clusters in cityr)
------------------------------------------------------------------------------
             |               Robust
 opp_yschool | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         fpm |  -.0064233   .1491398    -0.04   0.966    -.2987319    .2858853
         pop |   .0000475   .0002608     0.18   0.856    -.0004638    .0005587
             |
       state |
     505526  |   1.301928    1.57623     0.83   0.409    -1.787426    4.391281
     587449  |   2.248321   1.746008     1.29   0.198    -1.173792    5.670435
     597365  |   1.233514    1.48241     0.83   0.405    -1.671956    4.138984
     769751  |   2.932523    1.53016     1.92   0.055     -.066536    5.931583
     892308  |   1.919576   1.293882     1.48   0.138    -.6163853    4.455538
     957849  |    1.56432   1.566339     1.00   0.318    -1.505648    4.634289
    1107433  |   3.490746   1.534316     2.28   0.023     .4835405    6.497951
    1250697  |  -.3341119   1.726891    -0.19   0.847    -3.718757    3.050533
    1381093  |   1.150218   1.474517     0.78   0.435    -1.739782    4.040218
    2055503  |    2.61967   1.305118     2.01   0.045      .061685    5.177655
    2231416  |   3.167976   1.514662     2.09   0.036     .1992937    6.136659
    2841968  |   .7169341    1.45708     0.49   0.623    -2.138891    3.572759
    3299494  |   3.387957   2.112272     1.60   0.109    -.7520197    7.527933
    3348128  |   1.960584   1.348232     1.45   0.146    -.6819022    4.603071
    4383332  |   .4387484   1.538064     0.29   0.775    -2.575801    3.453298
    5237566  |    1.95596   1.812005     1.08   0.280    -1.595505    5.507425
    5652332  |   1.918415   1.889583     1.02   0.310    -1.785099    5.621929
    5893022  |   1.263091   1.777256     0.71   0.477    -2.220266    4.746448
    5964892  |   1.361029   1.541122     0.88   0.377    -1.659514    4.381572
    6136824  |     .87483   2.041738     0.43   0.668    -3.126903    4.876563
    7914963  |   2.610292   1.786083     1.46   0.144    -.8903665    6.110951
    8067344  |   2.421523   1.405088     1.72   0.085    -.3323986    5.175445
    8725765  |   1.652021    1.61114     1.03   0.305    -1.505756    4.809798
    8788516  |   1.729087   1.305337     1.32   0.185    -.8293272    4.287502
    8931088  |   1.166848   1.669827     0.70   0.485    -2.105953    4.439648
             |
        term |
       2005  |  -.1214011   .5710348    -0.21   0.832    -1.240609    .9978065
             |
       _cons |   9.333601   1.368318     6.82   0.000     6.651747    12.01546
------------------------------------------------------------------------------
Endogenous: fpm
Exogenous:  pop 505526.state 587449.state 597365.state 769751.state
            892308.state 957849.state 1107433.state 1250697.state
            1381093.state 2055503.state 2231416.state 2841968.state
            3299494.state 3348128.state 4383332.state 5237566.state
            5652332.state 5893022.state 5964892.state 6136824.state
            7914963.state 8067344.state 8725765.state 8788516.state
            8931088.state 2005.term treatnorm

. outreg2 treatnorm using school_spec.doc, bdec(3) nocons tex(nopretty) replace
school_spec.tex
school_spec.doc
dir : seeout

. ivregress 2sls opp_college (fpm = treatnorm) pop i.state i.term, cluster(cityr
> ), if inrange(popnorm, -1000, 1000) & pop < 17981

Instrumental variables 2SLS regression            Number of obs   =        372
                                                  Wald chi2(28)   =     108.41
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.1252
                                                  Root MSE        =     .33288

                                (Std. err. adjusted for 314 clusters in cityr)
------------------------------------------------------------------------------
             |               Robust
 opp_college | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         fpm |     .01689   .0192582     0.88   0.380    -.0208554    .0546354
         pop |  -.0000218   .0000344    -0.63   0.527    -.0000891    .0000456
             |
       state |
     505526  |   .0940449   .1773649     0.53   0.596     -.253584    .4416738
     587449  |   .0627909   .2004148     0.31   0.754    -.3300149    .4555968
     597365  |   .0006311   .1564215     0.00   0.997    -.3059494    .3072117
     769751  |   .4277196   .1756035     2.44   0.015     .0835431    .7718961
     892308  |   .2288517   .1197714     1.91   0.056    -.0058958    .4635993
     957849  |  -.0028433   .1953443    -0.01   0.988    -.3857111    .3800245
    1107433  |   .4195261   .1670158     2.51   0.012     .0921812    .7468711
    1250697  |  -.2176366   .1659895    -1.31   0.190    -.5429701    .1076969
    1381093  |   .2039548   .1508657     1.35   0.176    -.0917366    .4996463
    2055503  |   .2990222   .1506663     1.98   0.047     .0037216    .5943227
    2231416  |   .2626025     .16682     1.57   0.115    -.0643587    .5895637
    2841968  |   .1432378   .1535772     0.93   0.351    -.1577679    .4442436
    3299494  |   .3235782   .2507496     1.29   0.197     -.167882    .8150384
    3348128  |   .1408299   .1477589     0.95   0.341    -.1487721    .4304319
    4383332  |   .2783105   .1528124     1.82   0.069    -.0211962    .5778173
    5237566  |   .0386649   .2144379     0.18   0.857    -.3816257    .4589554
    5652332  |   .0572964   .2205973     0.26   0.795    -.3750663    .4896591
    5893022  |   .0897308   .2220243     0.40   0.686    -.3454287    .5248904
    5964892  |    .130829   .1732987     0.75   0.450    -.2088302    .4704881
    6136824  |   .0817694   .2377643     0.34   0.731      -.38424    .5477789
    7914963  |   .1756269   .2175581     0.81   0.420    -.2507791    .6020329
    8067344  |   .1585703   .1390047     1.14   0.254    -.1138739    .4310145
    8725765  |   .0827605   .1678129     0.49   0.622    -.2461468    .4116677
    8788516  |   .1115231   .1318209     0.85   0.398    -.1468411    .3698873
    8931088  |  -.0297951   .1935941    -0.15   0.878    -.4092325    .3496423
             |
        term |
       2005  |   -.088223   .0746955    -1.18   0.238    -.2346234    .0581774
             |
       _cons |    .127351   .1298102     0.98   0.327    -.1270724    .3817743
------------------------------------------------------------------------------
Endogenous: fpm
Exogenous:  pop 505526.state 587449.state 597365.state 769751.state
            892308.state 957849.state 1107433.state 1250697.state
            1381093.state 2055503.state 2231416.state 2841968.state
            3299494.state 3348128.state 4383332.state 5237566.state
            5652332.state 5893022.state 5964892.state 6136824.state
            7914963.state 8067344.state 8725765.state 8788516.state
            8931088.state 2005.term treatnorm

. outreg2 treatnorm using college_spec.doc, bdec(3) nocons tex(nopretty) replace
college_spec.tex
college_spec.doc
dir : seeout

. 
. ***RD specification for change in probabiltiy of reelection***
. /***The important change here is to remember to subset our dataset to only inc
> lude the municipalities where the mayor reran for elections to truly understan
> d how does increase in transfers impact probability of reelection. If we also 
> include the municipalitied where the incumbent was not eligible to rerun then 
> our dataset will be biased***/
. ivregress 2sls reelected (fpm = treatnorm) pop i.state i.term, cluster(cityr),
>  if inrange(popnorm, -1000, 1000) & pop < 17981 & rerun == 1
note: 4383332.state identifies no observations in the sample.

Instrumental variables 2SLS regression            Number of obs   =        181
                                                  Wald chi2(27)   =     183.32
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.0840
                                                  Root MSE        =     .47394

                                (Std. err. adjusted for 169 clusters in cityr)
------------------------------------------------------------------------------
             |               Robust
   reelected | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         fpm |  -.0248361   .0378335    -0.66   0.512    -.0989885    .0493163
         pop |   .0000465   .0000636     0.73   0.465    -.0000781    .0001711
             |
       state |
     505526  |   .1261118   .4348198     0.29   0.772    -.7261193    .9783429
     587449  |   .1428615   .5373653     0.27   0.790    -.9103551    1.196078
     597365  |    .130879   .4508917     0.29   0.772    -.7528524     1.01461
     769751  |   .1254074   .4452365     0.28   0.778    -.7472401    .9980549
     892308  |   .2795546   .4476844     0.62   0.532    -.5978907       1.157
     957849  |   .2451294   .5234277     0.47   0.640      -.78077    1.271029
    1107433  |   .2320497   .4832068     0.48   0.631    -.7150183    1.179118
    1250697  |    .449204   .5191316     0.87   0.387    -.5682753    1.466683
    1381093  |   .0378585   .5397233     0.07   0.944     -1.01998    1.095697
    2055503  |   .1017922   .4168373     0.24   0.807    -.7151938    .9187783
    2231416  |   .4271086   .4746492     0.90   0.368    -.5031867    1.357404
    2841968  |   .2122004   .5119981     0.41   0.679    -.7912975    1.215698
    3299494  |   .4670802   .5910317     0.79   0.429    -.6913207    1.625481
    3348128  |  -.0298921   .4222133    -0.07   0.944     -.857415    .7976308
    4383332  |          0  (empty)
    5237566  |   .6722204   .6562537     1.02   0.306    -.6140132    1.958454
    5652332  |   .6940893   .6026223     1.15   0.249    -.4870288    1.875207
    5893022  |   .4115792    .493159     0.83   0.404    -.5549946    1.378153
    5964892  |   .1172734   .4461348     0.26   0.793    -.7571348    .9916815
    6136824  |   .9037362    .625518     1.44   0.149    -.3222564    2.129729
    7914963  |   .6938768    .561431     1.24   0.216    -.4065077    1.794261
    8067344  |  -.0111218    .442806    -0.03   0.980    -.8790056    .8567619
    8725765  |   .2499211   .4727028     0.53   0.597    -.6765594    1.176402
    8788516  |  -.0432366   .4606102    -0.09   0.925    -.9460161    .8595428
    8931088  |   .4239619    .511713     0.83   0.407    -.5789771    1.426901
             |
        term |
       2005  |   .1774112    .149576     1.19   0.236    -.1157525    .4705748
             |
       _cons |   .2697297   .4283745     0.63   0.529    -.5698689    1.109328
------------------------------------------------------------------------------
Endogenous: fpm
Exogenous:  pop 505526.state 587449.state 597365.state 769751.state
            892308.state 957849.state 1107433.state 1250697.state
            1381093.state 2055503.state 2231416.state 2841968.state
            3299494.state 3348128.state 5237566.state 5652332.state
            5893022.state 5964892.state 6136824.state 7914963.state
            8067344.state 8725765.state 8788516.state 8931088.state
            2005.term treatnorm

. outreg2 fpm_hat using reelection_spec.doc, bdec(3) nocons tex(nopretty) replac
> e
reelection_spec.tex
reelection_spec.doc
dir : seeout

. 
. /*
> ==============================================================================
> ==============================================================================
> =*/
. 
. ******RUNNING ROBUSTNESS CHECKS******
. /***It is important to note that I am not running any robustness checks for th
> e impact of fpm transfers on education levels of the opponent and probability 
> of reelection as the RD specification for both gave me statistically insignifi
> cant results***/
. 
. /***ROBUSTNESS CHECK ONE
> Our regression specification should be robust to changes in slopes before and 
> after the cutoff. 
> The idea is to allow for different slopes before and after different cutoffs a
> nd assess the changes in our regression coefficients and outputs***/
. *1. Defining the population cutoff points
. local cutoffs 10189 13584 16980

. *2. Loop over   each cutoff, generate a new dummy variable for each and genera
> te interaction term for each dummy 
. local i 1

. foreach cutoff in `cutoffs' {
  2.     gen cutoffvar_`i' = pop >= `cutoff'
  3.         gen inter_`i' = cutoffvar_`i' * pop
  4.     local ++i
  5. }

. *3. Allowing for different slopes before and after the cutoffs
. /***Changing slopes at all cutoffs
> This makes sense because it allowed for the assessment of each threshold's uni
> que impact while accounting for the interdependence between thresholds***/
. ivregress 2sls narrow (fpm = treatnorm) pop inter_1 i.state, cluster(cityr), i
> f inrange(popnorm, -1000, 1000) & pop < 17981

Instrumental variables 2SLS regression            Number of obs   =        372
                                                  Wald chi2(28)   =     424.49
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.0548
                                                  Root MSE        =     .48554

                                (Std. err. adjusted for 314 clusters in cityr)
------------------------------------------------------------------------------
             |               Robust
      narrow | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         fpm |   .0650497   .0320149     2.03   0.042     .0023017    .1277977
         pop |  -.0000963   .0000502    -1.92   0.055    -.0001946    2.09e-06
     inter_1 |  -2.36e-06   .0000102    -0.23   0.817    -.0000223    .0000176
             |
       state |
     505526  |  -.3296197   .2682044    -1.23   0.219    -.8552906    .1960512
     587449  |  -.5825997   .3517225    -1.66   0.098    -1.271963    .1067638
     597365  |  -.4326248   .3119287    -1.39   0.165    -1.043994    .1787441
     769751  |  -.3711577   .2905471    -1.28   0.201    -.9406196    .1983042
     892308  |  -.6566627   .2442578    -2.69   0.007    -1.135399   -.1779263
     957849  |  -.4590011   .3591768    -1.28   0.201    -1.162975    .2449726
    1107433  |  -.5685789    .319175    -1.78   0.075     -1.19415    .0569925
    1250697  |  -.7146537   .3370204    -2.12   0.034    -1.375201   -.0541059
    1381093  |  -.6812203   .2537213    -2.68   0.007    -1.178505   -.1839357
    2055503  |  -.6084382    .313754    -1.94   0.052    -1.223385    .0065083
    2231416  |  -.7981201   .3156899    -2.53   0.011    -1.416861   -.1793793
    2841968  |  -.4918606   .3671596    -1.34   0.180     -1.21148    .2277591
    3299494  |   -.930086   .4285944    -2.17   0.030    -1.770116   -.0900564
    3348128  |  -.2091095   .3063199    -0.68   0.495    -.8094856    .3912666
    4383332  |  -.1116185   .3517805    -0.32   0.751    -.8010956    .5778586
    5237566  |  -.7509547   .3650414    -2.06   0.040    -1.466423   -.0354866
    5652332  |  -.6886696   .4062854    -1.70   0.090    -1.484974    .1076352
    5893022  |  -.3468701   .3261196    -1.06   0.287    -.9860528    .2923126
    5964892  |  -.2426839   .2789242    -0.87   0.384    -.7893653    .3039974
    6136824  |  -.6034928   .3189519    -1.89   0.058    -1.228627    .0216414
    7914963  |  -.8600986   .3851221    -2.23   0.026    -1.614924   -.1052732
    8067344  |  -.9103643   .2776679    -3.28   0.001    -1.454583   -.3661452
    8725765  |  -.7050158   .3123124    -2.26   0.024    -1.317137   -.0928946
    8788516  |  -.5852165   .2880006    -2.03   0.042    -1.149687   -.0207458
    8931088  |  -.5552869   .3513133    -1.58   0.114    -1.243848    .1332746
             |
       _cons |   .5917102   .2716078     2.18   0.029     .0593687    1.124052
------------------------------------------------------------------------------
Endogenous: fpm
Exogenous:  pop inter_1 505526.state 587449.state 597365.state 769751.state
            892308.state 957849.state 1107433.state 1250697.state
            1381093.state 2055503.state 2231416.state 2841968.state
            3299494.state 3348128.state 4383332.state 5237566.state
            5652332.state 5893022.state 5964892.state 6136824.state
            7914963.state 8067344.state 8725765.state 8788516.state
            8931088.state treatnorm

. outreg2 treatnorm using threshold_1.doc, bdec(3) nocons tex(nopretty) replace
threshold_1.tex
threshold_1.doc
dir : seeout

. ivregress 2sls narrow (fpm = treatnorm) pop inter_2 i.state, cluster(cityr), i
> f inrange(popnorm, -1000, 1000) & pop < 17981

Instrumental variables 2SLS regression            Number of obs   =        372
                                                  Wald chi2(28)   =     423.01
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.0178
                                                  Root MSE        =     .49495

                                (Std. err. adjusted for 314 clusters in cityr)
------------------------------------------------------------------------------
             |               Robust
      narrow | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         fpm |    .074547   .0327515     2.28   0.023     .0103552    .1387388
         pop |   -.000096   .0000514    -1.87   0.062    -.0001968    4.80e-06
     inter_2 |  -8.16e-06   7.69e-06    -1.06   0.289    -.0000232    6.91e-06
             |
       state |
     505526  |  -.3600752   .2611927    -1.38   0.168    -.8720034    .1518531
     587449  |  -.6718414   .3528517    -1.90   0.057    -1.363418    .0197352
     597365  |  -.4788192   .3007411    -1.59   0.111    -1.068261    .1106224
     769751  |  -.3536738   .2925247    -1.21   0.227    -.9270118    .2196641
     892308  |  -.6770327   .2366187    -2.86   0.004    -1.140797   -.2132685
     957849  |    -.50555   .3672624    -1.38   0.169    -1.225371     .214271
    1107433  |  -.6150055   .3085529    -1.99   0.046    -1.219758   -.0102529
    1250697  |  -.7775835    .338018    -2.30   0.021    -1.440087   -.1150803
    1381093  |   -.694461    .245109    -2.83   0.005    -1.174866   -.2140563
    2055503  |  -.6225236   .3086282    -2.02   0.044    -1.227424   -.0176234
    2231416  |  -.8655559   .3269046    -2.65   0.008    -1.506277   -.2248346
    2841968  |  -.5459272   .3820069    -1.43   0.153    -1.294647    .2027926
    3299494  |  -1.039241   .4304264    -2.41   0.016    -1.882861   -.1956206
    3348128  |  -.1928624   .2933374    -0.66   0.511    -.7677931    .3820683
    4383332  |   .0157986   .3720348     0.04   0.966    -.7133762    .7449734
    5237566  |  -.8388829   .3776784    -2.22   0.026    -1.579119   -.0986468
    5652332  |  -.7769969   .4041656    -1.92   0.055    -1.569147    .0151532
    5893022  |   -.401705   .3260173    -1.23   0.218    -1.040687    .2372772
    5964892  |  -.2851215   .2753927    -1.04   0.301    -.8248812    .2546383
    6136824  |  -.6597344   .3292534    -2.00   0.045    -1.305059   -.0144097
    7914963  |   -.952615   .3799288    -2.51   0.012    -1.697262   -.2079683
    8067344  |  -.9472319   .2683853    -3.53   0.000    -1.473257   -.4212063
    8725765  |  -.7637284   .3079334    -2.48   0.013    -1.367267   -.1601899
    8788516  |  -.6079791    .290184    -2.10   0.036    -1.176729   -.0392289
    8931088  |  -.6284459   .3491012    -1.80   0.072    -1.312672    .0557799
             |
       _cons |   .4140652   .3322537     1.25   0.213    -.2371401     1.06527
------------------------------------------------------------------------------
Endogenous: fpm
Exogenous:  pop inter_2 505526.state 587449.state 597365.state 769751.state
            892308.state 957849.state 1107433.state 1250697.state
            1381093.state 2055503.state 2231416.state 2841968.state
            3299494.state 3348128.state 4383332.state 5237566.state
            5652332.state 5893022.state 5964892.state 6136824.state
            7914963.state 8067344.state 8725765.state 8788516.state
            8931088.state treatnorm

. outreg2 treatnorm using threshold_2.doc, bdec(3) nocons tex(nopretty) replace
threshold_2.tex
threshold_2.doc
dir : seeout

. ivregress 2sls narrow (fpm = treatnorm) pop inter_3 i.state, cluster(cityr), i
> f inrange(popnorm, -1000, 1000) & pop < 17981

Instrumental variables 2SLS regression            Number of obs   =        372
                                                  Wald chi2(28)   =     466.17
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.1243
                                                  Root MSE        =     .46734

                                (Std. err. adjusted for 314 clusters in cityr)
------------------------------------------------------------------------------
             |               Robust
      narrow | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         fpm |   .0442118   .0314444     1.41   0.160     -.017418    .1058416
         pop |  -.0000767   .0000511    -1.50   0.134    -.0001769    .0000235
     inter_3 |   .0000102   6.01e-06     1.70   0.090    -1.58e-06     .000022
             |
       state |
     505526  |  -.2356992   .2646193    -0.89   0.373    -.7543436    .2829451
     587449  |   -.411006   .3541077    -1.16   0.246    -1.105044    .2830324
     597365  |  -.2857213   .3053003    -0.94   0.349     -.884099    .3126563
     769751  |  -.3389947   .2823821    -1.20   0.230    -.8924535    .2144641
     892308  |  -.5836093   .2423106    -2.41   0.016    -1.058529   -.1086893
     957849  |  -.3655813   .3344904    -1.09   0.274     -1.02117    .2900078
    1107433  |   -.417948   .3121286    -1.34   0.181    -1.029709    .1938128
    1250697  |  -.5606266   .3363653    -1.67   0.096     -1.21989    .0986373
    1381093  |  -.6022945   .2469644    -2.44   0.015    -1.086336   -.1182531
    2055503  |  -.5306844   .3023041    -1.76   0.079    -1.123189    .0618206
    2231416  |  -.6394347   .3214954    -1.99   0.047    -1.269554   -.0093154
    2841968  |  -.3715994   .3401846    -1.09   0.275    -1.038349    .2951501
    3299494  |  -.6965127   .4216742    -1.65   0.099    -1.522979    .1299535
    3348128  |  -.2713031   .2959521    -0.92   0.359    -.8513585    .3087523
    4383332  |  -.2578793   .3335348    -0.77   0.439    -.9115956    .3958369
    5237566  |  -.5472661   .3667989    -1.49   0.136    -1.266179    .1716464
    5652332  |  -.4456344   .4028376    -1.11   0.269    -1.235182    .3439128
    5893022  |  -.2653383   .3226925    -0.82   0.411     -.897804    .3671274
    5964892  |  -.1409455   .2807906    -0.50   0.616     -.691285    .4093941
    6136824  |  -.5005608   .3066595    -1.63   0.103    -1.101602    .1004808
    7914963  |  -.6415095   .3789561    -1.69   0.090     -1.38425    .1012309
    8067344  |  -.7848999   .2717366    -2.89   0.004    -1.317494    -.252306
    8725765  |  -.5504308   .3060197    -1.80   0.072    -1.150218    .0493568
    8788516  |  -.5525582   .2801596    -1.97   0.049    -1.101661   -.0034556
    8931088  |  -.3684401   .3461776    -1.06   0.287    -1.046936    .3100554
             |
       _cons |   .7155648   .2537452     2.82   0.005     .2182334    1.212896
------------------------------------------------------------------------------
Endogenous: fpm
Exogenous:  pop inter_3 505526.state 587449.state 597365.state 769751.state
            892308.state 957849.state 1107433.state 1250697.state
            1381093.state 2055503.state 2231416.state 2841968.state
            3299494.state 3348128.state 4383332.state 5237566.state
            5652332.state 5893022.state 5964892.state 6136824.state
            7914963.state 8067344.state 8725765.state 8788516.state
            8931088.state treatnorm

. outreg2 treatnorm using threshold_3.doc, bdec(3) nocons tex(nopretty) replace
threshold_3.tex
threshold_3.doc
dir : seeout

. 
. /*ROBUSTNESS CHECK TWO
> Our regression specification should be robust to changes in bandwidths. This i
> s important because we want to ensure that our findings are not sensitive to s
> pecific choices of bandwidths or thresholds settings*/
. ivregress 2sls narrow (fpm = treatnorm) pop i.state, cluster(cityr), if inrang
> e(popnorm, -800, 800) & pop < 17781

Instrumental variables 2SLS regression            Number of obs   =        300
                                                  Wald chi2(27)   =     380.19
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.0913
                                                  Root MSE        =     .47576

                                (Std. err. adjusted for 262 clusters in cityr)
------------------------------------------------------------------------------
             |               Robust
      narrow | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         fpm |    .055956   .0303144     1.85   0.065    -.0034591    .1153711
         pop |  -.0000812   .0000521    -1.56   0.119    -.0001833    .0000209
             |
       state |
     505526  |  -.4276674   .2717578    -1.57   0.116    -.9603029    .1049681
     587449  |   -.426336   .3330019    -1.28   0.200    -1.079008    .2263358
     597365  |  -.3959058   .2944148    -1.34   0.179    -.9729483    .1811367
     769751  |  -.1881281   .3218673    -0.58   0.559    -.8189765    .4427203
     892308  |  -.6364033   .2359322    -2.70   0.007    -1.098822   -.1739847
     957849  |   -.414355   .3763493    -1.10   0.271    -1.151986     .323276
    1107433  |  -.4562734   .3030517    -1.51   0.132    -1.050244    .1376972
    1250697  |    -.71736   .3269647    -2.19   0.028    -1.358199    -.076521
    1381093  |  -.6329568   .2499161    -2.53   0.011    -1.122783   -.1431302
    2055503  |  -.5984126   .3060168    -1.96   0.051    -1.198195    .0013693
    2231416  |  -.8385436   .3133926    -2.68   0.007    -1.452782   -.2243053
    2841968  |  -.5104852   .3515553    -1.45   0.146    -1.199521    .1785506
    3299494  |  -.8489418   .4086307    -2.08   0.038    -1.649843   -.0480403
    3348128  |    -.19157   .3073411    -0.62   0.533    -.7939475    .4108075
    4383332  |  -.1987027   .3319674    -0.60   0.549    -.8493468    .4519414
    5237566  |  -.8398132   .3543765    -2.37   0.018    -1.534378    -.145248
    5652332  |  -.6104707   .3680759    -1.66   0.097    -1.331886    .1109449
    5893022  |  -.3802559   .3330251    -1.14   0.254    -1.032973    .2724614
    5964892  |  -.0721695    .285239    -0.25   0.800    -.6312276    .4868887
    6136824  |  -.5652086    .302205    -1.87   0.061    -1.157519    .0271023
    7914963  |   -.781478   .3614029    -2.16   0.031    -1.489815   -.0731414
    8067344  |  -.8150869   .2670926    -3.05   0.002    -1.338579   -.2915949
    8725765  |  -.6525014   .3039475    -2.15   0.032    -1.248228   -.0567752
    8788516  |  -.5987872   .3147694    -1.90   0.057    -1.215724    .0181494
    8931088  |  -.4482409   .3430255    -1.31   0.191    -1.120558    .2240767
             |
       _cons |   .5616983   .2551904     2.20   0.028     .0615344    1.061862
------------------------------------------------------------------------------
Endogenous: fpm
Exogenous:  pop 505526.state 587449.state 597365.state 769751.state
            892308.state 957849.state 1107433.state 1250697.state
            1381093.state 2055503.state 2231416.state 2841968.state
            3299494.state 3348128.state 4383332.state 5237566.state
            5652332.state 5893022.state 5964892.state 6136824.state
            7914963.state 8067344.state 8725765.state 8788516.state
            8931088.state treatnorm

. outreg2 treatnorm using bandwidth_1.doc, bdec(3) nocons tex(nopretty) replace
bandwidth_1.tex
bandwidth_1.doc
dir : seeout

. ivregress 2sls narrow (fpm = treatnorm) pop i.state, cluster(cityr), if inrang
> e(popnorm, -1200, 1200) & pop < 18181

Instrumental variables 2SLS regression            Number of obs   =        450
                                                  Wald chi2(27)   =      63.46
                                                  Prob > chi2     =     0.0001
                                                  R-squared       =          .
                                                  Root MSE        =     .52062

                                (Std. err. adjusted for 373 clusters in cityr)
------------------------------------------------------------------------------
             |               Robust
      narrow | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         fpm |   .0898149   .0336283     2.67   0.008     .0239046    .1557252
         pop |  -.0001348   .0000557    -2.42   0.016     -.000244   -.0000256
             |
       state |
     505526  |  -.3951374    .268399    -1.47   0.141    -.9211898     .130915
     587449  |  -.7581622    .353543    -2.14   0.032    -1.451094   -.0652307
     597365  |  -.6316036   .3106281    -2.03   0.042    -1.240424   -.0227837
     769751  |  -.4568033   .3053754    -1.50   0.135    -1.055328    .1417215
     892308  |  -.6975466   .2516504    -2.77   0.006    -1.190772   -.2043209
     957849  |  -.6365938   .3908208    -1.63   0.103    -1.402588    .1294008
    1107433  |  -.7067541   .3159125    -2.24   0.025    -1.325931    -.087577
    1250697  |  -.8040899   .3384416    -2.38   0.018    -1.467423   -.1407564
    1381093  |  -.7566688   .2402517    -3.15   0.002    -1.227553   -.2857842
    2055503  |  -.6765738   .2908067    -2.33   0.020    -1.246544    -.106603
    2231416  |  -.9988756   .3355915    -2.98   0.003    -1.656623   -.3411284
    2841968  |  -.5422088   .3419316    -1.59   0.113    -1.212382    .1279647
    3299494  |  -1.171901   .4327964    -2.71   0.007    -2.020166   -.3236353
    3348128  |   .0197675   .3052639     0.06   0.948    -.5785387    .6180737
    4383332  |   .2499706   .4035158     0.62   0.536    -.5409058    1.040847
    5237566  |  -1.038077   .3731341    -2.78   0.005    -1.769407   -.3067478
    5652332  |  -.9716446    .409373    -2.37   0.018    -1.774001   -.1692883
    5893022  |  -.7243351   .2970074    -2.44   0.015    -1.306459   -.1422113
    5964892  |  -.5428193   .2959747    -1.83   0.067    -1.122919    .0372805
    6136824  |  -.5620448   .3439878    -1.63   0.102    -1.236248    .1121589
    7914963  |  -1.068549   .4022443    -2.66   0.008    -1.856933   -.2801646
    8067344  |  -.9122679   .2721436    -3.35   0.001     -1.44566   -.3788762
    8725765  |  -.9169714   .3093009    -2.96   0.003     -1.52319   -.3107529
    8788516  |  -.8089551   .2738336    -2.95   0.003    -1.345659    -.272251
    8931088  |  -.7605679   .3504935    -2.17   0.030    -1.447523   -.0736132
             |
       _cons |   .5561101   .2448388     2.27   0.023     .0762349    1.035985
------------------------------------------------------------------------------
Endogenous: fpm
Exogenous:  pop 505526.state 587449.state 597365.state 769751.state
            892308.state 957849.state 1107433.state 1250697.state
            1381093.state 2055503.state 2231416.state 2841968.state
            3299494.state 3348128.state 4383332.state 5237566.state
            5652332.state 5893022.state 5964892.state 6136824.state
            7914963.state 8067344.state 8725765.state 8788516.state
            8931088.state treatnorm

. outreg2 treatnorm using bandwidth_2.doc, bdec(3) nocons tex(nopretty) replace
bandwidth_2.tex
bandwidth_2.doc
dir : seeout

. 
. /*ROBUSTNESS CHECK THREE
> The regression specification should be robust to changes in the order of the r
> unning variable. If we variables like pop2 and pop3, we should not expect the 
> outcome change by a lot*/
. ivregress 2sls narrow (fpm = treatnorm) pop pop_2 i.state, cluster(cityr), if 
> inrange(popnorm, -1000, 1000) & pop < 17981

Instrumental variables 2SLS regression            Number of obs   =        372
                                                  Wald chi2(28)   =     429.76
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.0632
                                                  Root MSE        =     .48337

                                (Std. err. adjusted for 314 clusters in cityr)
------------------------------------------------------------------------------
             |               Robust
      narrow | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         fpm |   .0630811   .0289365     2.18   0.029     .0063666    .1197956
         pop |  -.0001761    .000125    -1.41   0.159    -.0004212     .000069
       pop_2 |   2.94e-09   4.27e-09     0.69   0.490    -5.42e-09    1.13e-08
             |
       state |
     505526  |  -.3235894   .2646014    -1.22   0.221    -.8421986    .1950198
     587449  |  -.5724065   .3412173    -1.68   0.093     -1.24118    .0963672
     597365  |  -.4250371   .2979776    -1.43   0.154    -1.009063    .1589883
     769751  |  -.3768471   .2913505    -1.29   0.196    -.9478836    .1941895
     892308  |  -.6557785   .2425514    -2.70   0.007    -1.131171   -.1803864
     957849  |  -.4640775   .3530901    -1.31   0.189    -1.156121    .2279663
    1107433  |  -.5607254   .3050622    -1.84   0.066    -1.158636    .0371855
    1250697  |  -.7117824   .3287504    -2.17   0.030    -1.356121   -.0674435
    1381093  |  -.6819733   .2500622    -2.73   0.006    -1.172086   -.1918604
    2055503  |  -.5999818   .3121553    -1.92   0.055    -1.211795    .0118314
    2231416  |  -.7849535   .3087066    -2.54   0.011    -1.390007   -.1798996
    2841968  |  -.4827788   .3588685    -1.35   0.179    -1.186148    .2205906
    3299494  |  -.9126985   .4027881    -2.27   0.023    -1.702149   -.1232483
    3348128  |  -.2128332   .2982653    -0.71   0.475    -.7974225    .3717561
    4383332  |  -.1143479   .3290902    -0.35   0.728    -.7593528     .530657
    5237566  |  -.7322927   .3496823    -2.09   0.036    -1.417658   -.0469279
    5652332  |  -.6701845   .3827942    -1.75   0.080    -1.420447    .0800784
    5893022  |  -.3473151   .3191079    -1.09   0.276     -.972755    .2781248
    5964892  |  -.2425956   .2778209    -0.87   0.383    -.7871146    .3019235
    6136824  |  -.6027537   .3149386    -1.91   0.056    -1.220022    .0145145
    7914963  |   -.841128   .3616826    -2.33   0.020    -1.550013   -.1322431
    8067344  |  -.9032407   .2655398    -3.40   0.001    -1.423689   -.3827923
    8725765  |  -.6958421   .2975453    -2.34   0.019     -1.27902    -.112664
    8788516  |  -.5912174   .2883864    -2.05   0.040    -1.156444   -.0259906
    8931088  |  -.5438465   .3323652    -1.64   0.102     -1.19527    .1075773
             |
       _cons |   1.130455   .7988145     1.42   0.157    -.4351929    2.696102
------------------------------------------------------------------------------
Endogenous: fpm
Exogenous:  pop pop_2 505526.state 587449.state 597365.state 769751.state
            892308.state 957849.state 1107433.state 1250697.state
            1381093.state 2055503.state 2231416.state 2841968.state
            3299494.state 3348128.state 4383332.state 5237566.state
            5652332.state 5893022.state 5964892.state 6136824.state
            7914963.state 8067344.state 8725765.state 8788516.state
            8931088.state treatnorm

. outreg2 treatnorm using pop_1.doc, bdec(3) nocons tex(nopretty) replace
pop_1.tex
pop_1.doc
dir : seeout

. ivregress 2sls narrow (fpm = treatnorm) pop pop_3 i.state, cluster(cityr), if 
> inrange(popnorm, -1000, 1000) & pop < 17981

Instrumental variables 2SLS regression            Number of obs   =        372
                                                  Wald chi2(28)   =     418.95
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.0644
                                                  Root MSE        =     .48307

                                (Std. err. adjusted for 314 clusters in cityr)
------------------------------------------------------------------------------
             |               Robust
      narrow | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         fpm |   .0628025   .0289164     2.17   0.030     .0061274    .1194776
         pop |   -.000139   .0000754    -1.85   0.065    -.0002867    8.64e-06
       pop_3 |   7.66e-14   1.04e-13     0.74   0.462    -1.28e-13    2.81e-13
             |
       state |
     505526  |  -.3225609   .2645998    -1.22   0.223     -.841167    .1960452
     587449  |  -.5706514   .3411471    -1.67   0.094    -1.239287    .0979846
     597365  |  -.4235092   .2978062    -1.42   0.155    -1.007199    .1601802
     769751  |  -.3766321   .2913163    -1.29   0.196    -.9476015    .1943374
     892308  |  -.6551631   .2425573    -2.70   0.007    -1.130567   -.1797596
     957849  |  -.4640056    .352656    -1.32   0.188    -1.155199    .2271874
    1107433  |  -.5588697   .3048105    -1.83   0.067    -1.156287     .038548
    1250697  |  -.7106561   .3285842    -2.16   0.031    -1.354669   -.0666429
    1381093  |  -.6816472   .2499233    -2.73   0.006    -1.171488   -.1918065
    2055503  |  -.5989217   .3119653    -1.92   0.055    -1.210362    .0125191
    2231416  |  -.7828642   .3089246    -2.53   0.011    -1.388345   -.1773831
    2841968  |  -.4812589    .358649    -1.34   0.180    -1.184198    .2216802
    3299494  |  -.9101132   .4023933    -2.26   0.024     -1.69879   -.1214368
    3348128  |  -.2138064   .2980632    -0.72   0.473    -.7979995    .3703866
    4383332  |   -.115626   .3286617    -0.35   0.725     -.759791     .528539
    5237566  |  -.7297446   .3496868    -2.09   0.037    -1.415118   -.0443711
    5652332  |  -.6671702   .3826285    -1.74   0.081    -1.417108    .0827678
    5893022  |  -.3467468   .3188799    -1.09   0.277    -.9717399    .2782464
    5964892  |  -.2419035   .2777475    -0.87   0.384    -.7862787    .3024716
    6136824  |  -.6017469   .3148061    -1.91   0.056    -1.218755    .0152616
    7914963  |  -.8383995   .3615697    -2.32   0.020    -1.547063   -.1297359
    8067344  |  -.9019959   .2654478    -3.40   0.001    -1.422264   -.3817278
    8725765  |  -.6940865   .2973373    -2.33   0.020    -1.276857   -.1113162
    8788516  |  -.5918346   .2883606    -2.05   0.040    -1.157011   -.0266581
    8931088  |  -.5417975   .3321241    -1.63   0.103    -1.192749    .1091538
             |
       _cons |   .9824808   .5695216     1.73   0.085    -.1337611    2.098723
------------------------------------------------------------------------------
Endogenous: fpm
Exogenous:  pop pop_3 505526.state 587449.state 597365.state 769751.state
            892308.state 957849.state 1107433.state 1250697.state
            1381093.state 2055503.state 2231416.state 2841968.state
            3299494.state 3348128.state 4383332.state 5237566.state
            5652332.state 5893022.state 5964892.state 6136824.state
            7914963.state 8067344.state 8725765.state 8788516.state
            8931088.state treatnorm

. outreg2 treatnorm using pop_2.doc, bdec(3) nocons tex(nopretty) replace
pop_2.tex
pop_2.doc
dir : seeout

. ivregress 2sls narrow (fpm = treatnorm) pop pop_2 pop_3 i.state, cluster(cityr
> ), if inrange(popnorm, -1000, 1000) & pop < 17981

Instrumental variables 2SLS regression            Number of obs   =        372
                                                  Wald chi2(29)   =     450.70
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.1160
                                                  Root MSE        =     .46956

                                (Std. err. adjusted for 314 clusters in cityr)
------------------------------------------------------------------------------
             |               Robust
      narrow | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         fpm |   .0468396   .0333756     1.40   0.160    -.0185754    .1122545
         pop |   .0014494   .0015445     0.94   0.348    -.0015778    .0044765
       pop_2 |  -1.18e-07   1.13e-07    -1.04   0.300    -3.40e-07    1.05e-07
       pop_3 |   2.96e-12   2.77e-12     1.07   0.285    -2.47e-12    8.39e-12
             |
       state |
     505526  |  -.2707118   .2682994    -1.01   0.313    -.7965689    .2551454
     587449  |  -.4596169   .3603934    -1.28   0.202    -1.165975    .2467412
     597365  |  -.3241752    .315234    -1.03   0.304    -.9420225    .2936721
     769751  |  -.3446388   .2873645    -1.20   0.230    -.9078628    .2185852
     892308  |   -.615029    .241773    -2.54   0.011    -1.088895   -.1411626
     957849  |  -.3891687   .3478706    -1.12   0.263    -1.070983    .2926451
    1107433  |  -.4420281   .3235969    -1.37   0.172    -1.076266    .1922103
    1250697  |  -.6215829   .3374858    -1.84   0.066    -1.283043    .0398771
    1381093  |  -.6306241    .251287    -2.51   0.012    -1.123138   -.1381108
    2055503  |  -.5712284   .2978131    -1.92   0.055    -1.154931    .0124746
    2231416  |  -.6727761   .3208139    -2.10   0.036     -1.30156   -.0439924
    2841968  |  -.3881016   .3519902    -1.10   0.270     -1.07799    .3017865
    3299494  |  -.7539657    .432864    -1.74   0.082    -1.602364    .0944321
    3348128  |  -.2991558   .3029183    -0.99   0.323    -.8928647    .2945531
    4383332  |  -.2578549   .3538253    -0.73   0.466    -.9513397    .4356298
    5237566  |  -.5940892   .3717048    -1.60   0.110    -1.322617    .1344388
    5652332  |  -.5028701   .4165924    -1.21   0.227    -1.319376    .3136361
    5893022  |  -.2785095    .325463    -0.86   0.392    -.9164054    .3593863
    5964892  |  -.1951468   .2785616    -0.70   0.484    -.7411175    .3508238
    6136824  |  -.5286115   .3153038    -1.68   0.094    -1.146596    .0893726
    7914963  |  -.6927662   .3913082    -1.77   0.077    -1.459716    .0741837
    8067344  |  -.8166836   .2767524    -2.95   0.003    -1.359108    -.274259
    8725765  |  -.5818655   .3176413    -1.83   0.067    -1.204431       .0407
    8788516  |  -.5806509   .2811694    -2.07   0.039    -1.131733   -.0295689
    8931088  |  -.4086733   .3567686    -1.15   0.252    -1.107927    .2905804
             |
       _cons |  -5.776611   6.611827    -0.87   0.382    -18.73555    7.182332
------------------------------------------------------------------------------
Endogenous: fpm
Exogenous:  pop pop_2 pop_3 505526.state 587449.state 597365.state
            769751.state 892308.state 957849.state 1107433.state
            1250697.state 1381093.state 2055503.state 2231416.state
            2841968.state 3299494.state 3348128.state 4383332.state
            5237566.state 5652332.state 5893022.state 5964892.state
            6136824.state 7914963.state 8067344.state 8725765.state
            8788516.state 8931088.state treatnorm

. outreg2 treatnorm using pop_3.doc, bdec(3) nocons tex(nopretty) replace
pop_3.tex
pop_3.doc
dir : seeout

. 
. /*
> ==============================================================================
> ==============================================================================
> =*/
. 
. 
. ******ASSUMPTION CHECKS******
. 
. /***RD assumption1: Existence of a first stage
> Implies that the instrument needs to be related to the endogenous variable i.e
> . requires a significant relationship between the instrument and the endogenou
> s variable. Here the variable that is instrumented in the outcome***/
. *Running the first stage  
. ivregress 2sls narrow (fpm = treatnorm) pop i.state, cluster(cityr) first, if 
> inrange(popnorm, -1000, 1000) & pop < 17981

First-stage regressions
-----------------------

                                                      Number of obs   =    372
                                                      No. of clusters =    314
                                                      F(27, 344)      = 494.12
                                                      Prob > F        = 0.0000
                                                      R-squared       = 0.7761
                                                      Adj R-squared   = 0.7585
                                                      Root MSE        = 3.2205

------------------------------------------------------------------------------
             |               Robust
         fpm | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         pop |   .0016788   .0000724    23.20   0.000     .0015365    .0018211
             |
       state |
     505526  |   3.266602   .8432849     3.87   0.000     1.607959    4.925246
     587449  |   7.691619   .8823345     8.72   0.000      5.95617    9.427069
     597365  |   6.030757   .6155958     9.80   0.000     4.819952    7.241563
     769751  |   .7202034    1.70625     0.42   0.673    -2.635793      4.0762
     892308  |    2.46882   .6814563     3.62   0.000     1.128475    3.809166
     957849  |   5.381013   1.746883     3.08   0.002     1.945097     8.81693
    1107433  |   6.431676   .7328177     8.78   0.000     4.990308    7.873043
    1250697  |   6.199587   .7123204     8.70   0.000     4.798535    7.600639
    1381093  |   3.167865   .7717665     4.10   0.000      1.64989     4.68584
    2055503  |    1.69834    .805307     2.11   0.036     .1143943    3.282285
    2231416  |   6.800988   .7971847     8.53   0.000     5.233018    8.368958
    2841968  |   5.796838   2.246294     2.58   0.010     1.378639    10.21504
    3299494  |   10.57259   .9269748    11.41   0.000     8.749338    12.39584
    3348128  |    -4.2378   .5906825    -7.17   0.000    -5.399604   -3.075996
    4383332  |   -9.68552   .5392827   -17.96   0.000    -10.74623   -8.624813
    5237566  |   8.836941   1.077511     8.20   0.000     6.717603    10.95628
    5652332  |   9.954326    1.19592     8.32   0.000     7.602091    12.30656
    5893022  |   4.782838   .9056067     5.28   0.000     3.001614    6.564061
    5964892  |   3.466354   .8781197     3.95   0.000     1.739194    5.193513
    6136824  |   4.740771   3.198455     1.48   0.139    -1.550219    11.03176
    7914963  |   9.375107   .6853051    13.68   0.000     8.027192    10.72302
    8067344  |   5.242873   .7164192     7.32   0.000      3.83376    6.651987
    8725765  |   6.857879    .601197    11.41   0.000     5.675394    8.040364
    8788516  |   2.005658   .7694203     2.61   0.010     .4922975    3.519019
    8931088  |   8.362782   .6300737    13.27   0.000       7.1235    9.602064
             |
   treatnorm |   1.712932    .340747     5.03   0.000     1.042722    2.383142
       _cons |  -1.621935   1.060451    -1.53   0.127     -3.70772    .4638498
------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =        372
                                                  Wald chi2(27)   =     430.21
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.0704
                                                  Root MSE        =     .48152

                                (Std. err. adjusted for 314 clusters in cityr)
------------------------------------------------------------------------------
             |               Robust
      narrow | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         fpm |   .0607244   .0291201     2.09   0.037       .00365    .1177987
         pop |  -.0000931   .0000501    -1.86   0.063    -.0001913    5.00e-06
             |
       state |
     505526  |   -.317932   .2611332    -1.22   0.223    -.8297436    .1938797
     587449  |  -.5530554    .337025    -1.64   0.101    -1.213612    .1075014
     597365  |  -.4070429   .2942298    -1.38   0.167    -.9837228    .1696369
     769751  |  -.3665704   .2875512    -1.27   0.202    -.9301604    .1970197
     892308  |   -.648477   .2383991    -2.72   0.007    -1.115731   -.1812233
     957849  |  -.4330704   .3447906    -1.26   0.209    -1.108848    .2427067
    1107433  |  -.5405053   .3002237    -1.80   0.072    -1.128933    .0479223
    1250697  |  -.6917048   .3248606    -2.13   0.033     -1.32842   -.0549898
    1381093  |  -.6653135   .2450276    -2.72   0.007    -1.145559   -.1850683
    2055503  |  -.6052187    .308681    -1.96   0.050    -1.210222   -.0002151
    2231416  |  -.7714142   .3073555    -2.51   0.012     -1.37382   -.1690085
    2841968  |  -.4673111   .3553497    -1.32   0.188    -1.163784    .2291616
    3299494  |  -.8873788   .4012967    -2.21   0.027    -1.673906   -.1008517
    3348128  |  -.2337859   .2950553    -0.79   0.428    -.8120836    .3445118
    4383332  |  -.1548218   .3260921    -0.47   0.635    -.7939506     .484307
    5237566  |  -.7151821   .3485466    -2.05   0.040    -1.398321   -.0320434
    5652332  |  -.6482978    .380318    -1.70   0.088    -1.393707    .0971118
    5893022  |   -.327172   .3166524    -1.03   0.302    -.9477993    .2934553
    5964892  |   -.233686   .2744149    -0.85   0.394    -.7715292    .3041572
    6136824  |  -.5875942   .3081875    -1.91   0.057    -1.191631    .0164422
    7914963  |  -.8226439   .3587953    -2.29   0.022     -1.52587   -.1194181
    8067344  |  -.8866965   .2624085    -3.38   0.001    -1.401008   -.3723852
    8725765  |  -.6759891   .2944162    -2.30   0.022    -1.253034    -.098944
    8788516  |  -.5764307   .2838334    -2.03   0.042    -1.132734   -.0201275
    8931088  |  -.5197531   .3293954    -1.58   0.115    -1.165356    .1258501
             |
       _cons |   .6176641   .2505354     2.47   0.014     .1266238    1.108704
------------------------------------------------------------------------------
Endogenous: fpm
Exogenous:  pop 505526.state 587449.state 597365.state 769751.state
            892308.state 957849.state 1107433.state 1250697.state
            1381093.state 2055503.state 2231416.state 2841968.state
            3299494.state 3348128.state 4383332.state 5237566.state
            5652332.state 5893022.state 5964892.state 6136824.state
            7914963.state 8067344.state 8725765.state 8788516.state
            8931088.state treatnorm

. 
. /***RD assumption2: Fixed Covariates
> The entire premise of a regression discontinuity design is that we assume the 
> sample very close before and after the cutoff is essentially the same and does
>  not systematically differ in anything except for the absence of a treatment. 
> Based on this, testing for any other variable should not lead us to any signif
> icant results, otherwise we can assume that there are systematic differences b
> etween our sample and our RD assumption doesn't hold i.e. our RD is not valid*
> **/
. *Testing for income
. ivregress 2sls income (fpm = treatnorm) pop i.state, cluster(cityr), if inrang
> e(popnorm, -1000, 1000) & pop < 17981

Instrumental variables 2SLS regression            Number of obs   =        372
                                                  Wald chi2(27)   =    2042.54
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.7000
                                                  Root MSE        =     45.481

                                (Std. err. adjusted for 314 clusters in cityr)
------------------------------------------------------------------------------
             |               Robust
      income | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         fpm |  -1.866209   2.698058    -0.69   0.489    -7.154306    3.421887
         pop |   .0055011   .0048367     1.14   0.255    -.0039786    .0149808
             |
       state |
     505526  |   88.00701   29.71001     2.96   0.003     29.77646    146.2376
     587449  |   -33.5932   26.43899    -1.27   0.204    -85.41266    18.22627
     597365  |  -68.46506   22.08826    -3.10   0.002    -111.7573   -25.17286
     769751  |  -34.18283   23.72234    -1.44   0.150    -80.67777    12.31211
     892308  |   85.36541   19.52467     4.37   0.000     47.09777    123.6331
     957849  |  -75.44206   21.98597    -3.43   0.001    -118.5338   -32.35035
    1107433  |  -50.86309   22.41961    -2.27   0.023    -94.80472   -6.921468
    1250697  |   79.31016   26.71962     2.97   0.003     26.94066    131.6796
    1381093  |  -50.40467   18.49903    -2.72   0.006     -86.6621   -14.14724
    2055503  |  -24.81183   16.01181    -1.55   0.121    -56.19439    6.570728
    2231416  |   122.6049    23.3905     5.24   0.000     76.76036    168.4494
    2841968  |  -59.17363   29.06594    -2.04   0.042    -116.1418   -2.205446
    3299494  |   81.94765   35.63353     2.30   0.021     12.10722    151.7881
    3348128  |  -7.290564   29.04548    -0.25   0.802    -64.21866    49.63753
    4383332  |  -23.62392   26.50768    -0.89   0.373    -75.57802    28.33018
    5237566  |   63.13747   29.35439     2.15   0.031      5.60393     120.671
    5652332  |  -42.29235   31.57818    -1.34   0.180    -104.1845    19.59975
    5893022  |   110.7201   66.33442     1.67   0.095    -19.29299    240.7331
    5964892  |   118.5484    25.1336     4.72   0.000     69.28741    167.8093
    6136824  |  -39.90338   23.39602    -1.71   0.088    -85.75873     5.95197
    7914963  |  -57.26713   28.94515    -1.98   0.048    -113.9986    -.535676
    8067344  |   110.5158   24.55339     4.50   0.000     62.39205    158.6396
    8725765  |   31.35747   26.11203     1.20   0.230    -19.82117    82.53612
    8788516  |  -57.27612    20.0488    -2.86   0.004    -96.57105   -17.98119
    8931088  |  -47.59929   26.67134    -1.78   0.074    -99.87416    4.675587
             |
       _cons |   100.9396   18.01746     5.60   0.000       65.626    136.2531
------------------------------------------------------------------------------
Endogenous: fpm
Exogenous:  pop 505526.state 587449.state 597365.state 769751.state
            892308.state 957849.state 1107433.state 1250697.state
            1381093.state 2055503.state 2231416.state 2841968.state
            3299494.state 3348128.state 4383332.state 5237566.state
            5652332.state 5893022.state 5964892.state 6136824.state
            7914963.state 8067344.state 8725765.state 8788516.state
            8931088.state treatnorm

. outreg2 treatnorm using income_balance.doc, bdec(3) nocons tex(nopretty) repla
> ce
income_balance.tex
income_balance.doc
dir : seeout

. *Testing for urban ratio 
. ivregress 2sls urb (fpm = treatnorm) pop i.state, cluster(cityr), if inrange(p
> opnorm, -1000, 1000) & pop < 17981

Instrumental variables 2SLS regression            Number of obs   =        372
                                                  Wald chi2(27)   =     234.39
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.3434
                                                  Root MSE        =     .17577

                                (Std. err. adjusted for 314 clusters in cityr)
------------------------------------------------------------------------------
             |               Robust
         urb | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         fpm |   .0111767   .0108977     1.03   0.305    -.0101824    .0325357
         pop |  -8.29e-06   .0000183    -0.45   0.651    -.0000443    .0000277
             |
       state |
     505526  |   .1799352   .1441914     1.25   0.212    -.1026747    .4625451
     587449  |   .1260219   .1577028     0.80   0.424      -.18307    .4351137
     597365  |  -.0710563   .1496197    -0.47   0.635    -.3643056     .222193
     769751  |   .1320494   .1428674     0.92   0.355    -.1479655    .4120643
     892308  |   .2515152   .1465978     1.72   0.086    -.0358111    .5388415
     957849  |  -.1188883   .1566648    -0.76   0.448    -.4259458    .1881692
    1107433  |   .0999684   .1562389     0.64   0.522    -.2062543    .4061911
    1250697  |  -.0148046   .1566627    -0.09   0.925    -.3218579    .2922487
    1381093  |   .1139374   .1444299     0.79   0.430    -.1691401    .3970149
    2055503  |   .0641841   .1252871     0.51   0.608     -.181374    .3097423
    2231416  |   .3398204   .1536411     2.21   0.027     .0386894    .6409513
    2841968  |   .0222066    .187495     0.12   0.906    -.3452769    .3896901
    3299494  |   .1565468   .1819436     0.86   0.390     -.200056    .5131497
    3348128  |   .3037989   .1251033     2.43   0.015     .0586009    .5489969
    4383332  |   .2721228   .1391248     1.96   0.050    -.0005569    .5448025
    5237566  |   .0939713   .1711021     0.55   0.583    -.2413827    .4293253
    5652332  |  -.0424936    .177648    -0.24   0.811    -.3906774    .3056901
    5893022  |   .2258228   .1550757     1.46   0.145      -.07812    .5297656
    5964892  |   .1568922   .1369513     1.15   0.252    -.1115275    .4253118
    6136824  |   .1224409   .1496053     0.82   0.413    -.1707801     .415662
    7914963  |  -.0272463   .1685644    -0.16   0.872    -.3576265    .3031339
    8067344  |   .1876494   .1436217     1.31   0.191     -.093844    .4691427
    8725765  |   .1851948   .1510519     1.23   0.220    -.1108614    .4812511
    8788516  |  -.0942225   .1319116    -0.71   0.475    -.3527645    .1643196
    8931088  |   -.120677   .1637774    -0.74   0.461    -.4416749    .2003209
             |
       _cons |   .2691547   .1254068     2.15   0.032      .023362    .5149474
------------------------------------------------------------------------------
Endogenous: fpm
Exogenous:  pop 505526.state 587449.state 597365.state 769751.state
            892308.state 957849.state 1107433.state 1250697.state
            1381093.state 2055503.state 2231416.state 2841968.state
            3299494.state 3348128.state 4383332.state 5237566.state
            5652332.state 5893022.state 5964892.state 6136824.state
            7914963.state 8067344.state 8725765.state 8788516.state
            8931088.state treatnorm

. outreg2 treatnorm using urb_balance.doc, bdec(3) nocons tex(nopretty) replace
urb_balance.tex
urb_balance.doc
dir : seeout

. *Testing for literacy rates 
. ivregress 2sls literacy (fpm = treatnorm) pop i.state, cluster(cityr), if inra
> nge(popnorm, -1000, 1000) & pop < 17981

Instrumental variables 2SLS regression            Number of obs   =        372
                                                  Wald chi2(27)   =    2459.81
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.7719
                                                  Root MSE        =     .06027

                                (Std. err. adjusted for 314 clusters in cityr)
------------------------------------------------------------------------------
             |               Robust
    literacy | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         fpm |   .0000465   .0034774     0.01   0.989     -.006769    .0068621
         pop |   2.18e-06   5.98e-06     0.37   0.715    -9.53e-06    .0000139
             |
       state |
     505526  |   .0471283   .0170317     2.77   0.006     .0137467    .0805099
     587449  |   -.134144   .0319939    -4.19   0.000    -.1968509   -.0714372
     597365  |  -.1782325    .027401    -6.50   0.000    -.2319374   -.1245276
     769751  |  -.0669812   .0234861    -2.85   0.004    -.1130132   -.0209491
     892308  |   .0863571   .0191302     4.51   0.000     .0488626    .1238516
     957849  |   -.173843   .0441903    -3.93   0.000    -.2604544   -.0872317
    1107433  |  -.1706621   .0262973    -6.49   0.000    -.2222039   -.1191203
    1250697  |   .0481112   .0291194     1.65   0.098    -.0089619    .1051842
    1381093  |   -.154926    .023386    -6.62   0.000    -.2007617   -.1090903
    2055503  |  -.1051077   .0169035    -6.22   0.000    -.1382379   -.0719776
    2231416  |   .1094095   .0253296     4.32   0.000     .0597643    .1590546
    2841968  |   -.179503   .0447653    -4.01   0.000    -.2672413   -.0917648
    3299494  |   .0139676   .0421429     0.33   0.740     -.068631    .0965661
    3348128  |  -.0603924   .0241158    -2.50   0.012    -.1076586   -.0131262
    4383332  |  -.0590512    .029859    -1.98   0.048    -.1175738   -.0005286
    5237566  |   .0624249   .0347013     1.80   0.072    -.0055884    .1304382
    5652332  |  -.1720534   .0391593    -4.39   0.000    -.2488042   -.0953025
    5893022  |    .005449   .0269175     0.20   0.840    -.0473083    .0582062
    5964892  |   .1305523   .0179072     7.29   0.000     .0954549    .1656496
    6136824  |  -.1050437   .0238693    -4.40   0.000    -.1518266   -.0582609
    7914963  |  -.1814292   .0364273    -4.98   0.000    -.2528255   -.1100329
    8067344  |   .1273023   .0216957     5.87   0.000     .0847795    .1698251
    8725765  |   .0102492   .0303674     0.34   0.736    -.0492698    .0697681
    8788516  |   -.118283   .0292593    -4.04   0.000    -.1756302   -.0609359
    8931088  |  -.1319278   .0301428    -4.38   0.000    -.1910067   -.0728489
             |
       _cons |   .5296608   .0163505    32.39   0.000     .4976143    .5617073
------------------------------------------------------------------------------
Endogenous: fpm
Exogenous:  pop 505526.state 587449.state 597365.state 769751.state
            892308.state 957849.state 1107433.state 1250697.state
            1381093.state 2055503.state 2231416.state 2841968.state
            3299494.state 3348128.state 4383332.state 5237566.state
            5652332.state 5893022.state 5964892.state 6136824.state
            7914963.state 8067344.state 8725765.state 8788516.state
            8931088.state treatnorm

. outreg2 treatnorm using literacy_balance.doc, bdec(3) nocons tex(nopretty) rep
> lace
literacy_balance.tex
literacy_balance.doc
dir : seeout

. 
. /***RD assumption3: No Manipulation of the running variable
> The intuition behind this assumption that the running variable is not systemat
> ically manipulated around the cutoff point by subjects trying to qualify for t
> he treatment***/
. hist pop, freq bin(150) xline(10189 13584 16980 23772 30564 37356 44148)
(bin=150, start=6846, width=289.04)

. 
. /*
> ==============================================================================
> ==============================================================================
> =*/
. 
. ******DEFINING MY DIFFERENCES IN DIFFERENCES SPECIFICATION******
. 
. ***Using fpm trasnfers as the continous treatment***
. xtset, clear

. xtset cityr term

Panel variable: cityr (unbalanced)
 Time variable: term, 2001 to 2005, but with gaps
         Delta: 1 unit

. 
. ***DiD specification for corruption***
. reg narrow fpm i.cityr i.term, cluster(cityr)

Linear regression                               Number of obs     =      1,157
                                                F(1, 853)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.7877
                                                Root MSE          =     .45028

                                (Std. err. adjusted for 854 clusters in cityr)
------------------------------------------------------------------------------
             |               Robust
      narrow | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         fpm |   .0058694   .0159688     0.37   0.713    -.0254733     .037212
             |
       cityr |
       6592  |   .6754337    .153234     4.41   0.000     .3746739    .9761935
      12775  |  -.0231679   .0630326    -0.37   0.713     -.146885    .1005492
      12821  |   1.027156   .0738834    13.90   0.000     .8821415    1.172171
      13056  |  -.0276542   .0752385    -0.37   0.713    -.1753286    .1200202
      13552  |  -.1315026   .0391371    -3.36   0.001    -.2083189   -.0546863
      15152  |   .3603146   .0362809     9.93   0.000     .2891042     .431525
      19861  |   .4319484   .1919544     2.25   0.025     .0551901    .8087067
      20959  |   .0515026   .1401226     0.37   0.713    -.2235229    .3265281
      21741  |     .06094   .1657987     0.37   0.713    -.2644812    .3863611
      33386  |   .7260261   .0714925    10.16   0.000     .5857043    .8663479
      37827  |   .0109079   .0296769     0.37   0.713    -.0473405    .0691562
      44032  |   .9300011   .1904453     4.88   0.000     .5562048    1.303797
      44539  |  -.1705177   .4639257    -0.37   0.713    -1.081087    .7400519
      49422  |   .9981232   .0051061   195.48   0.000     .9881012    1.008145
      50674  |   .4304517    .187955     2.29   0.022     .0615432    .7993602
      57757  |   .2376038   .3420232     0.69   0.487    -.4337018    .9089094
      58365  |   .3515245   .0467895     7.51   0.000     .2596884    .4433607
      58634  |   .3498764   .0498024     7.03   0.000     .2521267    .4476261
      61129  |   .0454047   .1235322     0.37   0.713    -.1970579    .2878674
      73704  |   .4232081   .1686486     2.51   0.012     .0921933     .754223
      75344  |   .0141863   .0385965     0.37   0.713    -.0615689    .0899415
      75623  |     .05057   .1375854     0.37   0.713    -.2194755    .3206156
      78102  |   .4117794   .1384172     2.97   0.003     .1401011    .6834576
      81099  |  -.0060886   .0165653    -0.37   0.713    -.0386022    .0264249
      87651  |   .0690799   .1879448     0.37   0.713    -.2998087    .4379684
      88022  |   .3089383   .1503793     2.05   0.040     .0137815     .604095
      88472  |   .6381535   .2475184     2.58   0.010     .1523371     1.12397
      95775  |    1.00304   .0082702   121.28   0.000     .9868074    1.019272
      96659  |  -.0295694   .0804492    -0.37   0.713     -.187471    .1283321
     102952  |   .9300011   .1904453     4.88   0.000     .5562048    1.303797
     107506  |   .3128166   .1401521     2.23   0.026     .0377332       .5879
     108977  |   1.080271   .2183912     4.95   0.000     .6516235    1.508918
     109064  |   .9496678   .1369383     6.94   0.000     .6808922    1.218443
     117839  |   .3603146   .0362809     9.93   0.000     .2891042     .431525
     129325  |   .9534624   .1266142     7.53   0.000     .7049505    1.201974
     130557  |  -.0971484   .2643105    -0.37   0.713    -.6159235    .4216268
     133366  |   .4377024   .2073562     2.11   0.035     .0307142    .8446906
     147659  |   .3389564   .0736506     4.60   0.000     .1943986    .4835141
     152924  |  -.0331404   .0901647    -0.37   0.713    -.2101111    .1438303
     155075  |  -.0349043   .2810634    -0.12   0.901    -.5865613    .5167526
     156473  |   .3179623   .1266653     2.51   0.012     .0693501    .5665745
     164878  |   .0360175   .0979925     0.37   0.713    -.1563171    .2283521
     164885  |   .4124408   .1401566     2.94   0.003     .1373485    .6875332
     170683  |   .4509734   .2430021     1.86   0.064    -.0259787    .9279256
     171814  |  -.0060886   .0165653    -0.37   0.713    -.0386022    .0264249
     177062  |   .8064787   .5265112     1.53   0.126    -.2269306    1.839888
     191693  |   .3650318   .0363246    10.05   0.000     .2937359    .4363278
     196732  |   .0142647   .0388098     0.37   0.713    -.0619091    .0904385
     199222  |   .9737707   .0713618    13.65   0.000     .8337054    1.113836
     209431  |  -.0508169   .2381851    -0.21   0.831    -.5183145    .4166807
     213299  |    .076587   .2083694     0.37   0.713    -.3323898    .4855637
     228359  |   .9949158   .0138325    71.93   0.000      .967766    1.022066
     229742  |  -.0296039   .0805429    -0.37   0.713    -.1876894    .1284817
     229956  |   .0278783   .0758482     0.37   0.713    -.1209927    .1767493
     232006  |   .9187836   .2209646     4.16   0.000     .4850855    1.352482
     244379  |   .8483229   .4126663     2.06   0.040     .0383625    1.658283
     254252  |   .0070928   .0192974     0.37   0.713    -.0307832    .0449688
     256603  |   .0529527   .1440678     0.37   0.713    -.2298162    .3357216
     260258  |  -.0360696   .0981342    -0.37   0.713    -.2286824    .1565432
     264155  |  -.0198136   .0539066    -0.37   0.713    -.1256186    .0859915
     278747  |  -.0846653   .2303479    -0.37   0.713    -.5367803    .3674498
     283027  |   1.029285   .0796765    12.92   0.000     .8729005     1.18567
     284708  |   .7769272   .1577024     4.93   0.000     .4673969    1.086457
     288527  |  -.1786402    .117826    -1.52   0.130    -.4099031    .0526226
     297999  |   .0247243   .0672672     0.37   0.713    -.1073044     .156753
     305204  |  -.0605428   .2120607    -0.29   0.775    -.4767647    .3556792
     312801  |  -.0883892   .2404796    -0.37   0.713    -.5603902    .3836118
     327404  |   .3195047   .1226449     2.61   0.009     .0787835    .5602259
     343793  |   .8947693   .0944649     9.47   0.000     .7093583     1.08018
     348159  |   .0156262   .0425141     0.37   0.713    -.0678182    .0990706
     353884  |   .0059611   .0162182     0.37   0.713    -.0258713    .0377934
     363522  |   .3674555   .0380685     9.65   0.000     .2927366    .4421743
     363604  |  -.1557077   .0613617    -2.54   0.011    -.2761452   -.0352702
     370683  |  -.0399724   .1087526    -0.37   0.713    -.2534264    .1734816
     378973  |  -.2893054   .0817082    -3.54   0.000    -.4496782   -.1289326
     382582  |   1.013918   .0378674    26.78   0.000      .939594    1.088243
     383076  |  -.1829333   .1290048    -1.42   0.157    -.4361374    .0702707
     387105  |      .3918   .0870403     4.50   0.000     .2209617    .5626383
     392577  |  -.2424551   .1132439    -2.14   0.033    -.4647245   -.0201858
     395289  |  -.1808498    .123568    -1.46   0.144    -.4233828    .0616832
     415021  |   .4241515   .1711578     2.48   0.013     .0882117    .7600912
     415177  |    1.07883   .2144724     5.03   0.000     .6578747    1.499786
     423866  |    .006725   .0182966     0.37   0.713    -.0291867    .0426367
     425348  |   1.075377   .2050763     5.24   0.000     .6728632     1.47789
     439007  |   .0891274   .2424879     0.37   0.713    -.3868154    .5650702
     440577  |   .8810896    .061641    14.29   0.000     .7601038    1.002075
     450281  |  -.1148042     .07104    -1.62   0.106    -.2542379    .0246294
     457092  |   .0209838   .0570904     0.37   0.713    -.0910704     .133038
     458642  |   .9342964   .1982346     4.71   0.000     .5452117    1.323381
     470015  |    .029251    .079583     0.37   0.713    -.1269503    .1854524
     481125  |   .4248175   .1729304     2.46   0.014     .0853986    .7642365
     488532  |   .0418399   .1138334     0.37   0.713    -.1815865    .2652664
     495187  |   .8768104   .0525889    16.67   0.000     .7735916    .9800292
     502051  |  -.1118973   .0779771    -1.44   0.152    -.2649469    .0411522
     507608  |   .2823456   .2213263     1.28   0.202    -.1520623    .7167536
     519462  |   .9375987   .1697746     5.52   0.000     .6043739    1.270824
     536295  |  -.0075185   .0204555    -0.37   0.713    -.0476676    .0326306
     538912  |  -.1124569   .0766271    -1.47   0.143    -.2628566    .0379427
     539921  |   1.056399   .1534433     6.88   0.000     .7552281    1.357569
     543451  |   .0756294    .205764     0.37   0.713    -.3282338    .4794926
     546274  |   .8748341   .3405375     2.57   0.010     .2064444    1.543224
     556475  |   .9083539   .1294359     7.02   0.000     .6543038    1.162404
     562174  |   .4321705   .1925483     2.24   0.025     .0542466    .8100945
     563191  |   .9753983   .0669337    14.57   0.000     .8440242    1.106772
     575238  |   1.022647   .0616161    16.60   0.000     .9017103    1.143584
     576968  |  -.0624013   .1697746    -0.37   0.713    -.3956261    .2708235
     590259  |   -.030075   .0818246    -0.37   0.713    -.1906761    .1305262
     591172  |   .8195047   .1226449     6.68   0.000     .5787835    1.060226
     596965  |   .4282933   .1821933     2.35   0.019     .0706936     .785893
     608686  |   1.022485   .0611734    16.71   0.000     .9024165    1.142553
     609803  |  -.1898165   .2418605    -0.78   0.433    -.6645279    .2848949
     619155  |   .9883845   .0316022    31.28   0.000     .9263572    1.050412
     623212  |   .9261043   .2010471     4.61   0.000     .5314993    1.320709
     665845  |   .8208229   .2696501     3.04   0.002     .2915674    1.350078
     670319  |   .8165535    .499101     1.64   0.102    -.1630565    1.796163
     671747  |   -.270098   .0725712    -3.72   0.000     -.412537    -.127659
     673036  |   .0516871   .1406245     0.37   0.713    -.2243234    .3276976
     677981  |   .9826744   .0471376    20.85   0.000      .890155    1.075194
     678929  |   .0267762   .0728498     0.37   0.713    -.1162096     .169762
     684334  |   .5431401    .500607     1.08   0.278    -.4394258    1.525706
     685284  |   .8927248   .0893406     9.99   0.000     .7173716    1.068078
     703415  |   -.083495   .2271639    -0.37   0.713    -.5293606    .3623707
     717892  |  -.0437815   .1191158    -0.37   0.713    -.2775759    .1900129
     725017  |   -.100376    .273092    -0.37   0.713     -.636387    .4356349
     725151  |   .2357794     .34696     0.68   0.497    -.4452159    .9167747
     731479  |   .3324133    .089634     3.71   0.000     .1564842    .5083424
     736154  |   1.073331   .1995104     5.38   0.000     .6817419     1.46492
     739801  |   .0693254   .1886129     0.37   0.713    -.3008744    .4395253
     747542  |    .390626    .084138     4.64   0.000     .2254842    .5557678
     748655  |   .0685853   .1865992     0.37   0.713    -.2976622    .4348328
     754021  |   .8032874   .2240046     3.59   0.000     .3636227    1.242952
     757066  |  -.0571672   .1555342    -0.37   0.713    -.3624419    .2481074
     762126  |   .2912341   .1974992     1.47   0.141    -.0964073    .6788755
     763699  |  -.1405111   .0367373    -3.82   0.000    -.2126172    -.068405
     772987  |   .3447385   .0603788     5.71   0.000     .2262302    .4632469
     780635  |   .6221103   .2895826     2.15   0.032     .0537324    1.190488
     785219  |   .9951005   .0133301    74.65   0.000     .9689368    1.021264
     792161  |    .076587   .2083694     0.37   0.713    -.3323898    .4855637
     793088  |  -.0276542   .0752385    -0.37   0.713    -.1753286    .1200202
     806057  |  -.0254722   .0693019    -0.37   0.713    -.1614943      .11055
     811473  |   .9772334   .0619409    15.78   0.000      .855659    1.098808
     817727  |  -.3015338   .4480598    -0.67   0.501    -1.180963     .577895
     847551  |   .8979298   .1024767     8.76   0.000     .6967938    1.099066
     850272  |   .2394881   .3369251     0.71   0.477    -.4218113    .9007875
     850863  |  -.1696851   .0948971    -1.79   0.074    -.3559443    .0165741
     854243  |  -.1066086   .2900489    -0.37   0.713    -.6759018    .4626846
     859017  |   .0929119   .2527843     0.37   0.713    -.4032402    .5890639
     863916  |   1.005414   .0147294    68.26   0.000     .9765037    1.034324
     866571  |   .3656505    .036665     9.97   0.000     .2936863    .4376147
     869899  |   .8597474   .0365802    23.50   0.000     .7879497    .9315452
     881398  |   .4217155   .1646821     2.56   0.011     .0984858    .7449452
     886621  |   .8379484   .0760603    11.02   0.000     .6886611    .9872357
     890562  |  -.1133034   .3082633    -0.37   0.713    -.7183468      .49174
     907345  |   1.116171   .3160655     3.53   0.000     .4958139    1.736528
     909157  |   .6914092   .4672012     1.48   0.139    -.2255895    1.608408
     913997  |   .4055257   .1220587     3.32   0.001     .1659552    .6450962
     918702  |    .076587   .2083694     0.37   0.713    -.3323898    .4855637
     925841  |  -.0812515   .1568119    -0.52   0.604    -.3890338    .2265309
     932078  |   .4015236   .1116926     3.59   0.000      .182299    .6207481
     934336  |    -.06204   .1687915    -0.37   0.713    -.3933353    .2692553
     947974  |   .2806511   .2258773     1.24   0.214    -.1626894    .7239916
     949469  |  -.1251659   .3405375    -0.37   0.713    -.7935556    .5432238
     956532  |   .9159772   .2285998     4.01   0.000     .4672931    1.364661
     961701  |   .9758472   .0657123    14.85   0.000     .8468705    1.104824
     980049  |   .0608213   .1654757     0.37   0.713    -.2639661    .3856086
     980341  |   .7559422   .1098959     6.88   0.000     .5402442    .9716403
     988713  |   .3293179   .0974154     3.38   0.001      .138116    .5205199
    1008754  |   .4311146    .189726     2.27   0.023     .0587301     .803499
    1030024  |   .9939114   .0165653    60.00   0.000     .9613978    1.026425
    1039319  |  -.0650603   .1999563    -0.33   0.745    -.4575244    .3274038
    1039659  |   .0887666   .2415063     0.37   0.713    -.3852497    .5627829
    1055878  |   .0393662   .1071031     0.37   0.713    -.1708503    .2495826
    1059019  |   1.087964   .2393236     4.55   0.000     .6182322    1.557696
    1087329  |   .0788302   .2144724     0.37   0.713    -.3421253    .4997856
    1130445  |   1.030988   .0843098    12.23   0.000     .8655094    1.196467
    1162916  |  -.1793251   .1196029    -1.50   0.134    -.4140756    .0554254
    1167111  |   .4169179   .1519666     2.74   0.006     .1186457    .7151901
    1176185  |   1.048522    .132014     7.94   0.000     .7894119    1.307633
    1181891  |   .8603146   .0362809    23.71   0.000     .7891042     .931525
    1194826  |  -.0476106   .2468134    -0.19   0.847    -.5320432    .4368221
    1199583  |    1.06072   .1652014     6.42   0.000     .7364715    1.384969
    1201709  |   .0228022   .0620378     0.37   0.713    -.0989623    .1445668
    1201851  |   .6296425    .269771     2.33   0.020     .1001499    1.159135
    1223136  |  -.2445337   .1089154    -2.25   0.025    -.4583073   -.0307601
    1248461  |   1.081585   .2219674     4.87   0.000     .6459187    1.517251
    1248986  |   .8195047   .1226449     6.68   0.000     .5787835    1.060226
    1254046  |    .293188   .1922735     1.52   0.128    -.0841967    .6705726
    1257101  |    .039922   .1086155     0.37   0.713    -.1732629     .253107
    1271075  |  -.1868622   .2495504    -0.75   0.454    -.6766671    .3029426
    1291848  |  -.0951707     .25893    -0.37   0.713    -.6033853    .4130438
    1295732  |  -.2317747   .2593134    -0.89   0.372    -.7407419    .2771925
    1318102  |   .0593303   .1614192     0.37   0.713    -.2574951    .3761556
    1319847  |    .348338   .0528035     6.60   0.000     .2446981     .451978
    1322312  |   1.036822   .1001803    10.35   0.000     .8401929     1.23345
    1324196  |   1.040563   .1103596     9.43   0.000     .8239549    1.257171
    1324807  |   1.040563   .1103596     9.43   0.000     .8239549    1.257171
    1338688  |   .0278783   .0758482     0.37   0.713    -.1209927    .1767493
    1361637  |   .0756709   .2058769     0.37   0.713    -.3284138    .4797556
    1383985  |  -.1052566   .2863704    -0.37   0.713    -.6673298    .4568167
    1405824  |   .0279935   .0761615     0.37   0.713    -.1214925    .1774795
    1406858  |  -.0319616   .0869576    -0.37   0.713    -.2026375    .1387143
    1423484  |  -.2400698   .2816838    -0.85   0.394    -.7929443    .3128047
    1448419  |   .0279935   .0761615     0.37   0.713    -.1214925    .1774795
    1456817  |   .4212172    .163359     2.58   0.010     .1005846    .7418499
    1495675  |  -.0632722   .2047447    -0.31   0.757    -.4651347    .3385903
    1497624  |   1.050096    .136297     7.70   0.000     .7825797    1.317613
    1505078  |   .9726237   .0744825    13.06   0.000     .8264333    1.118814
    1515799  |   .0440583   .1198688     0.37   0.713    -.1912142    .2793307
    1531455  |   .4261541   .1764899     2.41   0.016     .0797488    .7725594
    1544863  |   1.058802    .159983     6.62   0.000     .7447959    1.372809
    1546908  |   .0566482   .1541221     0.37   0.713    -.2458549    .3591512
    1557382  |   .9491831   .2381851     3.99   0.000     .4816855    1.416681
    1558752  |   .8818644   .0633706    13.92   0.000     .7574839    1.006245
    1565512  |   .2964378   .1835931     1.61   0.107    -.0639093    .6567849
    1608972  |   .3893852   .0810945     4.80   0.000     .2302171    .5485534
    1664083  |  -.1944164   .2299341    -0.85   0.398    -.6457192    .2568865
    1711041  |  -.1859542   .1369211    -1.36   0.175    -.4546959    .0827875
    1720289  |   .0310884   .0845819     0.37   0.713    -.1349246    .1971015
    1749253  |   -.198782    .170855    -1.16   0.245    -.5341274    .1365635
    1751753  |   .0684484   .1862267     0.37   0.713    -.2970679    .4339646
    1755893  |   1.052953   .1440678     7.31   0.000     .7701838    1.335722
    1790032  |   .0418399   .1138334     0.37   0.713    -.1815865    .2652664
    1814259  |  -.3112392   .1223337    -2.54   0.011    -.5513496   -.0711288
    1843081  |   .7520826   .3028743     2.48   0.013     .1576163    1.346549
    1885791  |   .9323804    .183972     5.07   0.000     .5712895    1.293471
    1886818  |  -.0926636   .2521089    -0.37   0.713    -.5874901    .4021629
    1894847  |  -.2009699   .2130589    -0.94   0.346    -.6191511    .2172113
    1906642  |   .0054139   .0147294     0.37   0.713    -.0234963     .034324
    1937499  |   .3843013   .0689477     5.57   0.000     .2489744    .5196283
    1967571  |   .9560685    .119524     8.00   0.000     .7214729    1.190664
    1975711  |   .9201872   .1606257     5.73   0.000     .6049194    1.235455
    1985698  |   .3271968   .1028058     3.18   0.002     .1254148    .5289789
    1987777  |  -.0276542   .0752385    -0.37   0.713    -.1753286    .1200202
    2003616  |   .8758531   .3377652     2.59   0.010     .2129048    1.538801
    2015211  |  -.0194489   .0529143    -0.37   0.713    -.1233064    .0844086
    2017131  |  -.1009851   .2747489    -0.37   0.713    -.6402482    .4382781
    2023111  |  -.1038057   .2824229    -0.37   0.713     -.658131    .4505197
    2040526  |   .8158261   .1322512     6.17   0.000     .5562501    1.075402
    2080927  |  -.2247712   .2404551    -0.93   0.350    -.6967242    .2471819
    2084795  |    .900298    .271258     3.32   0.001     .3678866    1.432709
    2115558  |    .016216   .0441186     0.37   0.713    -.0703778    .1028098
    2126494  |  -.2791507   .0724604    -3.85   0.000    -.4213722   -.1369292
    2154193  |  -.1083556   .2948019    -0.37   0.713    -.6869776    .4702665
    2171355  |   .2157675   .4011558     0.54   0.591    -.5716006    1.003136
    2179278  |   .0500965    .136297     0.37   0.713    -.2174203    .3176133
    2183606  |   .0448308   .1219707     0.37   0.713    -.1945671    .2842288
    2226268  |   1.037498   .1020215    10.17   0.000     .8372558    1.237741
    2239384  |  -.0050842   .0138325    -0.37   0.713     -.032234    .0220656
    2269545  |    .795062    .187266     4.25   0.000     .4275058    1.162618
    2292099  |   .7715199   .1447415     5.33   0.000     .4874285    1.055611
    2292127  |   .9883845   .0316022    31.28   0.000     .9263572    1.050412
    2297739  |   .9935919   .0174346    56.99   0.000     .9593721    1.027812
    2301693  |   1.014733   .0400837    25.32   0.000     .9360587    1.093407
    2317972  |   -.208463   .1966889    -1.06   0.290    -.5945139    .1775879
    2332463  |   .9768321   .0630326    15.50   0.000      .853115    1.100549
    2333801  |   .0305571   .0831363     0.37   0.713    -.1326186    .1937328
    2336156  |  -.0911863   .1306386    -0.70   0.485     -.347597    .1652244
    2349525  |   .9023286   .1137698     7.93   0.000     .6790271     1.12563
    2354606  |  -.0019261   .0052402    -0.37   0.713    -.0122113    .0083592
    2364826  |  -.0504415   .2391951    -0.21   0.833    -.5199213    .4190384
    2394661  |  -.1651401    .449295    -0.37   0.713    -1.046993    .7167131
    2407414  |   .8926678   .0891985    10.01   0.000     .7175935    1.067742
    2408207  |   .8367124   .0790448    10.59   0.000     .6815673    .9918574
    2414295  |  -.0311617   .0847812    -0.37   0.713    -.1975658    .1352425
    2473356  |  -.1087454   .0856895    -1.27   0.205    -.2769323    .0594416
    2482873  |  -.2602029   .3360891    -0.77   0.439    -.9198614    .3994556
    2511014  |   .0555765   .1512063     0.37   0.713    -.2412035    .3523565
    2516819  |  -.0347244   .2815489    -0.12   0.902    -.5873343    .5178854
    2522458  |   .2064647   .4263713     0.48   0.628    -.6303952    1.043325
    2528294  |   .3901198   .0828933     4.71   0.000      .227421    .5528187
    2538967  |  -.0840019   .1495355    -0.56   0.574    -.3775024    .2094987
    2542784  |   .9819552   .0490942    20.00   0.000     .8855956    1.078315
    2573218  |  -.1181259   .0633922    -1.86   0.063    -.2425489     .006297
    2575363  |   1.058802    .159983     6.62   0.000     .7447959    1.372809
    2578377  |   .9768321   .0630326    15.50   0.000      .853115    1.100549
    2579974  |  -.2594343   .0827153    -3.14   0.002    -.4217836    -.097085
    2592513  |   1.046563   .1266838     8.26   0.000     .7979146    1.295212
    2598595  |  -.0580858   .1580335    -0.37   0.713    -.3682659    .2520942
    2607525  |  -.0476106   .2468134    -0.19   0.847    -.5320432    .4368221
    2613241  |   1.072277   .1966445     5.45   0.000     .6863137    1.458241
    2627096  |  -.1256248   .0479395    -2.62   0.009     -.219718   -.0315315
    2630885  |   .7173118   .0746586     9.61   0.000     .5707758    .8638478
    2635699  |  -.0399306   .2675052    -0.15   0.881    -.5649761     .485115
    2636295  |   .3984306   .1037547     3.84   0.000     .1947861    .6020751
    2663167  |  -.0508169   .2381851    -0.21   0.831    -.5183145    .4166807
    2671285  |    .649277   .2187182     2.97   0.003      .219988    1.078566
    2675112  |   .9883845   .0316022    31.28   0.000     .9263572    1.050412
    2678974  |    .076587   .2083694     0.37   0.713    -.3323898    .4855637
    2701443  |  -.4173748   .3945785    -1.06   0.290    -1.191833    .3570838
    2712596  |   .8050022   .2284311     3.52   0.000     .3566494    1.253355
    2723052  |   .3834694   .0670221     5.72   0.000     .2519218     .515017
    2735706  |    -.08225   .2237768    -0.37   0.713    -.5214676    .3569676
    2736654  |  -.2989194    .097123    -3.08   0.002    -.4895475   -.1082913
    2749057  |  -.3482428   .2123523    -1.64   0.101    -.7650371    .0685514
    2759143  |     .62904   .2713521     2.32   0.021     .0964439    1.161636
    2768228  |   .4540466   .2512753     1.81   0.071    -.0391438     .947237
    2803748  |   .3621346   .0357561    10.13   0.000     .2919544    .4323148
    2812269  |   .8826052   .3193946     2.76   0.006     .2557138    1.509497
    2816213  |  -.1014405   .2759881    -0.37   0.713    -.6431358    .4402548
    2825324  |   .0995798   .2709258     0.37   0.713    -.4321794    .6313391
    2833509  |    .047896   .1303102     0.37   0.713    -.2078701    .3036622
    2845277  |   .3451378   .0595066     5.80   0.000     .2283413    .4619343
    2846647  |   .0825237   .2245214     0.37   0.713    -.3581554    .5232028
    2847759  |   .9964244    .009728   102.43   0.000     .9773309    1.015518
    2856376  |   .9439967   .2242444     4.21   0.000     .5038614    1.384132
    2884209  |   1.050807   .1382292     7.60   0.000     .7794975    1.322116
    2903939  |   1.048087   .1308306     8.01   0.000     .7912997    1.304875
    2908949  |   .8990293   .1052854     8.54   0.000     .6923805    1.105678
    2914645  |   1.087872   .2390723     4.55   0.000      .618633    1.557111
    2924076  |  -.2274732   .6188839    -0.37   0.713    -1.442187    .9872405
    2943741  |   .9637267   .0986884     9.77   0.000     .7700261    1.157427
    2946145  |   .0681249   .1853466     0.37   0.713    -.2956639    .4319136
    2950071  |   1.058608   .1594534     6.64   0.000     .7456407    1.371575
    2971536  |  -.3133062   .1269407    -2.47   0.014    -.5624589   -.0641535
    2975277  |  -.1060553   .2885434    -0.37   0.713    -.6723934    .4602829
    2977764  |   .3794273   .0580149     6.54   0.000     .2655586     .493296
    2996626  |   1.075377   .2050763     5.24   0.000     .6728632     1.47789
    3000408  |    .912794   .2372605     3.85   0.000     .4471112    1.378477
    3020968  |   .7316073   .0735215     9.95   0.000     .5873031    .8759115
    3030646  |   .9100659   .1339189     6.80   0.000     .6472168    1.172915
    3035049  |   .9704306   .0804492    12.06   0.000      .812529    1.128332
    3038093  |   .4380098   .2081799     2.10   0.036     .0294048    .8466147
    3044834  |   .3555834   .0405465     8.77   0.000     .2760008    .4351661
    3096085  |   .0756709   .2058769     0.37   0.713    -.3284138    .4797556
    3139171  |   .9658335   .0929564    10.39   0.000     .7833835    1.148284
    3149161  |   .3000627   .1739302     1.73   0.085    -.0413186    .6414439
    3161335  |  -.0324149   .0881909    -0.37   0.713    -.2055116    .1406817
    3163095  |   .9405677   .1616968     5.82   0.000     .6231975    1.257938
    3206911  |    .999871   .0003509  2849.64   0.000     .9991824     1.00056
    3223834  |   .7027852   .0940442     7.47   0.000        .5182    .8873704
    3234644  |   .9570461   .1168643     8.19   0.000     .7276709    1.186421
    3253229  |   .9658335   .0929564    10.39   0.000     .7833835    1.148284
    3260366  |  -.0499391   .2405467    -0.21   0.836    -.5220718    .4221936
    3305893  |   .7174704   .0745348     9.63   0.000     .5711774    .8637635
    3333764  |   .9529053   .1281301     7.44   0.000      .701418    1.204393
    3338092  |   .5879145   .3804349     1.55   0.123    -.1587837    1.334613
    3353152  |   1.006431   .0174955    57.53   0.000     .9720913     1.04077
    3366959  |   .9746722    .068909    14.14   0.000     .8394211    1.109923
    3376617  |   .9344004   .1985129     4.71   0.000     .5447695    1.324031
    3384359  |  -.1285428   .3497249    -0.37   0.713    -.8149649    .5578794
    3400743  |   .0893088   .2429816     0.37   0.713     -.387603    .5662207
    3405796  |   .2257741    .374047     0.60   0.546    -.5083862    .9599344
    3422779  |   .8212888   .1180101     6.96   0.000     .5896645    1.052913
    3430952  |  -.1203849   .0584183    -2.06   0.040    -.2350454   -.0057244
    3452869  |   .8950088   .2856484     3.13   0.002     .3343527    1.455665
    3457772  |   .0513009   .1395738     0.37   0.713    -.2226475    .3252493
    3458363  |   .9758472   .0657123    14.85   0.000     .8468705    1.104824
    3461217  |   .3271306   .1029748     3.18   0.002     .1250169    .5292443
    3468056  |    .020451   .0556409     0.37   0.713    -.0887581    .1296602
    3474282  |  -.1600802   .4355284    -0.37   0.713    -1.014913    .6947527
    3508748  |   .3957419   .0969198     4.08   0.000     .2055126    .5859712
    3542841  |  -.1588219   .3233833    -0.49   0.623    -.7935421    .4758982
    3558621  |   1.067145   .1826815     5.84   0.000     .7085873    1.425703
    3564317  |   .0418524   .1138672     0.37   0.713    -.1816404    .2653451
    3583048  |  -.1100069   .2992945    -0.37   0.713    -.6974469    .4774332
    3585916  |   .9383616   .1676988     5.60   0.000     .6092109    1.267512
    3597995  |    1.04184   .1138334     9.15   0.000     .8184135    1.265266
    3607746  |  -.2742259    .374047    -0.73   0.464    -1.008386    .4599344
    3627494  |   .4571392   .2596065     1.76   0.079    -.0524032    .9666815
    3643244  |   .3868576   .0749824     5.16   0.000     .2396861    .5340291
    3667127  |    .754717   .2957583     2.55   0.011     .1742177    1.335216
    3668458  |  -.0472569   .1285712    -0.37   0.713    -.2996099    .2050962
    3668955  |   .9055257   .1220587     7.42   0.000     .6659552    1.145096
    3678184  |  -.0174142   .0473786    -0.37   0.713    -.1104064     .075578
    3693873  |   .0279935   .0761615     0.37   0.713    -.1214925    .1774795
    3700628  |   .3642122   .0359899    10.12   0.000      .293573    .4348514
    3709269  |  -.0429823   .1169416    -0.37   0.713    -.2725093    .1865446
    3718783  |   .9290138   .1931313     4.81   0.000     .5499457    1.308082
    3730865  |   .8149221   .1346211     6.05   0.000     .5506947    1.079149
    3736008  |   1.048667   .1324067     7.92   0.000     .7887854    1.308548
    3743843  |   1.026055   .0708878    14.47   0.000     .8869201     1.16519
    3789776  |   .9658335   .0929564    10.39   0.000     .7833835    1.148284
    3800315  |   .9641799   .0974554     9.89   0.000     .7728994     1.15546
    3806686  |   .4193304   .1583537     2.65   0.008     .1085219    .7301388
    3813116  |   .9300011   .1904453     4.88   0.000     .5562048    1.303797
    3824554  |   1.020981   .0570832    17.89   0.000     .9089411    1.133021
    3834836  |   .7730171   .1482976     5.21   0.000     .4819461    1.064088
    3836655  |   .1561046   .5630204     0.28   0.782    -.9489631    1.261172
    3849661  |   -.002585   .0070331    -0.37   0.713    -.0163891    .0112191
    3875108  |   .8270857   .1030895     8.02   0.000     .6247468    1.029425
    3891804  |  -.0245268   .0667299    -0.37   0.713    -.1555009    .1064472
    3904936  |   .9977895   .0060141   165.91   0.000     .9859852    1.009594
    3922227  |  -.1251659   .3405375    -0.37   0.713    -.7935556    .5432238
    3929234  |   .0382089   .1039545     0.37   0.713    -.1658277    .2422455
    3931245  |  -.0340255   .0925729    -0.37   0.713     -.215723    .1476719
    3947017  |   .4296996   .1859467     2.31   0.021      .064733    .7946663
    3963974  |   .8868207   .0748941    11.84   0.000     .7398225    1.033819
    3975708  |   .0920893   .2505463     0.37   0.713    -.3996702    .5838487
    3984153  |   .0566482   .1541221     0.37   0.713    -.2458549    .3591512
    3989111  |   .8632088   .0357658    24.14   0.000     .7930095    .9334081
    4005831  |   .0360939   .0982002     0.37   0.713    -.1566484    .2288361
    4043837  |   .9050795    .258249     3.50   0.000     .3982015    1.411958
    4050403  |   .3293179   .0974154     3.38   0.001      .138116    .5205199
    4053238  |   1.051013   .1387909     7.57   0.000     .7786014    1.323425
    4064468  |  -.2267373   .1488834    -1.52   0.128     -.518958    .0654833
    4073621  |  -.0806146   .1584997    -0.51   0.611    -.3917096    .2304805
    4119215  |  -.0241528   .0657123    -0.37   0.713    -.1531295    .1048239
    4127444  |   1.089309   .2429816     4.48   0.000      .612397    1.566221
    4140647  |   .0639307   .1739356     0.37   0.713    -.2774613    .4053227
    4188128  |   .0376977   .1025636     0.37   0.713     -.163609    .2390043
    4188564  |   .8181423   .1261954     6.48   0.000     .5704525    1.065832
    4217726  |   .3514357    .046946     7.49   0.000     .2592925    .4435789
    4236089  |   .9266182    .199649     4.64   0.000     .5347573    1.318479
    4238931  |  -.0398472   .2677301    -0.15   0.882    -.5653342    .4856398
    4250907  |   .9557581   .1203686     7.94   0.000     .7195047    1.192011
    4259748  |   .8608208   .0360675    23.87   0.000     .7900292    .9316123
    4261254  |   .3587154   .0372827     9.62   0.000     .2855388    .4318921
    4274855  |  -.0479523   .1304632    -0.37   0.713    -.3040188    .2081143
    4309558  |  -.1053016   .2864929    -0.37   0.713    -.6676152     .457012
    4312463  |   1.038166   .1038379    10.00   0.000     .8343583    1.241974
    4315841  |  -.2571232   .0860533    -2.99   0.003    -.4260242   -.0882221
    4315909  |   .8801082   .0594853    14.80   0.000     .7633534    .9968629
    4353246  |   .2575319   .2881574     0.89   0.372    -.3080487    .8231124
    4374839  |   .9784019   .0587618    16.65   0.000     .8630672    1.093737
    4383846  |   .7411509   .3324269     2.23   0.026     .0886805    1.393621
    4387728  |   -.048149   .2453641    -0.20   0.844    -.5297371    .4334391
    4388653  |   .0546074   .1485696     0.37   0.713    -.2369975    .3462123
    4397326  |   .3893852   .0810945     4.80   0.000     .2302171    .5485534
    4399293  |   .3199647   .1214484     2.63   0.009     .0815919    .5583374
    4418283  |     .04186   .1138879     0.37   0.713    -.1816734    .2653933
    4439956  |   .5957915   .3594079     1.66   0.098    -.1096361    1.301219
    4451086  |   .8049528   .1609327     5.00   0.000     .4890824    1.120823
    4462565  |   .9795117   .0557422    17.57   0.000     .8701038     1.08892
    4498129  |   .3091584   .1497977     2.06   0.039     .0151432    .6031736
    4509152  |   .4046391   .1197542     3.38   0.001     .1695917    .6396865
    4527045  |   .0728921   .1983168     0.37   0.713    -.3163539    .4621381
    4560376  |   .9300011   .1904453     4.88   0.000     .5562048    1.303797
    4572636  |    -.20677   .1982635    -1.04   0.297    -.5959115    .1823716
    4589088  |   .9924998   .0204058    48.64   0.000     .9524483    1.032551
    4591298  |   .9324596   .1933212     4.82   0.000     .5530187    1.311901
    4591884  |   .9247747   .2046646     4.52   0.000     .5230695     1.32648
    4598257  |  -.0579672    .218971    -0.26   0.791    -.4877522    .3718178
    4629146  |  -.0634685   .2042189    -0.31   0.756     -.464299     .337362
    4667466  |   .3541362   .0425495     8.32   0.000     .2706223    .4376501
    4699777  |  -.2572895   .0858021    -3.00   0.003    -.4256974   -.0888815
    4700313  |    .909074     .13132     6.92   0.000     .6513258    1.166822
    4716293  |   .7653448   .1303957     5.87   0.000     .5094109    1.021279
    4718887  |  -.1119513   .0778466    -1.44   0.151    -.2647447     .040842
    4723808  |   .2090136   .4194613     0.50   0.618    -.6142837    1.032311
    4725006  |   .2616389   .2770731     0.94   0.345    -.2821861    .8054639
    4726189  |   .7633731    .125943     6.06   0.000     .5161787    1.010568
    4744655  |    .448067   .2351833     1.91   0.057    -.0135388    .9096728
    4766011  |  -.1137615   .3095095    -0.37   0.713     -.721251    .4937281
    4773504  |  -.0035247   .0095896    -0.37   0.713    -.0223467    .0152973
    4797843  |  -.0942455   .2564127    -0.37   0.713    -.5975193    .4090283
    4813232  |   .0418399   .1138334     0.37   0.713    -.1815865    .2652664
    4831062  |   .9723458   .0752385    12.92   0.000     .8246714     1.12002
    4835757  |   .0119545   .0325246     0.37   0.713     -.051883    .0757921
    4851781  |   .0282959   .0769844     0.37   0.713    -.1228052     .179397
    4862495  |   .9741638   .0702923    13.86   0.000     .8361977     1.11213
    4865071  |   .9275431   .1971327     4.71   0.000     .5406211    1.314465
    4875878  |  -.0954132   .2595896    -0.37   0.713    -.6049223     .414096
    4893515  |   .7036544   .0925244     7.61   0.000     .5220522    .8852565
    4930473  |   -.115798   .0687167    -1.69   0.092    -.2506716    .0190756
    4959708  |   1.036094   .0982002    10.55   0.000     .8433516    1.228836
    4965883  |  -.2392803   .1200684    -1.99   0.047    -.4749444   -.0036162
    4969979  |   .6714903   .1628014     4.12   0.000     .3519521    .9910286
    4974831  |  -.1805269   .1227272    -1.47   0.142    -.4214096    .0603558
    4976366  |   .4539846   .2511083     1.81   0.071    -.0388779     .946847
    4979298  |   .0443732   .1207257     0.37   0.713     -.192581    .2813275
    4998571  |    .643662     .23321     2.76   0.006     .1859292    1.101395
    5003933  |   .4337377   .1967395     2.20   0.028     .0475874    .8198879
    5005547  |  -.0599932   .1632227    -0.37   0.713    -.3803584    .2603721
    5026681  |  -.0086433   .0235157    -0.37   0.713    -.0547987    .0375121
    5038976  |   .0349199   .0950061     0.37   0.713    -.1515532     .221393
    5051531  |  -.0204883   .0557422    -0.37   0.713    -.1298962    .0889197
    5059593  |   .4425547    .220372     2.01   0.045     .0100198    .8750895
    5065196  |   .2245828   .3772735     0.60   0.552    -.5159103    .9650759
    5069683  |  -.0231679   .0630326    -0.37   0.713     -.146885    .1005492
    5082101  |   .0790308   .2150182     0.37   0.713     -.342996    .5010576
    5084474  |   -.048149   .2453641    -0.20   0.844    -.5297371    .4334391
    5095951  |   .0439248   .1195058     0.37   0.713    -.1906351    .2784847
    5115496  |  -.0276542   .0752385    -0.37   0.713    -.1753286    .1200202
    5136264  |   .7907232   .1988666     3.98   0.000     .4003979    1.181048
    5140467  |  -.0870562   .2368527    -0.37   0.713    -.5519386    .3778263
    5146939  |   .9407552   .1611867     5.84   0.000     .6243862    1.257124
    5151535  |   -.091399   .1300822    -0.70   0.482    -.3467177    .1639198
    5154684  |   .3259344    .106033     3.07   0.002     .1178182    .5340507
    5193768  |  -.0050842   .0138325    -0.37   0.713     -.032234    .0220656
    5217423  |   1.011796   .0320938    31.53   0.000     .9488041    1.074788
    5217851  |  -.3014883   .1019858    -2.96   0.003    -.5016608   -.1013158
    5224364  |   .8031197   .2235721     3.59   0.000     .3643038    1.241936
    5254931  |  -.1666425   .4533824    -0.37   0.713    -1.056518    .7232334
    5277639  |   .0108315   .0294691     0.37   0.713    -.0470089    .0686719
    5317397  |  -.1120033   .3047261    -0.37   0.713     -.710104    .4860975
    5374028  |   .4588439   .2642012     1.74   0.083    -.0597168    .9774046
    5383253  |   1.068448   .1862267     5.74   0.000     .7029321    1.433965
    5391432  |   .4450468   .2270651     1.96   0.050     -.000625    .8907186
    5419808  |   .3391013    .073306     4.63   0.000     .1952199    .4829827
    5444967  |   .3606633   .0361284     9.98   0.000     .2897523    .4315744
    5452945  |   .6855004   .1296371     5.29   0.000     .4310552    .9399455
    5459046  |   -.212102   .2064324    -1.03   0.304    -.6172769     .193073
    5486605  |   .0093929   .0255553     0.37   0.713    -.0407657    .0595516
    5495472  |   .0167721   .0456316     0.37   0.713    -.0727914    .1063356
    5507221  |   .9880029   .0326404    30.27   0.000     .9239379    1.052068
    5518116  |   .7769272   .1577024     4.93   0.000     .4673969    1.086457
    5526079  |  -.0204883   .0557422    -0.37   0.713    -.1298962    .0889197
    5546165  |   .3587154   .0372827     9.62   0.000     .2855388    .4318921
    5594303  |   .9935919   .0174346    56.99   0.000     .9593721    1.027812
    5615298  |  -.0903825   .2459027    -0.37   0.713    -.5730277    .3922627
    5625605  |   .0296807   .0807519     0.37   0.713     -.128815    .1881763
    5626832  |   .0405631   .1103596     0.37   0.713    -.1760451    .2571714
    5627056  |   .2357614   .3470088     0.68   0.497    -.4453297    .9168524
    5628024  |   1.014186   .0385965    26.28   0.000     .9384311    1.089942
    5642885  |   .0062164   .0169129     0.37   0.713    -.0269794    .0394122
    5653864  |   .3594889   .0367373     9.79   0.000     .2873828     .431595
    5654561  |   .9147741   .2318733     3.95   0.000      .459665    1.369883
    5674641  |   .2978266   .1798883     1.66   0.098    -.0552489    .6509022
    5675929  |   .0739302   .2011412     0.37   0.713    -.3208594    .4687199
    5692778  |    .029251    .079583     0.37   0.713    -.1269503    .1854524
    5702683  |   .8221084   .1158868     7.09   0.000     .5946517    1.049565
    5708259  |  -.1550435   .4218252    -0.37   0.713    -.9829805    .6728935
    5712945  |  -.3383515   .1872299    -1.81   0.071    -.7058368    .0291337
    5752515  |    1.00713   .0193984    51.92   0.000     .9690558    1.045204
    5773139  |   .0226472   .0616161     0.37   0.713    -.0982897    .1435842
    5785051  |   .8123641   .2475344     3.28   0.001     .3265162    1.298212
    5797533  |     .99814   .0050605   197.24   0.000     .9882076    1.008072
    5817208  |   .7437367   .3254334     2.29   0.023     .1049927    1.382481
    5833449  |    .660596   .1898795     3.48   0.001     .2879102    1.033282
    5839623  |   1.037853   .1029853    10.08   0.000     .8357183    1.239987
    5843135  |   .0310884   .0845819     0.37   0.713    -.1349246    .1971015
    5843198  |   .3654208   .0365299    10.00   0.000     .2937217    .4371198
    5897528  |    .772783   .1477399     5.23   0.000     .4828067    1.062759
    5911188  |  -.1855684   .2529251    -0.73   0.463    -.6819969      .31086
    5944107  |   -.075926   .1709515    -0.44   0.657     -.411461    .2596089
    5947771  |   1.057012   .1551131     6.81   0.000     .7525643    1.361461
    5969973  |   .6278007   .2746062     2.29   0.022     .0888176    1.166784
    5981056  |   .9543774   .1241249     7.69   0.000     .7107514    1.198003
    5989709  |   .4282618   .1821093     2.35   0.019     .0708271    .7856966
    5991507  |   .6381535   .2475184     2.58   0.010     .1523371     1.12397
    5993311  |   1.009699    .026388    38.26   0.000     .9579061    1.061492
    6005256  |  -.0560033   .2242444    -0.25   0.803    -.4961386    .3841321
    6019378  |  -.0124869   .0339731    -0.37   0.713    -.0791676    .0541937
    6033986  |   .9347745   .1774583     5.27   0.000     .5864685    1.283081
    6053151  |  -.0806352   .2193833    -0.37   0.713    -.5112296    .3499592
    6057107  |   .9819662   .0490644    20.01   0.000     .8856652    1.078267
    6076454  |   .0753766   .2050763     0.37   0.713    -.3271368      .47789
    6095741  |   1.072277   .1966445     5.45   0.000     .6863137    1.458241
    6112571  |  -.0437815   .1191158    -0.37   0.713    -.2775759    .1900129
    6122988  |   .6193891   .2967629     2.09   0.037      .036918     1.20186
    6123077  |  -.0068269   .0185738    -0.37   0.713    -.0432825    .0296288
    6138666  |  -.1183869    .062807    -1.88   0.060    -.2416613    .0048876
    6146315  |   1.015599   .0424411    23.93   0.000     .9322982    1.098901
    6164319  |   .7823456   .2213263     3.53   0.000     .3479377    1.216754
    6168006  |  -.1944164   .2299341    -0.85   0.398    -.6457192    .2568865
    6168044  |   .3946873   .0942584     4.19   0.000     .2096816    .5796929
    6173241  |   .6950826   .4572368     1.52   0.129    -.2023584    1.592524
    6182262  |  -.0632234   .1720113    -0.37   0.713    -.4008384    .2743915
    6212052  |   .7577916   .2874562     2.64   0.009     .1935872    1.321996
    6213178  |  -.0449941   .1224151    -0.37   0.713    -.2852642    .1952759
    6214039  |   1.055135    .150005     7.03   0.000     .7607128    1.349557
    6228226  |   .9448624   .2265697     4.17   0.000     .5001629    1.389562
    6229506  |   .9944303   .0151534    65.62   0.000      .964688    1.024173
    6243964  |   .9936904   .0171666    57.89   0.000     .9599967    1.027384
    6249704  |   .2748602   .2414469     1.14   0.255    -.1990395      .74876
    6250416  |   .9774271   .0614137    15.92   0.000     .8568874    1.097967
    6256376  |   .0788302   .2144724     0.37   0.713    -.3421253    .4997856
    6274713  |   .3158261   .1322512     2.39   0.017     .0562501    .5754021
    6278882  |   .0568866   .1547707     0.37   0.713    -.2468895    .3606627
    6290294  |  -.1085049   .0862845    -1.26   0.209    -.2778598    .0608499
    6306459  |   .4365315   .2042189     2.14   0.033      .035701     .837362
    6315265  |   .8005261   .1726963     4.64   0.000     .4615668    1.139486
    6326825  |   -.067055   .1824359    -0.37   0.713    -.4251309    .2910208
    6328787  |  -.1243014   .0504114    -2.47   0.014    -.2232463   -.0253565
    6340263  |  -.3778897   .2895826    -1.30   0.192    -.9462676    .1904882
    6358969  |   .4122889    .139757     2.95   0.003      .137981    .6865969
    6364815  |    .948161   .1410379     6.72   0.000     .6713389    1.224983
    6380402  |   1.087872   .2390723     4.55   0.000      .618633    1.557111
    6404687  |   .2918527   .1958442     1.49   0.137    -.0925404    .6762458
    6448896  |   .0360939   .0982002     0.37   0.713    -.1566484    .2288361
    6462827  |   -.098366   .1119771    -0.88   0.380     -.318149    .1214169
    6470448  |   .0469694   .1277891     0.37   0.713    -.2038485    .2977873
    6481665  |   1.077425   .2106498     5.11   0.000     .6639724    1.490878
    6487821  |   .0026608   .0072392     0.37   0.713    -.0115479    .0168695
    6488612  |  -.0428608   .2596065    -0.17   0.869    -.5524032    .4666815
    6540866  |  -.2338062   .2647891    -0.88   0.377    -.7535207    .2859082
    6546397  |  -.0760944   .2070292    -0.37   0.713    -.4824409     .330252
    6563972  |  -.1427888   .0386507    -3.69   0.000    -.2186506   -.0669271
    6568232  |  -.0551376   .2265697    -0.24   0.808    -.4998371    .3895618
    6569047  |   .3322011   .0901638     3.68   0.000     .1552322      .50917
    6576764  |    .008595   .0233842     0.37   0.713    -.0373024    .0544923
    6582813  |   .7883814   .1860195     4.24   0.000     .4232719    1.153491
    6614541  |   .2266995   .3715409     0.61   0.542    -.5025419     .955941
    6631463  |   1.027204   .0740139    13.88   0.000     .8819334    1.172475
    6646017  |   .9825848   .0473812    20.74   0.000     .8895873    1.075582
    6649404  |   .3594889   .0367373     9.79   0.000     .2873828     .431595
    6657681  |   .0070066   .0190628     0.37   0.713    -.0304088     .044422
    6668782  |   .3956148   .0965984     4.10   0.000     .2060164    .5852132
    6678008  |    .584904   .3884826     1.51   0.133    -.1775898    1.347398
    6712334  |   .7208493   .0724604     9.95   0.000     .5786278    .8630708
    6712438  |  -.0503322   .1369383    -0.37   0.713    -.3191078    .2184434
    6726651  |   .8099448   .2412401     3.36   0.001     .3364511    1.283438
    6752777  |   .0416719   .1133762     0.37   0.713    -.1808571    .2642008
    6761847  |   .9204048   .2165538     4.25   0.000      .495364    1.345446
    6785177  |   .0625239   .1701081     0.37   0.713    -.2713556    .3964035
    6788936  |  -.0732574   .1780581    -0.41   0.681    -.4227408    .2762259
    6792454  |   .9609897   .1061348     9.05   0.000     .7526738    1.169306
    6800813  |  -.0141404   .0384716    -0.37   0.713    -.0896505    .0613697
    6808982  |  -.1981869   .1692723    -1.17   0.242     -.530426    .1340521
    6823682  |   .6629046   .1840757     3.60   0.000     .3016103    1.024199
    6856024  |   .1807532   .4961128     0.36   0.716    -.7929918    1.154498
    6858945  |   .2753096   .2402378     1.15   0.252    -.1962169    .7468362
    6862211  |  -.0571672   .1555342    -0.37   0.713    -.3624419    .2481074
    6877503  |  -.2156219   .1760133    -1.23   0.221    -.5610918     .129848
    6880503  |   .9022714   .2658891     3.39   0.001     .3803978    1.424145
    6901658  |   1.029251    .079583    12.93   0.000     .8730497    1.185452
    6926225  |   1.040563   .1103596     9.43   0.000     .8239549    1.257171
    6953631  |  -.0863024   .2348021    -0.37   0.713    -.5471599    .3745551
    6964809  |  -.0571672   .1555342    -0.37   0.713    -.3624419    .2481074
    6968266  |  -.0445785   .1212841    -0.37   0.713    -.2826288    .1934719
    6968899  |    .072497   .1972419     0.37   0.713    -.3146393    .4596334
    6971064  |   .9387054   .1667634     5.63   0.000     .6113907     1.26602
    6978536  |   .7868324   .2092886     3.76   0.000     .3760514    1.197613
    6997962  |   .0690799   .1879448     0.37   0.713    -.2998087    .4379684
    7001269  |   .9300011   .1904453     4.88   0.000     .5562048    1.303797
    7011132  |  -.0921774    .250786    -0.37   0.713    -.5844075    .4000527
    7032521  |   .2796049   .2286883     1.22   0.222    -.1692529    .7284627
    7046053  |   .0741718   .2017983     0.37   0.713    -.3219076    .4702512
    7049469  |   1.027418   .0745959    13.77   0.000      .881005    1.173831
    7050208  |  -.1882124    .142861    -1.32   0.188    -.4686127    .0921879
    7068015  |  -.1519536   .0533904    -2.85   0.005    -.2567455   -.0471617
    7068539  |  -.2284801   .1447415    -1.58   0.115    -.5125715    .0556112
    7082059  |   .3471436   .0552399     6.28   0.000     .2387215    .4555657
    7082529  |    .600621   .3465405     1.73   0.083     -.079551    1.280793
    7085943  |   .8195047   .1226449     6.68   0.000     .5787835    1.060226
    7094745  |    1.06072   .1652014     6.42   0.000     .7364715    1.384969
    7104006  |   .3170091   .1291552     2.45   0.014     .0635099    .5705084
    7108788  |  -.2400698   .2816838    -0.85   0.394    -.7929443    .3128047
    7129809  |   .5827284   .3943024     1.48   0.140    -.1911883    1.356645
    7146557  |  -.0052787   .0143617    -0.37   0.713    -.0334671    .0229097
    7153072  |   .0543023   .1477396     0.37   0.713    -.2356735     .344278
    7174723  |   .0529527   .1440678     0.37   0.713    -.2298162    .3357216
    7198907  |   .0342709   .0932406     0.37   0.713    -.1487369    .2172788
    7199325  |   1.054135   .1472841     7.16   0.000     .7650531    1.343217
    7201337  |    1.06908   .1879448     5.69   0.000     .7001913    1.437968
    7205892  |   .8104472   .1463948     5.54   0.000     .5231111    1.097783
    7209781  |  -.1224688   .3331996    -0.37   0.713    -.7764561    .5315184
    7257946  |   1.076587   .2083694     5.17   0.000     .6676102    1.485564
    7259099  |  -.1310984   .3566781    -0.37   0.713    -.8311679    .5689711
    7268644  |  -.2257954   .2432111    -0.93   0.353    -.7031578     .251567
    7292386  |   .9365315   .2042189     4.59   0.000      .535701    1.337362
    7305951  |   .8064787   .5265112     1.53   0.126    -.2269306    1.839888
    7312902  |   .0440583   .1198688     0.37   0.713    -.1912142    .2793307
    7318261  |   .0226472   .0616161     0.37   0.713    -.0982897    .1435842
    7321079  |   .9365315   .2042189     4.59   0.000      .535701    1.337362
    7333313  |  -.0551376   .2265697    -0.24   0.808    -.4998371    .3895618
    7364107  |   .9602289   .1082047     8.87   0.000     .7478503    1.172608
    7368906  |   .4458771   .2292964     1.94   0.052    -.0041742    .8959285
    7370462  |  -.0571672   .1555342    -0.37   0.713    -.3624419    .2481074
    7379312  |   -.251227   .3118177    -0.81   0.421    -.8632469    .3607929
    7379888  |   .4593646   .2656049     1.73   0.084    -.0619511    .9806803
    7434197  |   .1163491   .3165498     0.37   0.713    -.5049587     .737657
    7453285  |   .8131378   .2495504     3.26   0.001     .3233329    1.302943
    7488267  |  -.1560863   .4246624    -0.37   0.713     -.989592    .6774193
    7499418  |    .076587   .2083694     0.37   0.713    -.3323898    .4855637
    7507104  |   .8131378   .2495504     3.26   0.001     .3233329    1.302943
    7523946  |   1.076587   .2083694     5.17   0.000     .6676102    1.485564
    7550713  |   1.082779   .2252171     4.81   0.000     .6407348    1.524824
    7586827  |   .5879145   .3804349     1.55   0.123    -.1587837    1.334613
    7598476  |   .9412473   .1598478     5.89   0.000     .6275062    1.254988
    7608259  |  -.1219846   .0550396    -2.22   0.027    -.2300135   -.0139557
    7624816  |   .0272866   .0742384     0.37   0.713    -.1184248     .172998
    7630224  |   .9935285   .0176071    56.43   0.000     .9589702    1.028087
    7630258  |   .8956148   .0965984     9.27   0.000     .7060164    1.085213
    7642272  |  -.0621916   .2076403    -0.30   0.765    -.4697374    .3453543
    7665777  |   1.075377   .2050763     5.24   0.000     .6728632     1.47789
    7691774  |   .9098582   .2452477     3.71   0.000     .4284986    1.391218
    7697777  |   .3603146   .0362809     9.93   0.000     .2891042     .431525
    7704309  |   .2287296   .3660435     0.62   0.532     -.489722    .9471812
    7746468  |   .9716139   .0772297    12.58   0.000     .8200314    1.123196
    7798951  |   .0376977   .1025636     0.37   0.713     -.163609    .2390043
    7802026  |  -.1354787   .0361003    -3.75   0.000    -.2063346   -.0646229
    7806392  |   .4173861   .1532049     2.72   0.007     .1166833    .7180888
    7837542  |   .8293709   .2921401     2.84   0.005     .2559732    1.402769
    7843653  |   .8665795   .0373133    23.22   0.000     .7933428    .9398163
    7847177  |   -.346563   .5702638    -0.61   0.544    -1.465848    .7727217
    7854277  |   .9658335   .0929564    10.39   0.000     .7833835    1.148284
    7900217  |   .1809521    .495573     0.37   0.715    -.7917334    1.153638
    7908379  |  -.2441444   .1097169    -2.23   0.026    -.4594912   -.0287976
    7916474  |  -.0025735   .0070016    -0.37   0.713    -.0163158    .0111689
    7933843  |  -.0724569   .1971327    -0.37   0.713    -.4593789    .3144651
    7941827  |   .3810449    .061542     6.19   0.000     .2602535    .5018364
    7961017  |  -.3350823   .1790409    -1.87   0.062    -.6864947      .01633
    7966169  |    .332826   .0886054     3.76   0.000     .1589158    .5067362
    7970249  |  -.1705797   .2922705    -0.58   0.560    -.7442334    .4030741
    7977788  |   .2260348   .3733411     0.61   0.545      -.50674    .9588096
    7985004  |   1.007671   .0208716    48.28   0.000     .9667057    1.048637
    7992281  |  -.0911665   .2480358    -0.37   0.713    -.5779986    .3956655
    7999227  |  -.1985455   .2192842    -0.91   0.365    -.6289453    .2318544
    8011163  |   .0930752   .2532286     0.37   0.713     -.403949    .5900993
    8013694  |    .677585   .5047104     1.34   0.180    -.3130347    1.668205
    8020183  |    1.05856   .1593247     6.64   0.000      .745846    1.371275
    8029488  |   .0609247   .1657571     0.37   0.713    -.2644149    .3862643
    8040728  |   .4179929   .1548109     2.70   0.007     .1141381    .7218477
    8042032  |   .9028775   .2642402     3.42   0.001     .3842403    1.421515
    8050174  |   .0856521   .2330328     0.37   0.713    -.3717327     .543037
    8050737  |  -.2629105   .0783797    -3.35   0.001    -.4167501   -.1090709
    8052448  |   -.102242   .1020386    -1.00   0.317    -.3025181     .098034
    8053482  |    .859967   .0364569    23.59   0.000     .7884113    .9315227
    8067421  |  -.2688031   .3593635    -0.75   0.455    -.9741434    .4365372
    8080506  |  -.0551376   .2265697    -0.24   0.808    -.4998371    .3895618
    8086625  |   1.040563   .1103596     9.43   0.000     .8239549    1.257171
    8102401  |   .8792937   .0577291    15.23   0.000     .7659861    .9926014
    8136376  |  -.2199491   .1653232    -1.33   0.184    -.5444372    .1045389
    8153445  |   .4528722   .2481131     1.83   0.068    -.0341116     .939856
    8187087  |  -.0258362   .0702923    -0.37   0.713    -.1638023    .1121299
    8199609  |   .9353643   .1758536     5.32   0.000     .5902078    1.280521
    8201999  |   .4181431   .1552084     2.69   0.007     .1135079    .7227782
    8205626  |   1.027683   .0753158    13.64   0.000     .8798566    1.175509
    8215757  |   .9600276   .1087526     8.83   0.000     .7465736    1.173482
    8220359  |   .9693366   .0834257    11.62   0.000     .8055929     1.13308
    8231506  |   1.007884   .0214489    46.99   0.000     .9657849    1.049982
    8250273  |  -.0428608   .2596065    -0.17   0.869    -.5524032    .4666815
    8252983  |   .9230489   .1682254     5.49   0.000     .5928648    1.253233
    8258473  |   .9748405    .068451    14.24   0.000     .8404883    1.109193
    8268443  |   .9862483    .037414    26.36   0.000     .9128141    1.059683
    8270028  |   1.038166   .1038379    10.00   0.000     .8343583    1.241974
    8290753  |  -.3599534   .2425918    -1.48   0.138    -.8361002    .1161934
    8309948  |   .0573599   .1560583     0.37   0.713    -.2489435    .3636632
    8311783  |   .9135771   .2351298     3.89   0.000     .4520764    1.375078
    8317488  |  -.0341665   .0929564    -0.37   0.713    -.2166165    .1482836
    8318032  |  -.1135417   .3089117    -0.37   0.713    -.7198579    .4927744
    8321388  |  -.1072752   .0893406    -1.20   0.230    -.2826284    .0680779
    8325553  |   1.070531   .1918926     5.58   0.000     .6938938    1.447168
    8358439  |  -.0571672   .1555342    -0.37   0.713    -.3624419    .2481074
    8381734  |  -.0826403   .1531352    -0.54   0.590    -.3832062    .2179256
    8391073  |    1.06072   .1652014     6.42   0.000     .7364715    1.384969
    8393262  |   .0893088   .2429816     0.37   0.713     -.387603    .5662207
    8400856  |   .2442632   .3240096     0.75   0.451    -.3916863    .8802127
    8413464  |   .0633555   .1723705     0.37   0.713    -.2749646    .4016755
    8430567  |    .001666   .0045326     0.37   0.713    -.0072303    .0105623
    8436047  |   .2460212   .3192563     0.77   0.441    -.3805988    .8726412
    8438227  |   1.019744   .0537174    18.98   0.000     .9143102    1.125178
    8444801  |  -.0717346   .1821187    -0.39   0.694     -.429188    .2857187
    8463216  |   .9885266   .0312157    31.67   0.000      .927258    1.049795
    8464345  |   .4571392   .2596065     1.76   0.079    -.0524032    .9666815
    8478051  |  -.0915377   .1297193    -0.71   0.481    -.3461441    .1630687
    8480747  |  -.0847285   .1476166    -0.57   0.566    -.3744628    .2050058
    8493522  |   .0608213   .1654757     0.37   0.713    -.2639661    .3856086
    8495973  |    .076587   .2083694     0.37   0.713    -.3323898    .4855637
    8506984  |   .0392509   .1067895     0.37   0.713    -.1703501    .2488519
    8507855  |   .8526757   .0448314    19.02   0.000      .764683    .9406684
    8520153  |   .9710409   .0787887    12.32   0.000     .8163984    1.125683
    8528489  |  -.0051866   .0141111    -0.37   0.713    -.0328832      .02251
    8528813  |  -.0551376   .2265697    -0.24   0.808    -.4998371    .3895618
    8567489  |   .3022485   .1681146     1.80   0.073    -.0277182    .6322152
    8577727  |   .2752288   .2404551     1.14   0.253    -.1967242    .7471819
    8590549  |   1.081862   .2227216     4.86   0.000     .6447156    1.519009
    8596973  |   .4448624   .2265697     1.96   0.050     .0001629    .8895618
    8613356  |   .0267762   .0728498     0.37   0.713    -.1162096     .169762
    8635439  |  -.0215981   .0587618    -0.37   0.713    -.1369328    .0937365
    8657128  |  -.0392137   .1066882    -0.37   0.713    -.2486158    .1701885
    8668985  |   .8740249    .342739     2.55   0.011     .2013142    1.546736
    8677168  |   .7921325   .1950959     4.06   0.000     .4092082    1.175057
    8695906  |   .3195047   .1226449     2.61   0.009     .0787835    .5602259
    8720993  |   .4763693   .3115111     1.53   0.127    -.1350488    1.087787
    8742588  |   .8757636   .3380085     2.59   0.010     .2123379    1.539189
    8793889  |   .9997724   .0006193  1614.43   0.000     .9985569    1.000988
    8874916  |   .4628223   .2749296     1.68   0.093    -.0767955     1.00244
    8876922  |  -.0616726   .1677919    -0.37   0.713     -.391006    .2676608
    8886067  |   .9600276   .1087526     8.83   0.000     .7465736    1.173482
    8887182  |   .0279935   .0761615     0.37   0.713    -.1214925    .1774795
    8888311  |   .0995798   .2709258     0.37   0.713    -.4321794    .6313391
    8889878  |   .2555823   .2934212     0.87   0.384    -.3203299    .8314946
    8896452  |   .4314634   .1906582     2.26   0.024     .0572493    .8056775
    8897282  |  -.1591653   .4330392    -0.37   0.713    -1.009112    .6907819
    8927236  |   .0707893   .1925956     0.37   0.713    -.3072276    .4488062
    8928709  |  -.0060886   .0165653    -0.37   0.713    -.0386022    .0264249
    8929675  |  -.2316295   .2589224    -0.89   0.371    -.7398291    .2765701
    8930568  |    1.06882   .1872379     5.71   0.000      .701319    1.436321
    8932689  |   .9734983   .0721028    13.50   0.000     .8319785    1.115018
    8939708  |    1.07883   .2144724     5.03   0.000     .6578747    1.499786
    8968764  |  -.2758281   .0715226    -3.86   0.000    -.4162089   -.1354473
    8972811  |  -.0276542   .0752385    -0.37   0.713    -.1753286    .1200202
    8983073  |   .0131732   .0358401     0.37   0.713     -.057172    .0835184
    8991685  |   1.051468   .1400295     7.51   0.000     .7766257    1.326311
    8996971  |   .0268987    .073183     0.37   0.713    -.1167412    .1705386
    9038779  |  -.0508023   .1382172    -0.37   0.713     -.322088    .2204834
    9045324  |    .436866    .205115     2.13   0.033     .0342768    .8394552
    9061466  |   .9929893    .019074    52.06   0.000     .9555519    1.030427
    9090043  |   .9707604   .0795519    12.20   0.000       .81462    1.126901
    9100651  |   1.068448   .1862267     5.74   0.000     .7029321    1.433965
    9114227  |   .8190985   .4921766     1.66   0.096    -.1469206    1.785118
    9117489  |   1.053642   .1459432     7.22   0.000     .7671921    1.340092
    9119489  |   -.141722   .0376398    -3.77   0.000    -.2155994   -.0678446
    9152213  |   .4448624   .2265697     1.96   0.050     .0001629    .8895618
    9163759  |  -.0258744   .3054476    -0.08   0.933    -.6253915    .5736426
    9189348  |   1.068448   .1862267     5.74   0.000     .7029321    1.433965
    9191325  |  -.0245268   .0667299    -0.37   0.713    -.1555009    .1064472
    9194011  |   1.058802    .159983     6.62   0.000     .7447959    1.372809
    9197785  |   .2313892    .358843     0.64   0.519    -.4729296    .9357079
    9217812  |   .1030844   .2804606     0.37   0.713    -.4473893    .6535581
    9236225  |  -.0111465   .0303263    -0.37   0.713    -.0706694    .0483763
    9238377  |   .0070928   .0192974     0.37   0.713    -.0307832    .0449688
    9265581  |   .9936535   .0172669    57.55   0.000     .9597628    1.027544
    9292457  |  -.0025735   .0070016    -0.37   0.713    -.0163158    .0111689
    9302524  |   .0326551   .0888443     0.37   0.713     -.141724    .2070342
    9307017  |    .340712   .0695124     4.90   0.000     .2042765    .4771475
    9336534  |  -.0136179   .0370502    -0.37   0.713    -.0863382    .0591023
    9361445  |   .4813647   .3250161     1.48   0.139    -.1565602     1.11929
    9373106  |   1.081707   .2222994     4.87   0.000     .6453891    1.518025
    9395545  |   .8684974   .0391371    22.19   0.000     .7916811    .9453137
    9397184  |   1.002748   .0074768   134.12   0.000     .9880731    1.017423
    9403053  |   .0633555   .1723705     0.37   0.713    -.2749646    .4016755
    9427606  |  -.0681384   .1917223    -0.36   0.722    -.4444412    .3081643
    9429663  |  -.2587546   .3321714    -0.78   0.436    -.9107236    .3932144
    9465837  |   .0279935   .0761615     0.37   0.713    -.1214925    .1774795
    9468728  |   1.076587   .2083694     5.17   0.000     .6676102    1.485564
    9477401  |   .3195047   .1226449     2.61   0.009     .0787835    .5602259
    9482942  |   .9731337   .3027678     3.21   0.001     .3788766    1.567391
    9501995  |   .7795205    .228915     3.41   0.001     .3302178    1.228823
    9524142  |  -.0050842   .0138325    -0.37   0.713     -.032234    .0220656
    9531502  |  -.0075512   .0205445    -0.37   0.713    -.0478748    .0327724
    9549168  |   .0388902   .1058081     0.37   0.713    -.1687846    .2465649
    9566421  |   .3370522   .0782212     4.31   0.000     .1835236    .4905808
    9566464  |   .8602769   .0362989    23.70   0.000     .7890313    .9315225
    9572523  |    .558818   .4584293     1.22   0.223    -.3409636      1.4586
    9575801  |   1.073331   .1995104     5.38   0.000     .6817419     1.46492
    9581031  |    .264324   .2698303     0.98   0.328    -.2652851    .7939332
    9583499  |    .410447   .1349185     3.04   0.002      .145636    .6752581
    9590009  |   .9768321   .0630326    15.50   0.000      .853115    1.100549
    9618297  |   .0788302   .2144724     0.37   0.713    -.3421253    .4997856
    9618903  |    .729902   .0725712    10.06   0.000      .587463     .872341
    9625422  |  -.0812164   .2209646    -0.37   0.713    -.5149145    .3524817
    9651841  |  -.1029963   .1001189    -1.03   0.304    -.2995046    .0935119
    9663512  |   .0510131   .1387909     0.37   0.713    -.2213986    .3234249
    9671015  |   .4413358   .2171002     2.03   0.042     .0152225    .8674491
    9671063  |   .9172685   .1528939     6.00   0.000     .6171762    1.217361
    9694979  |  -.2827662   .3971824    -0.71   0.477    -1.062336    .4968032
    9717276  |  -.2702389   .0725054    -3.73   0.000    -.4125488    -.127929
    9724622  |   .8950331   .0951298     9.41   0.000     .7083171    1.081749
    9740556  |  -.0594885   .1618498    -0.37   0.713    -.3771591     .258182
    9752131  |   .9365315   .2042189     4.59   0.000      .535701    1.337362
    9754896  |   .9604047   .1077265     8.92   0.000     .7489646    1.171845
    9772919  |     1.0551   .1499105     7.04   0.000     .7608635    1.349337
    9784716  |  -.0496507   .2413225    -0.21   0.837    -.5233062    .4240047
    9802901  |   .4055257   .1220587     3.32   0.001     .1659552    .6450962
    9806675  |    .038166   .1038379     0.37   0.713    -.1656417    .2419737
    9811326  |   .0277196   .0754165     0.37   0.713    -.1203041    .1757434
    9820038  |  -.2203678   .1642969    -1.34   0.180    -.5428413    .1021057
    9823206  |   .8411781   .3233833     2.60   0.009     .2064579    1.475898
    9826437  |   1.027156   .0738834    13.90   0.000     .8821415    1.172171
    9837961  |   1.005076   .0138091    72.78   0.000     .9779718    1.032179
    9849331  |   1.014103    .038369    26.43   0.000     .9387939    1.089411
    9871053  |  -.1416638   .3854232    -0.37   0.713    -.8981529    .6148252
    9873409  |   1.040563   .1103596     9.43   0.000     .8239549    1.257171
    9910104  |   .0728895   .1983098     0.37   0.713    -.3163428    .4621219
    9914734  |  -.0331404   .0901647    -0.37   0.713    -.2101111    .1438303
    9915513  |   .0006147   .0016724     0.37   0.713    -.0026677    .0038971
    9936357  |   .9703961   .0805429    12.05   0.000     .8123106    1.128482
    9952575  |   .3207783   .1193344     2.69   0.007     .0865548    .5550018
    9982136  |  -.0025396   .0069095    -0.37   0.713    -.0161012     .011022
    9991292  |   .0615641   .1674967     0.37   0.713    -.2671899     .390318
             |
        term |
       2005  |   .2428368   .1124402     2.16   0.031      .022145    .4635287
             |
       _cons |  -.1808282   .4919774    -0.37   0.713    -1.146456    .7847999
------------------------------------------------------------------------------

. outreg2 fpm using DiD_corruption.doc, bdec(3) nocons tex(nopretty) replace
DiD_corruption.tex
DiD_corruption.doc
dir : seeout

. 
. ***DiD specification for change in oppositon's educational levels***
. reg opp_yschool fpm i.cityr i.term, cluster(cityr)

Linear regression                               Number of obs     =      1,157
                                                F(1, 853)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.7923
                                                Root MSE          =     2.3538

                                (Std. err. adjusted for 854 clusters in cityr)
------------------------------------------------------------------------------
             |               Robust
 opp_yschool | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         fpm |   .0187335    .077709     0.24   0.810    -.1337897    .1712567
             |
       cityr |
       6592  |   2.586991   .7301043     3.54   0.000     1.153979    4.020002
      12775  |   3.592721   .3067361    11.71   0.000     2.990675    4.194767
      12821  |  -.9133248   .3595397    -2.54   0.011    -1.619011   -.2076386
      13056  |   -.754932   .3661342    -2.06   0.040    -1.473562   -.0363024
      13552  |   3.391739   .2077852    16.32   0.000     2.983909    3.799569
      15152  |   2.532288   .1863079    13.59   0.000     2.166612    2.897963
      19861  |   3.760924   .9515992     3.95   0.000     1.893174    5.628674
      20959  |   6.164383   .6818802     9.04   0.000     4.826023    7.502742
      21741  |   2.069504   .8068279     2.56   0.010     .4859036    3.653105
      33386  |   1.081801   .3736717     2.90   0.004     .3483774    1.815225
      37827  |   4.034815   .1444172    27.94   0.000      3.75136     4.31827
      44032  |   1.969153   .9267661     2.12   0.034     .1501433    3.788162
      44539  |   3.955752   2.257607     1.75   0.080    -.4753629    8.386868
      49422  |    5.99401    .024848   241.23   0.000     5.945239     6.04278
      50674  |    1.08948   .9321721     1.17   0.243    -.7401395      2.9191
      57757  |   2.073961   1.650244     1.26   0.209    -1.165054    5.312975
      58365  |   1.337566   .2275312     5.88   0.000     .8909792    1.784152
      58634  |   5.165639   .2408003    21.45   0.000     4.693008    5.638269
      61129  |   2.811587    .601146     4.68   0.000     1.631688    3.991486
      73704  |    .316361   .8384096     0.38   0.706    -1.329227    1.961949
      75344  |   2.045279   .1878225    10.89   0.000      1.67663    2.413927
      75623  |   1.161406   .6695332     1.73   0.083    -.1527194    2.475532
      78102  |   4.029883   .6916663     5.83   0.000     2.672316    5.387451
      81099  |   3.980567    .080612    49.38   0.000     3.822346    4.138788
      87651  |  -3.779515   .9145982    -4.13   0.000    -5.574642   -1.984389
      88022  |   2.701642   .7196835     3.75   0.000     1.289084      4.1142
      88472  |   5.468002   1.182027     4.63   0.000      3.14798    7.788024
      95775  |  -.9902979   .0402455   -24.61   0.000     -1.06929   -.9113061
      96659  |   1.905622   .3914908     4.87   0.000     1.137224     2.67402
     102952  |   4.443249   .9267661     4.79   0.000      2.62424    6.262258
     107506  |    1.71402   .6702049     2.56   0.011     .3985763    3.029464
     108977  |   6.256202   1.062759     5.89   0.000     4.170272    8.342132
     109064  |   3.839353   .6663846     5.76   0.000     2.531407    5.147299
     117839  |   5.198955   .1863079    27.91   0.000     4.833279     5.56463
     129325  |   5.851464   .6161443     9.50   0.000     4.642128    7.060801
     130557  |   5.689928   1.286217     4.42   0.000     3.165407    8.214449
     133366  |   2.279289   1.026424     2.22   0.027     .2646766    4.293902
     147659  |   5.797451   .3510225    16.52   0.000     5.108482    6.486421
     152924  |   5.227558   .4387697    11.91   0.000     4.366363    6.088752
     155075  |   4.866721   1.384674     3.51   0.000     2.148954    7.584489
     156473  |  -4.269556   .6050397    -7.06   0.000    -5.457097   -3.082015
     164878  |  -7.885042   .4768619   -16.54   0.000    -8.821002   -6.949081
     164885  |   5.698661   .7001065     8.14   0.000     4.324528    7.072794
     170683  |   5.321647   1.199651     4.44   0.000     2.967034     7.67626
     171814  |   4.647234    .080612    57.65   0.000     4.489013    4.805455
     177062  |   5.382331   2.562168     2.10   0.036     .3534392    10.41122
     191693  |   3.380678    .191636    17.64   0.000     3.004544    3.756811
     196732  |   2.045529   .1888604    10.83   0.000     1.674844    2.416215
     199222  |   -.750384   .3472687    -2.16   0.031    -1.431985   -.0687827
     209431  |   4.041885   1.176238     3.44   0.001     1.733224    6.350545
     213299  |   2.444445    1.01399     2.41   0.016      .454237    4.434654
     228359  |   3.394487   .0673134    50.43   0.000     3.262367    3.526606
     229742  |   5.905512    .391947    15.07   0.000     5.136219    6.674806
     229956  |    3.08898   .3691011     8.37   0.000     2.364527    3.813433
     232006  |   5.740779   1.075283     5.34   0.000     3.630269    7.851289
     244379  |  -1.484113   2.008163    -0.74   0.460    -5.425633    2.457406
     254252  |   5.022638   .0939073    53.49   0.000     4.838322    5.206955
     256603  |   -.830989   .7010788    -1.19   0.236    -2.207031    .5450526
     260258  |   1.884875   .4775515     3.95   0.000     .9475615    2.822189
     264155  |  -1.396573   .2623261    -5.32   0.000    -1.911454   -.8816928
     278747  |   3.063104   1.120945     2.73   0.006      .862971    5.263237
     283027  |   6.093471   .3877306    15.72   0.000     5.332453    6.854489
     284708  |   4.910931    .805841     6.09   0.000     3.329267    6.492595
     288527  |   3.074621   .5623981     5.47   0.000     1.970775    4.178468
     297999  |  -.9210864   .3273433    -2.81   0.005    -1.563579   -.2785936
     305204  |   5.118224   1.049283     4.88   0.000     3.058745    7.177702
     312801  |   5.051218   1.170248     4.32   0.000     2.754314    7.348122
     327404  |   2.235367   .5856373     3.82   0.000     1.085908    3.384826
     343793  |  -1.024408   .4785602    -2.14   0.033    -1.963702   -.0851149
     348159  |   3.049875   .2068866    14.74   0.000     2.643808    3.455941
     353884  |   .3523592    .078923     4.46   0.000     .1974531    .5072653
     363522  |   2.221747    .201972    11.00   0.000     1.825326    2.618167
     363604  |   3.147816   .2934606    10.73   0.000     2.571826    3.723805
     370683  |   2.372419   .5292239     4.48   0.000     1.333685    3.411152
     378973  |   3.949534   .4050811     9.75   0.000     3.154462    4.744607
     382582  |   6.044424   .1842748    32.80   0.000     5.682738    6.406109
     383076  |  -.9390811   .6163356    -1.52   0.128    -2.148793     .270631
     387105  |  -.0338856   .4425911    -0.08   0.939    -.9025808    .8348097
     392577  |   4.849068   .5900762     8.22   0.000     3.690897    6.007239
     395289  |  -.5990981   .5900911    -1.02   0.310    -1.757299    .5591025
     415021  |   3.569372   .8505936     4.20   0.000      1.89987    5.238874
     415177  |   6.251605   1.043689     5.99   0.000     4.203105    8.300106
     423866  |   6.021464   .0890371    67.63   0.000     5.846707    6.196222
     425348  |   2.933111   .9979654     2.94   0.003     .9743556    4.891866
     439007  |   4.284471   1.180022     3.63   0.000     1.968385    6.600557
     440577  |  -2.734737    .319462    -8.56   0.000    -3.361761   -2.107713
     450281  |  -.0549645   .3650691    -0.15   0.880    -.7715035    .6615744
     457092  |   4.066975   .2778198    14.64   0.000     3.521684    4.612265
     458642  |   2.820769   .9821077     2.87   0.004      .893138      4.7484
     470015  |  -.9066384   .3872755    -2.34   0.019    -1.666763   -.1465139
     481125  |   3.571498   .8592015     4.16   0.000     1.885101    5.257895
     488532  |   2.133542   .5539489     3.85   0.000     1.046279    3.220805
     495187  |   4.251605   .2753374    15.44   0.000     3.711187    4.792023
     502051  |    1.62098   .3986859     4.07   0.000     .8384597      2.4035
     507608  |   3.366765   1.063727     3.17   0.002     1.278935    5.454595
     519462  |   3.800831   .8261759     4.60   0.000     2.179256    5.422407
     536295  |   5.976003    .099543    60.03   0.000     5.780625    6.171381
     538912  |   5.952527   .3921448    15.18   0.000     5.182846    6.722209
     539921  |    6.18001   .7467027     8.28   0.000      4.71442      7.6456
     543451  |   4.241389   1.001312     4.24   0.000     2.276065    6.206713
     546274  |   4.600503   1.657162     2.78   0.006     1.347911    7.853096
     556475  |    2.51895   .6480938     3.89   0.000     1.246905    3.790996
     562174  |   1.094967   .9544842     1.15   0.252    -.7784463    2.968379
     563191  |   3.921478   .3257202    12.04   0.000     3.282171    4.560785
     575238  |   6.072284   .2998431    20.25   0.000     5.483767    6.660801
     576968  |   2.209057   .8261759     2.67   0.008     .5874807    3.830632
     590259  |   2.596537    .398184     6.52   0.000     1.815002    3.378073
     591172  |   3.235367   .5856373     5.52   0.000     2.085908    4.384826
     596965  |   4.082592   .9041867     4.52   0.000       2.3079    5.857283
     608686  |   2.738432   .2976889     9.20   0.000     2.154143     3.32272
     609803  |   6.017077   1.213682     4.96   0.000     3.634924    8.399229
     619155  |   2.629593   .1537863    17.10   0.000     2.327749    2.931437
     623212  |   5.764145   .9783579     5.89   0.000     3.843874    7.684415
     665845  |   2.051035   1.348476     1.52   0.129    -.5956845    4.697754
     670319  |   -.085513   2.428781    -0.04   0.972      -4.8526    4.681574
     671747  |   4.427506   .3827487    11.57   0.000     3.676266    5.178746
     673036  |   6.164972   .6843224     9.01   0.000     4.821818    7.508125
     677981  |   5.944701   .2293864    25.92   0.000     5.494473    6.394929
     678929  |   2.585463   .3545096     7.29   0.000     1.889649    3.281276
     684334  |   1.764745    2.40892     0.73   0.464     -2.96336    6.492849
     685284  |   5.969066   .4537343    13.16   0.000       5.0785    6.859633
     703415  |   1.733506    1.10545     1.57   0.117    -.4362151    3.903227
     717892  |   5.860261   .5796545    10.11   0.000     4.722545    6.997977
     725017  |  -.3203738   1.328951    -0.24   0.810     -2.92877    2.288022
     725151  |   5.468138   1.674247     3.27   0.001     2.182011    8.754264
     731479  |   3.776568   .4270028     8.84   0.000     2.938469    4.614667
     736154  |   6.234053     .97088     6.42   0.000     4.328459    8.139646
     739801  |   5.554602   .9178493     6.05   0.000     3.753094    7.356109
     747542  |   3.462367   .4285317     8.08   0.000     2.621267    4.303468
     748655  |   4.885573     .90805     5.38   0.000     3.103299    6.667847
     754021  |  -1.004934   1.127105    -0.89   0.373    -3.217158     1.20729
     757066  |   5.817537    .756878     7.69   0.000     4.331976    7.303099
     762126  |   1.645135   .9480755     1.74   0.083    -.2156996    3.505969
     763699  |  -1.187014   .1875111    -6.33   0.000    -1.555051    -.818977
     772987  |   4.815907   .2889099    16.67   0.000     4.248849    5.382964
     780635  |   .0834634   1.385286     0.06   0.952    -2.635506    2.802433
     785219  |   2.484362   .0648684    38.30   0.000     2.357042    2.611682
     792161  |   1.911112    1.01399     1.88   0.060    -.0790959    3.901321
     793088  |   3.911735   .3661342    10.68   0.000     3.193105    4.630365
     806057  |     3.9187   .3372444    11.62   0.000     3.256773    4.580626
     811473  |   .9273349   .3014237     3.08   0.002     .3357159    1.518954
     817727  |    2.01571   2.165908     0.93   0.352    -2.235424    6.266845
     847551  |   .7356793   .5173818     1.42   0.155    -.2798112     1.75117
     850272  |   4.813308   1.625457     2.96   0.003     1.622944    8.003673
     850863  |   .2698704   .4521813     0.60   0.551     -.617648    1.157389
     854243  |   4.659733   1.411468     3.30   0.001     1.889375    7.430091
     859017  |   3.629883   1.230127     2.95   0.003     1.215453    6.044314
     863916  |   3.261923    .071678    45.51   0.000     3.121237    3.402609
     866571  |   2.924319   .1938223    15.09   0.000     2.543894    3.304743
     869899  |   2.863811   .1870665    15.31   0.000     2.496647    3.230976
     881398  |   -.938403   .8191505    -1.15   0.252     -2.54619    .6693837
     886621  |   5.794234   .3624163    15.99   0.000     5.082902    6.505566
     890562  |   3.513502   1.500105     2.34   0.019     .5691722    6.457832
     907345  |   1.970788   1.538073     1.28   0.200    -1.048064     4.98964
     909157  |   1.993186   2.259012     0.88   0.378    -2.440687     6.42706
     913997  |   3.509923   .6123131     5.73   0.000     2.308107     4.71174
     918702  |  -2.255555    1.01399    -2.22   0.026    -4.245763   -.2653462
     925841  |   1.552127   .7809414     1.99   0.047     .0193351    3.084919
     932078  |    4.99715   .5620512     8.89   0.000     3.893984    6.100315
     934336  |   .8019847    .821392     0.98   0.329    -.8102015    2.414171
     947974  |   1.361356   1.085825     1.25   0.210    -.7698454    3.492558
     949469  |   5.600503   1.657162     3.38   0.001     2.347911    8.853096
     956532  |   2.981821   1.112438     2.68   0.007     .7983849    5.165258
     961701  |   3.922911   .3197764    12.27   0.000      3.29527    4.550551
     980049  |   5.527458   .8052565     6.86   0.000     3.946942    7.107975
     980341  |  -.1560473    .573743    -0.27   0.786    -1.282161    .9700662
     988713  |   4.016688   .4642486     8.65   0.000     3.105485    4.927892
    1008754  |   4.091596   .9407745     4.35   0.000     2.245092      5.9381
    1030024  |   .9805666    .080612    12.16   0.000     .8223456    1.138788
    1039319  |   2.270472   .9904721     2.29   0.022     .3264234     4.21452
    1039659  |   -1.11668   1.175245    -0.95   0.342    -3.423392    1.190031
    1055878  |   2.125646   .5211969     4.08   0.000     1.102668    3.148625
    1059019  |   6.280759   1.164623     5.39   0.000     3.994896    8.566622
    1087329  |   6.251605   1.043689     5.99   0.000     4.203105    8.300106
    1130445  |   4.348907   .4102779    10.60   0.000     3.543634    5.154179
    1162916  |   .0724354   .5709648     0.13   0.899    -1.048225    1.193096
    1167111  |  -1.287049   .7574215    -1.70   0.090    -2.773677    .1995792
    1176185  |   3.488203   .6424213     5.43   0.000     2.227292    4.749115
    1181891  |   3.998955   .1863079    21.46   0.000     3.633279    4.364631
    1194826  |   3.371382   1.218176     2.77   0.006     .9804089    5.762354
    1199583  |   6.193804   .8039215     7.70   0.000     4.615908      7.7717
    1201709  |  -3.260555    .301895   -10.80   0.000    -3.853099   -2.668011
    1201851  |   5.440837    1.28949     4.22   0.000     2.909892    7.971782
    1223136  |   1.498896   .5689546     2.63   0.009     .3821813    2.615611
    1248461  |  -3.072936   1.080163    -2.84   0.005    -5.193024   -.9528475
    1248986  |   2.175652   .5856373     3.72   0.000     1.026193    3.325111
    1254046  |   5.651371    .922722     6.12   0.000     3.840299    7.462443
    1257101  |   4.127421   .5285568     7.81   0.000     3.089996    5.164845
    1271075  |   2.026506   1.250976     1.62   0.106    -.4288455    4.481857
    1291848  |    3.69624   1.260034     2.93   0.003      1.22311     6.16937
    1295732  |   3.821697   1.248232     3.06   0.002      1.37173    6.271663
    1318102  |  -.8106334   .7855161    -1.03   0.302    -2.352404    .7311374
    1319847  |  -.0059381   .2542528    -0.02   0.981    -.5049725    .4930963
    1322312  |   3.784192   .4875085     7.76   0.000     2.827335    4.741049
    1324196  |   6.129467   .5370443    11.41   0.000     5.075384     7.18355
    1324807  |    3.37411   .5370443     6.28   0.000     2.320027    4.428193
    1338688  |   4.755647   .3691011    12.88   0.000     4.031194      5.4801
    1361637  |   4.908188   1.001861     4.90   0.000     2.941786    6.874591
    1383985  |   5.664049   1.393568     4.06   0.000     2.928825    8.399272
    1405824  |   3.089348   .3706258     8.34   0.000     2.361902    3.816793
    1406858  |   5.897987   .4231626    13.94   0.000     5.067425    6.728549
    1423484  |   4.045221   1.356933     2.98   0.003     1.381901     6.70854
    1448419  |   4.756015   .3706258    12.83   0.000     4.028569     5.48346
    1456817  |   5.060007   .8127262     6.23   0.000     3.464829    6.655184
    1495675  |   6.109512   1.013736     6.03   0.000     4.119803    8.099221
    1497624  |   4.826562   .6632636     7.28   0.000     3.524742    6.128382
    1505078  |   2.245955   .3624549     6.20   0.000     1.534547    2.957363
    1515799  |   2.140622   .5833191     3.67   0.000     .9957135    3.285531
    1531455  |   6.075764   .8764871     6.93   0.000     4.355439    7.796088
    1544863  |   .4376817   .7785272     0.56   0.574    -1.090372    1.965735
    1546908  |    3.59152   .7500063     4.79   0.000     2.119446    5.063594
    1557382  |   4.149266   1.176238     3.53   0.000     1.840606    6.457927
    1558752  |   5.934403   .3278639    18.10   0.000     5.290888    6.577917
    1565512  |  -3.588256   .8806179    -4.07   0.000    -5.316688   -1.859825
    1608972  |   5.458407   .4137881    13.19   0.000     4.646245    6.270569
    1664083  |   1.002395   1.155852     0.87   0.386    -1.266252    3.271042
    1711041  |  -.0320565   .6545837    -0.05   0.961     -1.31684    1.252727
    1720289  |    3.24107   .4116019     7.87   0.000     2.433199    4.048941
    1749253  |   5.677001   .8188609     6.93   0.000     4.069782    7.284219
    1751753  |   6.218469    .906237     6.86   0.000     4.439753    7.997185
    1755893  |   6.169011   .7010788     8.80   0.000     4.792969    7.545053
    1790032  |   4.800209   .5539489     8.67   0.000     3.712946    5.887472
    1814259  |   5.629527   .5851159     9.62   0.000     4.481092    6.777963
    1843081  |    3.18684   1.459925     2.18   0.029     .3213728    6.052307
    1885791  |   5.784176   .8952651     6.46   0.000     4.026995    7.541356
    1886818  |  -.9624249    1.22684    -0.78   0.433    -3.370405    1.445555
    1894847  |   .4814777   1.074047     0.45   0.654    -1.626608    2.589563
    1906642  |    6.01728    .071678    83.95   0.000     5.876594    6.157965
    1937499  |   3.942181   .3549248    11.11   0.000     3.245552    4.638809
    1967571  |   4.859782   .5816409     8.36   0.000     3.718167    6.001397
    1975711  |    .806719    .799456     1.01   0.313    -.7624125    2.375851
    1985698  |   4.759918   .4901158     9.71   0.000     3.797944    5.721893
    1987777  |    2.31996   .3661342     6.34   0.000      1.60133     3.03859
    2003616  |   5.203756   1.643671     3.17   0.002     1.977643    8.429869
    2015211  |   5.937924   .2574975    23.06   0.000     5.432521    6.443327
    2017131  |   4.344349   1.337014     3.25   0.001     1.720127    6.968572
    2023111  |   2.002013   1.374358     1.46   0.146    -.6955072    4.699532
    2040526  |   2.223626   .6320164     3.52   0.000     .9831363    3.464115
    2080927  |    3.09405   1.156622     2.68   0.008     .8238924    5.364208
    2084795  |   3.348445   1.320026     2.54   0.011     .7575649    5.939324
    2115558  |   1.051757   .2146951     4.90   0.000     .6303646     1.47315
    2126494  |   2.731945   .3723908     7.34   0.000     2.001036    3.462855
    2154193  |   3.654158   1.434598     2.55   0.011     .8384023    6.469913
    2171355  |   4.904265   1.937787     2.53   0.012     1.100876    8.707654
    2179278  |   6.159895   .6632636     9.29   0.000     4.858075    7.461715
    2183606  |   4.143088   .5935476     6.98   0.000     2.978103    5.308073
    2226268  |   1.619685   .4964683     3.26   0.001     .6452424    2.594128
    2239384  |   3.394487   .0673134    50.43   0.000     3.262367    3.526606
    2269545  |   2.657352   .8984317     2.96   0.003     .8939566    4.420748
    2292099  |   1.893672   .7430391     2.55   0.011     .4352732    3.352071
    2292127  |   5.962926   .1537863    38.77   0.000     5.661082     6.26477
    2297739  |   .6462139   .0848421     7.62   0.000     .4796901    .8127376
    2301693  |  -3.952976   .1950597   -20.27   0.000     -4.33583   -3.570123
    2317972  |   4.146101   .9441436     4.39   0.000     2.292984    5.999218
    2332463  |   5.426054   .3067361    17.69   0.000     4.824008      6.0281
    2333801  |    4.09753   .4045672    10.13   0.000     3.303466    4.891594
    2336156  |   .5204177    .653928     0.80   0.426    -.7630787    1.803914
    2349525  |   4.833052   .5721212     8.45   0.000     3.710122    5.955983
    2354606  |   4.660519   .0255006   182.76   0.000     4.610468    4.710571
    2364826  |   4.150464   1.181147     3.51   0.000      1.83217    6.468759
    2394661  |   1.222916   2.186409     0.56   0.576    -3.068456    5.514289
    2407414  |   3.635551   .4530462     8.02   0.000     2.746335    4.524767
    2408207  |   .7902893   .3765629     2.10   0.036     .0511908    1.529388
    2414295  |   -1.09946   .4125715    -2.66   0.008    -1.909234   -.2896854
    2473356  |   2.297707   .4360473     5.27   0.000     1.441856    3.153559
    2482873  |   2.814295   1.621393     1.74   0.083    -.3680924    5.996682
    2511014  |   4.177385   .7358169     5.68   0.000     2.733162    5.621609
    2516819  |  -1.049371   1.387034    -0.76   0.450    -3.771771    1.673029
    2522458  |   2.403643   2.060421     1.17   0.244    -1.640447    6.447732
    2528294  |   .9607519   .4225022     2.27   0.023     .1314861    1.790018
    2538967  |  -.0816515   .7456216    -0.11   0.913    -1.545119    1.381816
    2542784  |   3.942406   .2389077    16.50   0.000      3.47349    4.411322
    2573218  |   .9344335   .3279688     2.85   0.004      .290713    1.578154
    2575363  |   2.687682   .7785272     3.45   0.001     1.159628    4.215735
    2578377  |   1.926054   .3067361     6.28   0.000     1.324008      2.5281
    2579974  |   5.794875   .4388224    13.21   0.000     4.933577    6.656173
    2592513  |   5.148617   .6164829     8.35   0.000     3.938616    6.358618
    2598595  |  -4.185395   .7690402    -5.44   0.000    -5.694827   -2.675962
    2607525  |     1.4095   1.218176     1.16   0.248    -.9814728    3.800473
    2613241  |   6.230691   .9569333     6.51   0.000     4.352471     8.10891
    2627096  |   2.660499   .2524709    10.54   0.000     2.164962    3.156036
    2630885  |   4.720655   .3787155    12.46   0.000     3.977331    5.463978
    2635699  |   2.184012   1.318759     1.66   0.098    -.4043808    4.772406
    2636295  |  -1.512722   .5235755    -2.89   0.004     -2.54037    -.485075
    2663167  |  -2.350734   1.176238    -2.00   0.046    -4.659394   -.0420735
    2671285  |   .5035054    1.04324     0.48   0.629    -1.544113    2.551124
    2675112  |   4.212926   .1537863    27.39   0.000     3.911082     4.51477
    2678974  |   6.244445    1.01399     6.16   0.000     4.254237    8.234654
    2701443  |    4.29077   1.894114     2.27   0.024     .5731007     8.00844
    2712596  |   6.000539   1.148565     5.22   0.000     3.746195    8.254884
    2723052  |   5.939525    .345586    17.19   0.000     5.261227    6.617824
    2735706  |    5.73748   1.088967     5.27   0.000      3.60011    7.874849
    2736654  |   5.668849   .4706041    12.05   0.000     4.745171    6.592526
    2749057  |   4.178088   1.012622     4.13   0.000     2.190565    6.165612
    2759143  |   1.938914   1.297132     1.49   0.135    -.6070297    4.484858
    2768228  |   4.831456   1.239864     3.90   0.000     2.397914    7.264997
    2803748  |    1.62143    .185912     8.72   0.000     1.256532    1.986329
    2812269  |  -1.374693   1.554274    -0.88   0.377    -4.425342    1.675956
    2816213  |   3.676229   1.343044     2.74   0.006      1.04017    6.312287
    2825324  |  -.6821674   1.318409    -0.52   0.605    -3.269874    1.905539
    2833509  |   2.152871   .6341298     3.40   0.001     .9082338    3.397509
    2845277  |   2.650514   .2848805     9.30   0.000     2.091366    3.209663
    2846647  |   -.403273   1.092591    -0.37   0.712    -2.547755    1.741209
    2847759  |   2.655255   .0473394    56.09   0.000     2.562339     2.74817
    2856376  |   1.199379   1.108487     1.08   0.280    -.9763016     3.37506
    2884209  |   1.495495   .6726664     2.22   0.026     .1752193     2.81577
    2903939  |  -3.846518   .6366625    -6.04   0.000    -5.096127   -2.596909
    2908949  |   2.489188   .5309939     4.69   0.000     1.446981    3.531396
    2914645  |   4.280464   1.163401     3.68   0.000     1.997001    6.563927
    2924076  |   5.273965   3.011682     1.75   0.080    -.6372102    11.18514
    2943741  |   2.050892   .4802485     4.27   0.000     1.108285    2.993499
    2946145  |   6.217437   .9019541     6.89   0.000     4.447127    7.987746
    2950071  |    4.18706   .7759501     5.40   0.000     2.664065    5.710056
    2971536  |     .62293   .6065119     1.03   0.305    -.5675007    1.813361
    2975277  |     2.6615   1.404142     1.90   0.058    -.0944784    5.417478
    2977764  |   1.926624   .3018246     6.38   0.000     1.334218     2.51903
    2996626  |   2.240582   .9979654     2.25   0.025     .2818268    4.199338
    3000408  |   4.388328   1.154584     3.80   0.000     2.122171    6.654486
    3020968  |   .7662821   .3888264     1.97   0.049     .0031136    1.529451
    3030646  |   2.024414   .6698414     3.02   0.003     .7096841    3.339145
    3035049  |   4.905622   .3914908    12.53   0.000     4.137224     5.67402
    3038093  |   4.113604   1.030426     3.99   0.000     2.091136    6.136072
    3044834  |   3.450521   .2013126    17.14   0.000     3.055395    3.845647
    3096085  |   4.241522   1.001861     4.23   0.000     2.275119    6.207924
    3139171  |   1.224283   .4523548     2.71   0.007     .3364238    2.112141
    3149161  |   2.173313   .8337666     2.61   0.009     .5368385    3.809788
    3161335  |    3.39654   .4291646     7.91   0.000     2.554198    4.238882
    3163095  |   1.810308   .7868669     2.30   0.022     .2658855     3.35473
    3206911  |   3.666255   .0017075  2147.18   0.000     3.662904    3.669607
    3223834  |   .6742894   .4570903     1.48   0.141     -.222864    1.571443
    3234644  |   5.862902   .5686979    10.31   0.000     4.746691    6.979114
    3253229  |    1.89095   .4523548     4.18   0.000     1.003091    2.778808
    3260366  |   3.652068   1.187716     3.07   0.002     1.320879    5.983257
    3305893  |   5.721161     .37831    15.12   0.000     4.978633    6.463688
    3333764  |  -4.150314   .6235211    -6.66   0.000    -5.374129   -2.926499
    3338092  |   5.307652   1.825496     2.91   0.004     1.724662    8.890642
    3353152  |  -.9794754   .0851384   -11.50   0.000    -1.146581   -.8123702
    3366959  |   .7191606   .3353327     2.14   0.032     .0609866    1.377335
    3376617  |   2.102084   .9834596     2.14   0.033     .1717994    4.032368
    3384359  |   2.589725    1.70187     1.52   0.128    -.7506186    5.930069
    3400743  |    4.28505   1.182424     3.62   0.000     1.964249    6.605852
    3405796  |   4.769537   1.805956     2.64   0.008     1.224898    8.314176
    3422779  |  -1.758939   .5632856    -3.12   0.002    -2.864527   -.6533505
    3430952  |   .9272234   .3037887     3.05   0.002     .3309624    1.523484
    3452869  |   5.664896   1.390054     4.08   0.000     2.936569    8.393223
    3457772  |   6.163739   .6792098     9.07   0.000     4.830621    7.496857
    3458363  |   1.922911   .3197764     6.01   0.000      1.29527    2.550551
    3461217  |   3.009707   .4909274     6.13   0.000      2.04614    3.973274
    3468056  |   2.234177    .270766     8.25   0.000     1.702731    2.765622
    3474282  |   5.489066   2.119417     2.59   0.010     1.329183    9.648949
    3508748  |   4.395363   .4904546     8.96   0.000     3.432723    5.358002
    3542841  |    3.78267   1.609262     2.35   0.019     .6240919    6.941248
    3558621  |    6.21431   .8889852     6.99   0.000     4.469455    7.959165
    3564317  |   .6335817   .5541134     1.14   0.253    -.4540039    1.721167
    3583048  |   5.648887    1.45646     3.88   0.000     2.790221    8.507553
    3585916  |   2.495795   .8160748     3.06   0.002     .8940453    4.097545
    3597995  |   2.541767   .5539489     4.59   0.000     1.454504     3.62903
    3607746  |   5.436204   1.805956     3.01   0.003     1.891565    8.980843
    3627494  |    6.17466   1.280362     4.82   0.000     3.661632    8.687688
    3643244  |   3.283673   .3841756     8.55   0.000     2.529633    4.037714
    3667127  |   5.528582   1.425337     3.88   0.000     2.731002    8.326161
    3668458  |   5.849169   .6256676     9.35   0.000      4.62114    7.077197
    3668955  |   2.509923   .6123131     4.10   0.000     1.308107     3.71174
    3678184  |   2.444419   .2305589    10.60   0.000     1.991889    2.896948
    3693873  |   5.089348   .3706258    13.73   0.000     4.361902    5.816793
    3700628  |   2.373631   .1892471    12.54   0.000     2.002187    2.745076
    3709269  |   2.386621   .5690741     4.19   0.000     1.269672    3.503571
    3718783  |   3.773431   .9398369     4.01   0.000     1.928767    5.618095
    3730865  |   .8874068   .6434672     1.38   0.168    -.3755578    2.150371
    3736008  |   2.155331   .6443324     3.35   0.001     .8906682    3.419994
    3743843  |   2.252063   .3449622     6.53   0.000     1.574989    2.929138
    3789776  |    3.89095   .4523548     8.60   0.000     3.003091    4.778808
    3800315  |   3.885672   .4742483     8.19   0.000     2.954841    4.816502
    3806686  |  -2.696016    .788426    -3.42   0.001    -4.243498   -1.148533
    3813116  |   1.776582   .9267661     1.92   0.056    -.0424274    3.595591
    3824554  |  -.9330336   .2777848    -3.36   0.001    -1.478256   -.3878117
    3834836  |   1.898451   .7602729     2.50   0.013     .4062264    3.390676
    3836655  |   5.213837   2.725123     1.91   0.056    -.1348951    10.56257
    3849661  |   5.991749    .034225   175.07   0.000     5.924574    6.058924
    3875108  |  -.2404367   .4914785    -0.49   0.625    -1.205086    .7242122
    3891804  |   1.171717   .3247286     3.61   0.000      .534356    1.809078
    3904936  |   2.659612   .0292667    90.88   0.000     2.602168    2.717055
    3922227  |   4.600503   1.657162     2.78   0.006     1.347911    7.853096
    3929234  |   2.121953    .505875     4.19   0.000     1.129047    3.114858
    3931245  |   2.415209   .4504887     5.36   0.000     1.531013    3.299405
    3947017  |    2.33708   .9224171     2.53   0.011     .5266069    4.147553
    3963974  |  -2.549778   .3837478    -6.64   0.000    -3.302979   -1.796578
    3975708  |   6.293925   1.219236     5.16   0.000      3.90087    8.686979
    3984153  |   6.180806   .7500063     8.24   0.000     4.708732     7.65288
    3989111  |   2.374859   .1871396    12.69   0.000     2.007551    2.742167
    4005831  |   1.115202   .4778726     2.33   0.020     .1772582    2.053146
    4043837  |   5.197039    1.25672     4.14   0.000     2.730412    7.663665
    4050403  |   3.100022   .4642486     6.68   0.000     2.188818    4.011225
    4053238  |   1.162821   .6753998     1.72   0.085    -.1628198    2.488461
    4064468  |   1.899235   .7631114     2.49   0.013     .4014389    3.397031
    4073621  |   2.387493   .7891348     3.03   0.003       .83862    3.936367
    4119215  |   5.922911   .3197764    18.52   0.000      5.29527    6.550551
    4127444  |   -1.71495   1.182424    -1.45   0.147    -4.035751    .6058519
    4140647  |   3.620717    .846425     4.28   0.000     1.959397    5.282037
    4188128  |   2.786988   .4991066     5.58   0.000     1.807367    3.766609
    4188564  |   5.064352   .6027712     8.40   0.000     3.881263    6.247441
    4217726  |   2.277567   .2282131     9.98   0.000     1.829642    2.725492
    4236089  |   .7657847   .9715544     0.79   0.431    -1.141133    2.672702
    4238931  |   1.017612   1.319853     0.77   0.441    -1.572927    3.608151
    4250907  |   5.858791    .585751    10.00   0.000     4.709109    7.008474
    4259748  |   1.867237   .1858846    10.05   0.000     1.502392    2.232082
    4261254  |  -5.139483   .1892051   -27.16   0.000    -5.510845   -4.768121
    4274855  |   5.846949   .6348746     9.21   0.000     4.600849    7.093049
    4309558  |  -.0027619   1.394164    -0.00   0.998    -2.739155    2.733631
    4312463  |   2.121816   .5053074     4.20   0.000     1.130024    3.113608
    4315841  |   5.802251    .455857    12.73   0.000     4.907518    6.696984
    4315909  |   1.678797   .3089812     5.43   0.000     1.072345     2.28525
    4353246  |   2.704233   1.388395     1.95   0.052    -.0208376    5.429303
    4374839  |   2.931064   .2859533    10.25   0.000      2.36981    3.492319
    4383846  |   1.818616   1.603588     1.13   0.257    -1.328825    4.966056
    4387728  |   2.824448   1.211131     2.33   0.020     .4473017    5.201594
    4388653  |   3.174292   .7229861     4.39   0.000     1.755252    4.593333
    4397326  |   4.291741   .4137881    10.37   0.000     3.479579    5.103903
    4399293  |   3.861835   .5798652     6.66   0.000     2.723705    4.999965
    4418283  |   4.800273   .5542141     8.66   0.000      3.71249    5.888056
    4439956  |   3.332794   1.723518     1.93   0.053    -.0500387    6.715626
    4451086  |   3.688921   .7707838     4.79   0.000     2.176066    5.201776
    4462565  |   3.076451   .2712589    11.34   0.000     2.544037    3.608864
    4498129  |   .9940107   .7168684     1.39   0.166     -.413022    2.401043
    4509152  |  -.9929065   .6011378    -1.65   0.099    -2.172789    .1869762
    4527045  |   2.756462   .9650712     2.86   0.004     .8622694    4.650654
    4560376  |   2.576582   .9267661     2.78   0.006     .7575728    4.395591
    4572636  |   1.962965   1.002345     1.96   0.051     -.004386    3.930317
    4589088  |  -.0239388   .0993011    -0.24   0.810    -.2188419    .1709643
    4591298  |   4.095889   .9582387     4.27   0.000     2.215107    5.976671
    4591884  |   5.759901   .9959617     5.78   0.000     3.805078    7.714724
    4598257  |   3.293111   1.082861     3.04   0.002     1.167727    5.418494
    4629146  |   2.108886   1.011181     2.09   0.037     .1241904    4.093581
    4667466  |   4.845901   .2094596    23.14   0.000     4.434785    5.257018
    4699777  |  -.6982794   .4545839    -1.54   0.125    -1.590513    .1939547
    4700313  |   1.721248   .6572337     2.62   0.009     .4312637    3.011233
    4716293  |   1.373963   .6734689     2.04   0.042     .0521127    2.695814
    4718887  |   2.454141   .3980535     6.17   0.000     1.672862     3.23542
    4723808  |   5.382708   2.026814     2.66   0.008     1.404582    9.360835
    4725006  |   4.550675   1.334527     3.41   0.001     1.931332    7.170017
    4726189  |   3.034337   .6518516     4.65   0.000     1.754916    4.313758
    4744655  |   1.895704   1.161649     1.63   0.103    -.3843212    4.175729
    4766011  |   2.970236    1.50617     1.97   0.049     .0140031     5.92647
    4773504  |    3.98875    .046666    85.47   0.000     3.897156    4.080344
    4797843  |  -.9674738   1.247784    -0.78   0.438    -3.416561    1.481613
    4813232  |   4.133542   .5539489     7.46   0.000     3.046279    5.220805
    4831062  |   3.578402   .3661342     9.77   0.000     2.859772    4.297032
    4835757  |   4.704823   .1582747    29.73   0.000     4.394169    5.015476
    4851781  |   2.590313   .3746302     6.91   0.000     1.855008    3.325618
    4862495  |  -1.749129   .3420642    -5.11   0.000    -2.420515   -1.077743
    4865071  |   3.768737   .9593092     3.93   0.000     1.885854     5.65162
    4875878  |   5.695466   1.263244     4.51   0.000     3.216036    8.174897
    4893515  |  -4.322936   .4504789    -9.60   0.000    -5.207113   -3.438759
    4930473  |  -1.058136   .3538048    -2.99   0.003    -1.752566   -.3637064
    4959708  |   3.781869   .4778726     7.91   0.000     2.843925    4.719813
    4965883  |   5.859201   .6233018     9.40   0.000     4.635816    7.082586
    4969979  |   1.574404   .7755087     2.03   0.043     .0522755    3.096533
    4974831  |   3.735266   .5860343     6.37   0.000     2.585028    4.885504
    4976366  |   4.497925   1.239052     3.63   0.000     2.065977    6.929873
    4979298  |   4.141628   .5874889     7.05   0.000     2.988534    5.294721
    4998571  |   3.485584   1.113026     3.13   0.002     1.300992    5.670175
    5003933  |   6.099968   .9748445     6.26   0.000     4.186593    8.013344
    5005547  |   5.808518   .7942927     7.31   0.000     4.249521    7.367515
    5026681  |    3.63908   .1144347    31.80   0.000     3.414473    3.863687
    5038976  |   -.888545   .4623292    -1.92   0.055    -1.795981    .0188912
    5051531  |   3.934607   .2712589    14.50   0.000     3.402194     4.46702
    5059593  |    -.37189   1.089669    -0.34   0.733    -2.510636    1.766856
    5065196  |  -.5675987   1.821646    -0.31   0.755    -4.143033    3.007835
    5069683  |   3.259387   .3067361    10.63   0.000     2.657341    3.861433
    5082101  |  -.7477545   1.046346    -0.71   0.475    -2.801468    1.305959
    5084474  |   4.357781   1.211131     3.60   0.000     1.980635    6.734928
    5095951  |  -.8598035   .5815524    -1.48   0.140    -2.001245    .2816379
    5115496  |   -.588265   .3661342    -1.61   0.108    -1.306895    .1303646
    5136264  |    4.31017   .9547104     4.51   0.000     2.436314    6.184027
    5140467  |    5.72214   1.152599     4.96   0.000     3.459877    7.984403
    5146939  |   5.810906   .7843846     7.41   0.000     4.271356    7.350456
    5151535  |   4.019739   .6512291     6.17   0.000      2.74154    5.297938
    5154684  |   1.547555   .5056232     3.06   0.002     .5551441    2.539967
    5193768  |   2.983773   .0673134    44.33   0.000     2.851653    3.115892
    5217423  |    3.03765   .1561784    19.45   0.000     2.731111    3.344189
    5217851  |    4.66065   .4922247     9.47   0.000     3.694536    5.626763
    5224364  |  -2.005469   1.125008    -1.78   0.075    -4.213578    .2026394
    5254931  |   2.134788     2.2063     0.97   0.334    -2.195625    6.465201
    5277639  |   2.701238   .1434057    18.84   0.000     2.419769    2.982708
    5317397  |  -4.357485   1.482892    -2.94   0.003    -7.268029    -1.44694
    5374028  |   6.180101   1.302697     4.74   0.000     3.623233    8.736969
    5383253  |   2.910998    .906237     3.21   0.001     1.132282    4.689714
    5391432  |   5.136064   1.122195     4.58   0.000     2.933478     7.33865
    5419808  |   1.297914   .3493954     3.71   0.000     .6121387     1.98369
    5444967  |   1.366734   .1859905     7.35   0.000     1.001682    1.731787
    5452945  |  -1.714213   .6190795    -2.77   0.006     -2.92931    -.499115
    5459046  |   3.301153   .9914265     3.33   0.001     1.355232    5.247075
    5486605  |    6.02998     .12436    48.49   0.000     5.785892    6.274067
    5495472  |   2.553532   .2220578    11.50   0.000     2.117688    2.989376
    5507221  |   5.961708   .1588385    37.53   0.000     5.649948    6.273468
    5518116  |   2.910931    .805841     3.61   0.000     1.329267    4.492595
    5526079  |   2.434607   .2712589     8.98   0.000     1.902194     2.96702
    5546165  |   4.860517   .1892051    25.69   0.000     4.489155    5.231879
    5594303  |   5.979547   .0848421    70.48   0.000     5.813023    6.146071
    5615298  |   1.711523   1.196639     1.43   0.153    -.6371789    4.060225
    5625605  |   .7613999   .3929638     1.94   0.053    -.0098894    1.532689
    5626832  |   2.879467   .5370443     5.36   0.000     1.825384     3.93355
    5627056  |    2.46808   1.674484     1.47   0.141    -.8185118    5.754672
    5628024  |   6.045279   .1878225    32.19   0.000      5.67663    6.413927
    5642885  |  -.9801588   .0823036   -11.91   0.000      -1.1417   -.8186176
    5653864  |   4.862986   .1875111    25.93   0.000     4.494949    5.231023
    5654561  |   2.727981   1.128368     2.42   0.016     .5132789    4.942684
    5674641  |   3.666176   .8626526     4.25   0.000     1.973006    5.359347
    5675929  |   1.235966   .9788157     1.26   0.207    -.6852037    3.157135
    5692778  |   3.198063   .3872755     8.26   0.000     2.437938    3.958187
    5702683  |   1.243677   .5530521     2.25   0.025     .1581749     2.32918
    5708259  |   4.838475   2.052733     2.36   0.019     .8094755    8.867474
    5712945  |   5.542992   .8920839     6.21   0.000     3.792055    7.293929
    5752515  |   6.022757   .0943985    63.80   0.000     5.837476    6.208037
    5773139  |   2.072284   .2998431     6.91   0.000     1.483767    2.660801
    5785051  |   3.676814   1.241198     2.96   0.003     1.240654    6.112974
    5797533  |  -1.005937   .0246258   -40.85   0.000    -1.054271   -.9576023
    5817208  |   4.993535   1.569588     3.18   0.002     1.912828    8.074243
    5833449  |   .9682045   .9047713     1.07   0.285    -.8076345    2.744043
    5839623  |   .6208157   .5011587     1.24   0.216    -.3628329    1.604464
    5843135  |    .599226   .4116019     1.46   0.146    -.2086452    1.407097
    5843198  |   1.715252   .1929728     8.89   0.000     1.336495     2.09401
    5897528  |  -1.102296   .7575702    -1.46   0.146    -2.589216    .3846241
    5911188  |   2.363968   1.267343     1.87   0.062    -.1235083    4.851445
    5944107  |   3.902458   .8495922     4.59   0.000     2.234922    5.569994
    5947771  |   6.181969   .7548289     8.19   0.000     4.700429    7.663508
    5969973  |  -1.565041   1.312861    -1.19   0.234    -4.141858    1.011775
    5981056  |   5.187718   .6040305     8.59   0.000     4.002158    6.373278
    5989709  |   3.249157   .9037786     3.60   0.000     1.475267    5.023048
    5991507  |   5.468002   1.182027     4.63   0.000      3.14798    7.788024
    5993311  |   6.030957    .128412    46.97   0.000     5.778916    6.282997
    6005256  |  -.5339538   1.108487    -0.48   0.630    -2.709635    1.641727
    6019378  |   1.960145   .1653236    11.86   0.000     1.635656    2.284634
    6033986  |   1.791817   .8635671     2.07   0.038      .096852    3.486783
    6053151  |   4.742634   1.067588     4.44   0.000     2.647227     6.83804
    6057107  |   1.942441   .2387624     8.14   0.000      1.47381    2.411072
    6076454  |   4.240582   .9979654     4.25   0.000     2.281827    6.199338
    6095741  |   6.230691   .9569333     6.51   0.000     4.352471     8.10891
    6112571  |   4.526928   .5796545     7.81   0.000     3.389212    5.664644
    6122988  |   1.408111   1.420029     0.99   0.322    -1.379049    4.195271
    6123077  |    5.97821   .0903858    66.14   0.000     5.800806    6.155615
    6138666  |    3.60039    .325127    11.07   0.000     2.962247    4.238532
    6146315  |   4.049789   .2065315    19.61   0.000      3.64442    4.455159
    6164319  |   4.950098   1.063727     4.65   0.000     2.862269    7.037928
    6168006  |   2.690395   1.155852     2.33   0.020     .4217477    4.959042
    6168044  |     2.4709   .4775598     5.17   0.000      1.53357    3.408229
    6173241  |   1.833814   2.210545     0.83   0.407     -2.50493    6.172558
    6182262  |   4.798208   .8370604     5.73   0.000     3.155268    6.441147
    6212052  |   4.038395   1.384987     2.92   0.004     1.320013    6.756777
    6213178  |   5.356391   .5957098     8.99   0.000     4.187162    6.525619
    6214039  |   6.175976   .7299709     8.46   0.000     4.743226    7.608726
    6228226  |   .6354756   1.119787     0.57   0.571    -1.562385    2.833336
    6229506  |   5.982223   .0737412    81.12   0.000     5.837488    6.126958
    6243964  |   .4798613   .0835378     5.74   0.000     .3158976     .643825
    6249704  |   2.392874   1.161439     2.06   0.040     .1132608    4.672487
    6250416  |   3.927953   .2988583    13.14   0.000     3.341369    4.514537
    6256376  |   4.251605   1.043689     4.07   0.000     2.203105    6.300106
    6274713  |  -1.776374   .6320164    -2.81   0.005    -3.016864   -.5358846
    6278882  |   2.181567   .7531626     2.90   0.004     .7032979    3.659836
    6290294  |   2.131808   .4389297     4.86   0.000     1.270299    2.993317
    6306459  |   1.442219   1.011181     1.43   0.154    -.5424761    3.426914
    6315265  |   .4247924   .8277854     0.51   0.608    -1.199942    2.049527
    6326825  |   3.035978   .8877898     3.42   0.001     1.293469    4.778487
    6328787  |   3.914723   .2646555    14.79   0.000     3.395271    4.434175
    6340263  |   5.416796   1.385286     3.91   0.000     2.697827    8.135766
    6358969  |    2.28151   .6981673     3.27   0.001     .9111826    3.651837
    6364815  |   3.167876   .6863345     4.62   0.000     1.820774    4.514979
    6380402  |   6.280464   1.163401     5.40   0.000     3.997001    8.563927
    6404687  |   3.171216   .9400456     3.37   0.001     1.326143     5.01629
    6448896  |   .4485351   .4778726     0.94   0.348    -.4894088    1.386479
    6462827  |   2.437787   .5634305     4.33   0.000     1.331914     3.54366
    6470448  |   6.149914   .6218615     9.89   0.000     4.929356    7.370472
    6481665  |   6.247121   1.025088     6.09   0.000     4.235131    8.259111
    6487821  |   1.008493   .0352282    28.63   0.000     .9393485    1.077637
    6488612  |    4.67466   1.280362     3.65   0.000     2.161632    7.187688
    6540866  |   5.565212   1.274836     4.37   0.000     3.063029    8.067396
    6546397  |   3.757127   1.007469     3.73   0.000     1.779718    5.734535
    6563972  |   1.855716    .194011     9.57   0.000     1.474921    2.236511
    6568232  |  -2.364524   1.119787    -2.11   0.035    -4.562385   -.1666636
    6569047  |   3.775891   .4295343     8.79   0.000     2.932823    4.618958
    6576764  |   2.027433   .1137949    17.82   0.000     1.804082    2.250784
    6582813  |    5.94749   .9430198     6.31   0.000     4.096579    7.798401
    6614541  |   2.689157    1.79377     1.50   0.134    -.8315629    6.209877
    6631463  |   4.086828   .3601748    11.35   0.000     3.379896    4.793761
    6646017  |   4.444415   .2305719    19.28   0.000     3.991861     4.89697
    6649404  |   1.362986   .1875111     7.27   0.000     .9949487    1.731023
    6657681  |    4.68903   .0927654    50.55   0.000     4.506955    4.871105
    6668782  |   3.645079    .488897     7.46   0.000     2.685497    4.604661
    6678008  |  -1.701956   1.864537    -0.91   0.362    -5.361574    1.957662
    6712334  |   2.398612   .3723908     6.44   0.000     1.667703    3.129522
    6712438  |   5.839353   .6663846     8.76   0.000     4.531407    7.147299
    6726651  |   .5163147   1.210673     0.43   0.670    -1.859932    2.892562
    6752777  |   3.799673   .5517237     6.89   0.000     2.716777    4.882568
    6761847  |   2.745953   1.053818     2.61   0.009     .6775721    4.814334
    6785177  |   -3.80044   .8277991    -4.59   0.000    -5.425202   -2.175678
    6788936  |  -2.422358   .8841033    -2.74   0.006    -4.157631   -.6870852
    6792454  |  -.7911774   .5164849    -1.53   0.126    -1.804908    .2225527
    6800813  |   5.954868   .1872148    31.81   0.000     5.587412    6.322323
    6808982  |   5.345566   .8111903     6.59   0.000     3.753403    6.937729
    6823682  |   4.547001   .8769901     5.18   0.000      2.82569    6.268312
    6856024  |  -3.207491   2.399645    -1.34   0.182    -7.917391    1.502409
    6858945  |   2.594308   1.155566     2.25   0.025     .3262219    4.862394
    6862211  |   5.817537    .756878     7.69   0.000     4.331976    7.303099
    6877503  |   5.934713   .8945445     6.63   0.000     4.178946    7.690479
    6880503  |  -.5619239   1.293899    -0.43   0.664    -3.101524    1.977676
    6901658  |   2.093362   .3872755     5.41   0.000     1.333237    2.853486
    6926225  |   2.796134   .5370443     5.21   0.000     1.742051    3.850217
    6953631  |   2.974545    1.14262     2.60   0.009     .7318692    5.217222
    6964809  |   3.817537    .756878     5.04   0.000     2.331976    5.303099
    6968266  |   5.857717   .5902065     9.92   0.000      4.69929    7.016144
    6968899  |   4.231391   .9598406     4.41   0.000     2.347465    6.115318
    6971064  |   -.862303   .8115227    -1.06   0.288    -2.455118    .7305123
    6978536  |   4.631085   1.005289     4.61   0.000     2.657955    6.604216
    6997962  |   2.220485   .9145982     2.43   0.015     .4253581    4.015611
    7001269  |   5.776582   .9267661     6.23   0.000     3.957573    7.595591
    7011132  |   5.705794   1.220403     4.68   0.000     3.310449    8.101139
    7032521  |   5.608017   1.099475     5.10   0.000     3.450024    7.766011
    7046053  |   5.236737   .9820134     5.33   0.000     3.309291    7.164182
    7049469  |   2.887511    .363007     7.95   0.000      2.17502    3.600003
    7050208  |   4.044069   .6833059     5.92   0.000     2.702912    5.385227
    7068015  |   3.826465   .2569058    14.89   0.000     3.322223    4.330706
    7068539  |   5.893672   .7430391     7.93   0.000     4.435273    7.352071
    7082059  |   .5735831   .2653063     2.16   0.031     .0528535    1.094313
    7082529  |   5.348208   1.661135     3.22   0.001     2.087817      8.6086
    7085943  |   -.764633   .5856373    -1.31   0.192    -1.914092     .384826
    7094745  |   5.527137   .8039215     6.88   0.000     3.949241    7.105033
    7104006  |   3.394068    .617062     5.50   0.000     2.182931    4.605206
    7108788  |   5.545221   1.356933     4.09   0.000     2.881901     8.20854
    7129809  |     5.2911   1.892774     2.80   0.005      1.57606     9.00614
    7146557  |   3.983152   .0698884    56.99   0.000     3.845978    4.120325
    7153072  |   2.697128   .7189469     3.75   0.000     1.286016     4.10824
    7174723  |  -1.164322   .7010788    -1.66   0.097    -2.540364    .2117192
    7198907  |   4.776051   .4537376    10.53   0.000     3.885478    5.666624
    7199325  |  -1.827216   .7167304    -2.55   0.011    -3.233978   -.4204538
    7201337  |   6.220485   .9145982     6.80   0.000     4.425358    8.015611
    7205892  |   5.039791    .700401     7.20   0.000      3.66508    6.414503
    7209781  |   2.942445   1.621453     1.81   0.070     -.240061     6.12495
    7257946  |  -.7555545    1.01399    -0.75   0.456    -2.745763    1.234654
    7259099  |   2.581568   1.735707     1.49   0.137     -.825188    5.988325
    7268644  |   2.090781   1.170008     1.79   0.074    -.2056509    4.387213
    7292386  |   .9422192   1.011181     0.93   0.352    -1.042476    2.926914
    7305951  |   4.382331   2.562168     1.71   0.088    -.6465608    9.411223
    7312902  |   3.140622   .5833191     5.38   0.000     1.995713    4.285531
    7318261  |   6.072284   .2998431    20.25   0.000     5.483767    6.660801
    7321079  |  -1.891114   1.011181    -1.87   0.062     -3.87581     .093581
    7333313  |   4.468809   1.119787     3.99   0.000     2.270948     6.66667
    7364107  |   4.539728   .5265578     8.62   0.000     3.506228    5.573229
    7368906  |   3.472048   1.133039     3.06   0.002     1.248178    5.695918
    7370462  |   .8175373    .756878     1.08   0.280    -.6680242    2.303099
    7379312  |   1.142944   1.503398     0.76   0.447     -1.80785    4.093737
    7379888  |  -.1515706   1.309521    -0.12   0.908    -2.721832    2.418691
    7434197  |  -.6286442    1.54043    -0.41   0.683    -3.652122    2.394833
    7453285  |   2.026506   1.250976     1.62   0.106    -.4288455    4.481857
    7488267  |   5.501814   2.066539     2.66   0.008     1.445715    9.557912
    7499418  |   2.911112    1.01399     2.87   0.004     .9209041    4.901321
    7507104  |   1.945553   1.250976     1.56   0.120    -.5097981    4.400904
    7523946  |   2.652671    1.01399     2.62   0.009     .6624622    4.642879
    7550713  |    2.26421   1.095976     2.07   0.039     .1130834    4.415337
    7586827  |  -1.692348   1.825496    -0.93   0.354    -5.275338    1.890642
    7598476  |   2.812477   .7778692     3.62   0.000     1.285715    4.339239
    7608259  |   3.922118    .287319    13.65   0.000     3.358183    4.486053
    7624816  |   6.087092   .3612673    16.85   0.000     5.378015    6.796169
    7630224  |   2.979345   .0856815    34.77   0.000     2.811173    3.147516
    7630258  |   5.311624    .488897    10.86   0.000     4.352042    6.271206
    7642272  |   1.112961   1.027805     1.08   0.279    -.9043612    3.130284
    7665777  |   3.240582   .9979654     3.25   0.001     1.281827    5.199338
    7691774  |   3.962291   1.193452     3.32   0.001     1.619845    6.304737
    7697777  |   4.865621   .1863079    26.12   0.000     4.499946    5.231297
    7704309  |   4.245637   1.767038     2.40   0.016     .7773842     7.71389
    7746468  |   .4093991   .3758238     1.09   0.276    -.3282487    1.147047
    7798951  |   6.120321   .4991066    12.26   0.000       5.1407    7.099942
    7802026  |   5.379048   .1900788    28.30   0.000     5.005971    5.752125
    7806392  |   1.797778   .7634322     2.35   0.019     .2993527    3.296204
    7837542  |   4.078318   1.457605     2.80   0.005     1.217404    6.939231
    7843653  |   2.385617   .1976985    12.07   0.000     1.997585     2.77365
    7847177  |   .2053225   2.760361     0.07   0.941    -5.212573    5.623218
    7854277  |   .8909496   .4523548     1.97   0.049     .0030907    1.778808
    7900217  |    4.95981   2.397019     2.07   0.039     .2550637    9.664556
    7908379  |   3.180931   .5728693     5.55   0.000     2.056532    4.305329
    7916474  |   2.491786   .0340719    73.13   0.000     2.424912    2.558661
    7933843  |   4.435404   .9593092     4.62   0.000     2.552521    6.318287
    7941827  |   2.181787   .3189809     6.84   0.000     1.555708    2.807867
    7961017  |   2.953426   .8529201     3.46   0.001     1.279358    4.627494
    7966169  |   3.277885   .4220893     7.77   0.000      2.44943     4.10634
    7970249  |   6.078475   1.458238     4.17   0.000     3.216319    8.940631
    7977788  |   1.603702   1.802524     0.89   0.374      -1.9342    5.141604
    7985004  |   3.024485   .1015678    29.78   0.000     2.825133    3.223837
    7992281  |    5.70902    1.20702     4.73   0.000     3.339944    8.078097
    7999227  |   5.989216   1.104222     5.42   0.000     3.821905    8.156527
    8011163  |    .697071   1.232289     0.57   0.572    -1.721603    3.115745
    8013694  |   2.532397   2.441466     1.04   0.300    -2.259589    7.324382
    8020183  |   1.186909   .7753237     1.53   0.126    -.3348564    2.708675
    8029488  |   1.527789   .8066257     1.89   0.059    -.0554153    3.110992
    8040728  |   1.883049   .7712278     2.44   0.015     .3693223    3.396775
    8042032  |   2.098236   1.285875     1.63   0.103    -.4256145    4.622086
    8050174  |   2.797188    1.13401     2.47   0.014     .5714112    5.022966
    8050737  |    3.78378   .4161345     9.09   0.000     2.967012    4.600547
    8052448  |   3.151797   .5152584     6.12   0.000     2.140474     4.16312
    8053482  |   4.864512   .1867374    26.05   0.000     4.497993     5.23103
    8067421  |   1.453512   1.734556     0.84   0.402    -1.950987    4.858011
    8080506  |   .0521421   1.119787     0.05   0.963    -2.145719    2.250003
    8086625  |   6.129467   .5370443    11.41   0.000     5.075384     7.18355
    8102401  |   2.092864   .3004325     6.97   0.000     1.503191    2.682538
    8136376  |  -3.079099   .8427593    -3.65   0.000    -4.733224   -1.424974
    8153445  |   2.161041   1.224493     1.76   0.078     -.242332    4.564414
    8187087  |   5.917538   .3420642    17.30   0.000     5.246151    6.588924
    8199609  |     1.7937   .8557584     2.10   0.036      .114061    3.473339
    8201999  |   2.800195   .7731576     3.62   0.000      1.28268    4.317709
    8205626  |   3.171689   .3665101     8.65   0.000     2.452321    3.891056
    8215757  |   4.539085   .5292239     8.58   0.000     3.500352    5.577819
    8220359  |   .9021304   .4059752     2.22   0.027     .1053029    1.698958
    8231506  |   1.358495   .1043768    13.02   0.000      1.15363    1.563361
    8250273  |    2.42466   1.280362     1.89   0.059    -.0883684    4.937688
    8252983  |   4.399186   .8363545     5.26   0.000     2.757632     6.04074
    8258473  |   2.586365   .3331041     7.76   0.000     1.932565    3.240164
    8268443  |   4.956108   .1820681    27.22   0.000     4.598754    5.313462
    8270028  |   2.121816   .5053074     4.20   0.000     1.130024    3.113608
    8290753  |  -.5259556   1.158259    -0.45   0.650    -2.799328    1.747417
    8309948  |  -3.816922   .7594285    -5.03   0.000     -5.30749   -2.326355
    8311783  |   5.724161   1.144215     5.00   0.000     3.478355    7.969967
    8317488  |    3.89095   .4523548     8.60   0.000     3.003091    4.778808
    8318032  |   5.637605   1.503261     3.75   0.000     2.687081    8.588128
    8321388  |     3.3024   .4537343     7.28   0.000     2.411833    4.192966
    8325553  |   1.225116   .9338093     1.31   0.190    -.6077172    3.057949
    8358439  |   5.817537    .756878     7.69   0.000     4.331976    7.303099
    8381734  |   4.047694   .7630938     5.30   0.000     2.549933    5.545456
    8391073  |  -5.806196   .8039215    -7.22   0.000    -7.384092     -4.2283
    8393262  |    6.28505   1.182424     5.32   0.000     3.964249    8.605852
    8400856  |   4.495216   1.562666     2.88   0.004     1.428094    7.562338
    8413464  |   5.535547   .8388086     6.60   0.000     3.889176    7.181918
    8430567  |  -2.661349   .0220569  -120.66   0.000    -2.704641   -2.618057
    8436047  |   2.000827   1.539559     1.30   0.194     -1.02094    5.022594
    8438227  |   2.498153   .2614057     9.56   0.000     1.985079    3.011226
    8444801  |   5.582502   .9038245     6.18   0.000     3.808522    7.356483
    8463216  |  -.0366202   .1519052    -0.24   0.810    -.3347719    .2615315
    8464345  |   .6746599   1.280362     0.53   0.598    -1.838368    3.187688
    8478051  |   3.019296   .6494686     4.65   0.000     1.744552     4.29404
    8480747  |   1.416029   .7363083     1.92   0.055    -.0291591    2.861218
    8493522  |   2.194125   .8052565     2.72   0.007     .6136091    3.774642
    8495973  |   2.744445    1.01399     2.71   0.007     .7542372    4.734654
    8506984  |   3.958612   .5196711     7.62   0.000     2.938628    4.978596
    8507855  |    3.84124   .2190775    17.53   0.000     3.411246    4.271234
    8520153  |    1.90757   .3834105     4.98   0.000     1.155032    2.660109
    8528489  |   1.983446   .0686691    28.88   0.000     1.848665    2.118226
    8528813  |  -3.114524   1.119787    -2.78   0.006    -5.312385   -.9166636
    8567489  |    1.43029   .8055798     1.78   0.076    -.1508615    3.011441
    8577727  |   .8440501   1.156622     0.73   0.466    -1.426108    3.114208
    8590549  |   4.261283   1.083833     3.93   0.000     2.133991    6.388574
    8596973  |   4.135476   1.119787     3.69   0.000     1.937615    6.333336
    8613356  |   2.585463   .3545096     7.29   0.000     1.889649    3.281276
    8635439  |   2.597731   .2859533     9.08   0.000     2.036477    3.158986
    8657128  |    5.87484    .519178    11.32   0.000     4.855824    6.893856
    8668985  |   3.597921   1.667875     2.16   0.031      .324301     6.87154
    8677168  |   2.981335   .9364149     3.18   0.002     1.143388    4.819283
    8695906  |   2.402033   .5856373     4.10   0.000     1.252574    3.551493
    8720993  |   .2360375   1.532717     0.15   0.878      -2.7723    3.244375
    8742588  |   2.270137   1.644855     1.38   0.168    -.9582993    5.498574
    8793889  |   2.999274   .0030136   995.26   0.000     2.993359    3.005188
    8874916  |   4.192799   1.354853     3.09   0.002     1.533563    6.852035
    8876922  |   3.803157   .8165278     4.66   0.000     2.200518    5.405796
    8886067  |   1.872419   .5292239     3.54   0.000     .8336848    2.911152
    8887182  |   1.089348   .3706258     2.94   0.003     .3619024    1.816793
    8888311  |  -2.182167   1.318409    -1.66   0.098    -4.769874    .4055387
    8889878  |   2.031344   1.413978     1.44   0.151    -.7439407    4.806628
    8896452  |    1.09271   .9453026     1.16   0.248     -.762682    2.948101
    8897282  |   4.158653   2.107304     1.97   0.049     .0225455    8.294761
    8927236  |   5.225941   .9372303     5.58   0.000     3.386393    7.065489
    8928709  |  -1.019433    .080612   -12.65   0.000    -1.177654   -.8612123
    8929675  |  -.2611736   1.246332    -0.21   0.834     -2.70741    2.185063
    8930568  |   4.219655   .9111582     4.63   0.000     2.431281     6.00803
    8932689  |   4.315413   .3508749    12.30   0.000     3.626734    5.004093
    8939708  |   .9182721   1.043689     0.88   0.379    -1.130228    2.966773
    8968764  |   .2425501   .3717639     0.65   0.514     -.487129    .9722293
    8972811  |   2.411735   .3661342     6.59   0.000     1.693105    3.130365
    8983073  |   .5420453   .1744092     3.11   0.002     .1997238    .8843669
    8991685  |   6.164274    .681427     9.05   0.000     4.826803    7.501744
    8996971  |   1.885854   .3561314     5.30   0.000     1.186857     2.58485
    9038779  |   5.837853    .672608     8.68   0.000     4.517692    7.158013
    9045324  |   3.443287   1.015535     3.39   0.001     1.450047    5.436527
    9061466  |   3.977624   .0928198    42.85   0.000     3.795442    4.159806
    9090043  |  -.7599921   .3871243    -1.96   0.050     -1.51982   -.0001644
    9100651  |   6.218469    .906237     6.86   0.000     4.439753    7.997185
    9114227  |    3.42261   2.395085     1.43   0.153     -1.27834     8.12356
    9117489  |  -1.828789   .7102051    -2.58   0.010    -3.222743   -.4348344
    9119489  |   2.525788   .1904003    13.27   0.000      2.15208    2.899496
    9152213  |   5.135476   1.119787     4.59   0.000     2.937615    7.333336
    9163759  |  -2.146124   1.503233    -1.43   0.154    -5.096593    .8043447
    9189348  |   2.551802    .906237     2.82   0.005     .7730863    4.330518
    9191325  |   2.421717   .3247286     7.46   0.000     1.784356    3.059078
    9194011  |   2.687682   .7785272     3.45   0.001     1.159628    4.215735
    9197785  |   5.454125   1.732026     3.15   0.002     2.054594    8.853657
    9217812  |   1.662351   1.364809     1.22   0.224    -1.016425    4.341128
    9236225  |   5.964423   .1475772    40.42   0.000     5.674766     6.25408
    9238377  |   4.689305   .0939073    49.94   0.000     4.504989    4.873622
    9265581  |   3.121587   .0840263    37.15   0.000     2.956665     3.28651
    9292457  |   4.658453   .0340719   136.72   0.000     4.591579    4.725328
    9302524  |   4.104226   .4323441     9.49   0.000     3.255643    4.952809
    9307017  |   3.803055    .331525    11.47   0.000     3.152355    4.453756
    9336534  |   2.456535   .1802978    13.62   0.000     2.102656    2.810414
    9361445  |   2.918648   1.598387     1.83   0.068    -.2185844     6.05588
    9373106  |  -.7392127   1.081778    -0.68   0.495    -2.862472    1.384046
    9395545  |  -.9832612   .2077852    -4.73   0.000    -1.391091    -.575431
    9397184  |   2.008771   .0363843    55.21   0.000     1.937358    2.080184
    9403053  |   1.202214   .8388086     1.43   0.152    -.4441568    2.848585
    9427606  |    4.46898   .9504719     4.70   0.000     2.603443    6.334518
    9429663  |   5.485584   1.602346     3.42   0.001     2.340581    8.630586
    9465837  |   2.589348   .3706258     6.99   0.000     1.861902    3.316793
    9468728  |   2.244445    1.01399     2.21   0.027     .2542372    4.234654
    9477401  |   1.485367   .5856373     2.54   0.011     .3359079    2.634826
    9482942  |    1.72571   1.490202     1.16   0.247    -1.199183    4.650603
    9501995  |   2.107748   1.100576     1.92   0.056    -.0524058    4.267902
    9524142  |   .9837726   .0673134    14.61   0.000     .8516533    1.115892
    9531502  |   1.475899   .0999758    14.76   0.000     1.279671    1.672126
    9549168  |   4.124127   .5148952     8.01   0.000     3.113517    5.134737
    9566421  |    2.45804   .3726554     6.60   0.000     1.726611    3.189469
    9566464  |   3.532168    .186349    18.95   0.000     3.166411    3.897924
    9572523  |   3.214784   2.204062     1.46   0.145    -1.111235    7.540804
    9575801  |   .2340528     .97088     0.24   0.810    -1.671541    2.139646
    9581031  |   3.225911   1.299332     2.48   0.013     .6756491    5.776174
    9583499  |   2.275631   .6746909     3.37   0.001      .951382     3.59988
    9590009  |   3.926054   .3067361    12.80   0.000     3.324008      4.5281
    9618297  |   4.251605   1.043689     4.07   0.000     2.203105    6.300106
    9618903  |  -1.239161   .3827487    -3.24   0.001    -1.990401   -.4879213
    9625422  |   2.407446   1.075283     2.24   0.025     .2969355    4.517956
    9651841  |   2.482723   .5059558     4.91   0.000     1.489659    3.475787
    9663512  |   4.162821   .6753998     6.16   0.000      2.83718    5.488461
    9671015  |    2.02422    1.07377     1.89   0.060    -.0833217    4.131761
    9671063  |   2.848304   .7619225     3.74   0.000     1.352842    4.343767
    9694979  |   3.075612   1.918464     1.60   0.109    -.6898503    6.841075
    9717276  |   3.760389   .3823019     9.84   0.000     3.010027    4.510752
    9724622  |   4.309767   .4817817     8.95   0.000     3.364151    5.255384
    9740556  |  -4.189872   .7876116    -5.32   0.000    -5.735756   -2.643988
    9752131  |   3.108886   1.011181     3.07   0.002      1.12419    5.093581
    9754896  |   2.873622   .5242307     5.48   0.000     1.844689    3.902556
    9772919  |   2.675865   .7295111     3.67   0.000     1.244018    4.107713
    9784716  |   2.819655   1.191487     2.37   0.018      .481065    5.158245
    9802901  |   4.843257   .6123131     7.91   0.000      3.64144    6.045074
    9806675  |   4.121816   .5053074     8.16   0.000     3.130024    5.113608
    9811326  |   6.088474   .3670004    16.59   0.000     5.368144    6.808803
    9820038  |   1.919565   .8377873     2.29   0.022     .2751986    3.563931
    9823206  |   3.449336   1.609262     2.14   0.032     .2907579    6.607914
    9826437  |   2.086675   .3595397     5.80   0.000     1.380989    2.792361
    9837961  |  -.4838001   .0671993    -7.20   0.000    -.6156954   -.3519048
    9849331  |   2.045012   .1867156    10.95   0.000     1.678536    2.411488
    9871053  |   2.547846   1.875589     1.36   0.175    -1.133465    6.229158
    9873409  |   2.129467   .5370443     3.97   0.000     1.075384     3.18355
    9910104  |   4.107781   .9650372     4.26   0.000     2.213655    6.001906
    9914734  |   .3942246   .4387697     0.90   0.369    -.4669702    1.255419
    9915513  |  -1.998038   .0081382  -245.51   0.000    -2.014011   -1.982065
    9936357  |   3.905512    .391947     9.96   0.000     3.136219    4.674806
    9952575  |   3.572766   .5696702     6.27   0.000     2.454646    4.690885
    9982136  |   1.991894   .0336237    59.24   0.000     1.925899    2.057889
    9991292  |   4.863163   .8150911     5.97   0.000     3.263344    6.462982
             |
        term |
       2005  |   .1521504   .5861575     0.26   0.795    -.9983297    1.302631
             |
       _cons |   8.422844   2.394115     3.52   0.000     3.723797    13.12189
------------------------------------------------------------------------------

. outreg2 fpm using DiD_oppschool.doc, bdec(3) nocons tex(nopretty) replace
DiD_oppschool.tex
DiD_oppschool.doc
dir : seeout

. reg opp_college fpm i.cityr i.term, cluster(cityr)

Linear regression                               Number of obs     =      1,157
                                                F(1, 853)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.8019
                                                Root MSE          =      .3204

                                (Std. err. adjusted for 854 clusters in cityr)
------------------------------------------------------------------------------
             |               Robust
 opp_college | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         fpm |   .0044068   .0110535     0.40   0.690    -.0172884    .0261021
             |
       cityr |
       6592  |   .4112694   .0990634     4.15   0.000     .2168328    .6057061
      12775  |   .6492718   .0436309    14.88   0.000     .5636354    .7349083
      12821  |   .0203893   .0511418     0.40   0.690    -.0799892    .1207678
      13056  |  -.0207633   .0520798    -0.40   0.690    -.1229829    .0814563
      13552  |   .4787453   .0292167    16.39   0.000     .4214002    .5360905
      15152  |   .1392682   .0249617     5.58   0.000     .0902745    .1882618
      19861  |   .3597187   .1369724     2.63   0.009     .0908763    .6285612
      20959  |   1.038669   .0969923    10.71   0.000     .8482975    1.229041
      21741  |   .2957548   .1147652     2.58   0.010     .0704996      .52101
      33386  |   .6159218   .0508576    12.11   0.000     .5161012    .7157424
      37827  |   .3415232   .0205422    16.63   0.000     .3012039    .3818424
      44032  |   .2797729   .1318255     2.12   0.034     .0210326    .5385132
      44539  |   .3719723   .3211274     1.16   0.247    -.2583202    1.002265
      49422  |   .9985909   .0035344   282.53   0.000     .9916537    1.005528
      50674  |   .5252616   .1342019     3.91   0.000      .261857    .7886663
      57757  |  -.0195319   .2326633    -0.08   0.933    -.4761916    .4371278
      58365  |  -.0339982   .0300763    -1.13   0.259    -.0930304    .0250339
      58634  |   .7980977    .031912    25.01   0.000     .7354624    .8607329
      61129  |    .367424   .0855085     4.30   0.000     .1995924    .5352556
      73704  |   .0198231   .1208252     0.16   0.870    -.2173265    .2569726
      75344  |   .0106513   .0267163     0.40   0.690    -.0417861    .0630888
      75623  |   .5379689    .095236     5.65   0.000     .3510445    .7248933
      78102  |   .5112421   .0998653     5.12   0.000     .3152316    .7072527
      81099  |   .4954285   .0114664    43.21   0.000     .4729228    .5179343
      87651  |   .0518664   .1300947     0.40   0.690    -.2034768    .3072095
      88022  |   .4340273   .1001406     4.33   0.000     .2374765    .6305781
      88472  |   .8832788   .1635769     5.40   0.000     .5622184    1.204339
      95775  |   .0022823   .0057246     0.40   0.690    -.0089537    .0135183
      96659  |   .2277988   .0556866     4.09   0.000        .1185    .3370976
     102952  |   .6141103   .1318255     4.66   0.000       .35537    .8728506
     107506  |   .1869392    .093085     2.01   0.045     .0042367    .3696417
     108977  |   1.060269   .1511695     7.01   0.000     .7635608    1.356976
     109064  |  -.0377903   .0947882    -0.40   0.690    -.2238357     .148255
     117839  |   .8059348   .0249617    32.29   0.000     .7569412    .8549285
     129325  |   .9650588   .0876419    11.01   0.000     .7930398    1.137078
     130557  |   .9270593   .1829546     5.07   0.000     .5679653    1.286153
     133366  |   .1973723   .1476405     1.34   0.182    -.0924088    .4871534
     147659  |   .9565654     .04753    20.13   0.000     .8632758    1.049855
     152924  |   .8084509   .0624117    12.95   0.000     .6859525    .9309493
     155075  |   .6346063   .1986777     3.19   0.001     .2446518    1.024561
     156473  |  -.0591974   .0837897    -0.71   0.480    -.2236554    .1052607
     164878  |   .0270426     .06783     0.40   0.690    -.1060907    .1601758
     164885  |   .8450721    .101072     8.36   0.000     .6466933    1.043451
     170683  |   .6240031   .1723252     3.62   0.000      .285772    .9622341
     171814  |   .6620952   .0114664    57.74   0.000     .6395895     .684601
     177062  |   .8547008   .3644489     2.35   0.019     .1393791    1.570023
     191693  |   .4761433   .0264198    18.02   0.000     .4242879    .5279987
     196732  |   .0107102    .026864     0.40   0.690     -.042017    .0634374
     199222  |  -.0196934   .0493963    -0.40   0.690     -.116646    .0772592
     209431  |   .6360095   .1689897     3.76   0.000     .3043251    .9676939
     213299  |   .2575028   .1442324     1.79   0.075    -.0255892    .5405949
     228359  |   .4346748   .0095748    45.40   0.000     .4158818    .4534677
     229742  |   .9777729   .0557515    17.54   0.000     .8683467    1.087199
     229956  |   .5209315   .0525018     9.92   0.000     .4178836    .6239794
     232006  |   .9390213   .1529508     6.14   0.000     .6388172    1.239225
     244379  |  -.1138818   .2856459    -0.40   0.690    -.6745331    .4467694
     254252  |   .5053254   .0133576    37.83   0.000     .4791078     .531543
     256603  |   .0397578   .0997231     0.40   0.690    -.1559737    .2354893
     260258  |  -.0270817   .0679281    -0.40   0.690    -.1604075    .1062441
     264155  |  -.0148764   .0373139    -0.40   0.690    -.0881142    .0583615
     278747  |   .2697652   .1594459     1.69   0.091     -.043187    .5827174
     283027  |   1.021988   .0551517    18.53   0.000      .913739    1.130237
     284708  |   .4874725   .1167804     4.17   0.000     .2582619    .7166831
     288527  |   .5266869   .0777052     6.78   0.000     .3741711    .6792027
     297999  |   .0185635   .0465621     0.40   0.690    -.0728263    .1099532
     305204  |   .7820232   .1508987     5.18   0.000     .4858469    1.078199
     312801  |   .6003025    .166459     3.61   0.000     .2735854    .9270197
     327404  |   .4419607   .0810214     5.45   0.000     .2829361    .6009853
     343793  |   .4984707   .0693118     7.19   0.000      .362429    .6345123
     348159  |   .0117324   .0294281     0.40   0.690    -.0460275    .0694923
     353884  |    .337809   .0112262    30.09   0.000     .3157748    .3598432
     363522  |   -.022037   .0282467    -0.78   0.436    -.0774782    .0334042
     363604  |    .293905    .039334     7.47   0.000     .2167022    .3711078
     370683  |    .219988   .0752781     2.92   0.004      .072236      .36774
     378973  |   .6877439   .0534721    12.86   0.000     .5827917    .7926962
     382582  |    1.01045   .0262117    38.55   0.000     .9590032    1.061897
     383076  |  -.0598698   .0854012    -0.70   0.483    -.2274909    .1077513
     387105  |   .1212413   .0641267     1.89   0.059    -.0046234    .2471059
     392577  |   .4729199   .0852227     5.55   0.000     .3056492    .6401906
     395289  |   .1083612   .0816568     1.33   0.185    -.0519107    .2686331
     415021  |   .2705314    .122564     2.21   0.028      .029969    .5110937
     415177  |   1.059187   .1484569     7.13   0.000     .7678034    1.350571
     423866  |   1.005049   .0126649    79.36   0.000     .9801913    1.029907
     425348  |    .530732    .141953     3.74   0.000     .2521139    .8093501
     439007  |   .5669184   .1678491     3.38   0.001     .2374727    .8963641
     440577  |   .1548664   .0462188     3.35   0.001     .0641505    .2455823
     450281  |   .2412827   .0528922     4.56   0.000     .1374686    .3450968
     457092  |    .015755   .0395178     0.40   0.690    -.0618084    .0933185
     458642  |   .4982338   .1413226     3.53   0.000      .220853    .7756146
     470015  |   .0219622    .055087     0.40   0.690    -.0861598    .1300841
     481125  |   .5210314   .1237923     4.21   0.000     .2780582    .7640047
     488532  |   .2314141    .078795     2.94   0.003     .0767593     .386069
     495187  |   .5683202   .0396757    14.32   0.000     .4904468    .6461936
     502051  |  -.0065347   .0577765    -0.11   0.910    -.1199355     .106866
     507608  |    .539061   .1491638     3.61   0.000       .24629    .8318321
     519462  |    .453148   .1175173     3.86   0.000     .2224911    .6838049
     536295  |    .994355   .0141592    70.23   0.000      .966564    1.022146
     538912  |   .9930451   .0568278    17.47   0.000     .8815063    1.104584
     539921  |   1.042345   .1062128     9.81   0.000     .8338761    1.250814
     543451  |   .5567839    .142429     3.91   0.000     .2772314    .8363363
     546274  |   .4060232   .2357187     1.72   0.085    -.0566334    .8686799
     556475  |   .2586703    .093633     2.76   0.006     .0748923    .4424483
     562174  |   .0265522   .1373838     0.19   0.847    -.2430977    .2962021
     563191  |  -.0184714   .0463312    -0.40   0.690     -.109408    .0724652
     575238  |   1.017004   .0426504    23.85   0.000     .9332919    1.100716
     576968  |   .3652692   .1175173     3.11   0.002     .1346124    .5959261
     590259  |   .4515571   .0566387     7.97   0.000     .3403897    .5627246
     591172  |   .4419607   .0810214     5.45   0.000     .2829361    .6009853
     596965  |   .5236411   .1302103     4.02   0.000      .268071    .7792112
     608686  |   .0168818    .042344     0.40   0.690    -.0662288    .0999924
     609803  |   1.012442   .1754542     5.77   0.000     .6680694    1.356815
     619155  |   .3246122   .0218749    14.84   0.000     .2816772    .3675472
     623212  |   .9445178    .139164     6.79   0.000     .6713739    1.217662
     665845  |   .0204302   .1947461     0.10   0.916    -.3618075    .4026678
     670319  |  -.1377349   .3454757    -0.40   0.690    -.8158169    .5403471
     671747  |   .6188319   .0527405    11.73   0.000     .5153154    .7223483
     673036  |   1.038808   .0973397    10.67   0.000     .8477542    1.229861
     677981  |   .9869916   .0326285    30.25   0.000     .9229501    1.051033
     678929  |   .5201041   .0504263    10.31   0.000     .4211299    .6190782
     684334  |   .4119411   .3384096     1.22   0.224    -.2522721    1.076154
     685284  |   .9969356   .0657345    15.17   0.000     .8679154    1.125956
     703415  |   .1873105   .1572419     1.19   0.234    -.1213159    .4959369
     717892  |   .9671281   .0824515    11.73   0.000     .8052966     1.12896
     725017  |  -.0753641   .1890331    -0.40   0.690    -.4463887    .2956605
     725151  |   .8790983   .2360796     3.72   0.000     .4157334    1.342463
     731479  |   .2016527   .0583761     3.45   0.001     .0870752    .3162303
     736154  |   1.055058   .1381003     7.64   0.000     .7840018    1.326114
     739801  |   .7187174   .1305571     5.51   0.000     .4624666    .9749683
     747542  |   .4953598   .0620961     7.98   0.000     .3734807     .617239
     748655  |   .7181617   .1291632     5.56   0.000     .4646467    .9716767
     754021  |   .0072642   .1630458     0.04   0.964    -.3127537    .3272821
     757066  |   .9570779   .1076602     8.89   0.000      .745768    1.168388
     762126  |   .2957347   .1326901     2.23   0.026     .0352974     .556172
     763699  |  -.0280185   .0250241    -1.12   0.263    -.0771346    .0210977
     772987  |   .4609067   .0386882    11.91   0.000     .3849715    .5368419
     780635  |   .2045667   .1925698     1.06   0.288    -.1733995    .5825328
     785219  |   .4963213    .009227    53.79   0.000      .478211    .5144317
     792161  |   .3908362   .1442324     2.71   0.007     .1077441    .6739282
     793088  |   .6459034   .0520798    12.40   0.000     .5436838     .748123
     806057  |    .480875   .0479705    10.02   0.000     .3867211     .575029
     811473  |   .4829064   .0428752    11.26   0.000     .3987531    .5670597
     817727  |   .0177496   .3060459     0.06   0.954    -.5829417    .6184409
     847551  |   .2508437   .0748953     3.35   0.001      .103843    .3978443
     850272  |   .7152162   .2291356     3.12   0.002     .2654806    1.164952
     850863  |   .2000772   .0619714     3.23   0.001      .078443    .3217115
     854243  |   .4199564   .2007707     2.09   0.037      .025894    .8140188
     859017  |   .4030932   .1749762     2.30   0.021     .0596588    .7465276
     863916  |   .4737077   .0101956    46.46   0.000     .4536962    .4937192
     866571  |   .3932745   .0268242    14.66   0.000     .3406253    .4459236
     869899  |  -.0278243   .0249942    -1.11   0.266    -.0768817     .021233
     881398  |   .0187024   .1180763     0.16   0.874    -.2130518    .2504566
     886621  |   .9558086   .0491556    19.44   0.000     .8593285    1.052289
     890562  |   .4673888   .2133786     2.19   0.029     .0485803    .8861974
     907345  |   .0872233   .2187793     0.40   0.690    -.3421854    .5166321
     909157  |    .012451   .3192937     0.04   0.969    -.6142424    .6391444
     913997  |   .1732135   .0885109     1.96   0.051    -.0005112    .3469381
     918702  |   .0575028   .1442324     0.40   0.690    -.2255892    .3405949
     925841  |   .5164747   .1126212     4.59   0.000     .2954276    .7375218
     932078  |   .6702086   .0813076     8.24   0.000     .5106223     .829795
     934336  |   .4534193   .1168368     3.88   0.000      .224098    .6827406
     947974  |  -.0872113   .1523109    -0.57   0.567    -.3861594    .2117368
     949469  |   .9060232   .2357187     3.84   0.000     .4433666     1.36868
     956532  |   .4369142   .1582359     2.76   0.006     .1263369    .7474915
     961701  |  -.0181343   .0454858    -0.40   0.690    -.1074115    .0711428
     980049  |   .7123324   .1145416     6.22   0.000     .4875159    .9371488
     980341  |  -.0282833   .0827954    -0.34   0.733    -.1907899    .1342233
     988713  |   .6993287   .0636944    10.98   0.000     .5743125    .8243448
    1008754  |   .5257594   .1354287     3.88   0.000     .2599468     .791572
    1030024  |   .4954285   .0114664    43.21   0.000     .4729228    .5179343
    1039319  |   .3619647   .1425152     2.54   0.011     .0822432    .6416862
    1039659  |   .2666475   .1671697     1.60   0.111    -.0614646    .5947597
    1055878  |   .0295568   .0741363     0.40   0.690    -.1159542    .1750677
    1059019  |   1.066045   .1656588     6.44   0.000     .7408985    1.391192
    1087329  |   1.059187   .1484569     7.13   0.000     .7678034    1.350571
    1130445  |   .7732666   .0583589    13.25   0.000     .6587227    .8878105
    1162916  |   .2761727   .0789277     3.50   0.000     .1212574    .4310879
    1167111  |   .0151002    .109262     0.14   0.890    -.1993537    .2295542
    1176185  |   .3697647   .0913796     4.05   0.000     .1904096    .5491198
    1181891  |   .5059348   .0249617    20.27   0.000     .4569412    .5549285
    1194826  |   .5561953   .1749641     3.18   0.002     .2127846    .8996059
    1199583  |    1.04559   .1143517     9.14   0.000     .8211462    1.270034
    1201709  |   .0171203   .0429423     0.40   0.690    -.0671646    .1014052
    1201851  |   .8768886   .1789075     4.90   0.000     .5257381    1.228039
    1223136  |   .1584342   .0820821     1.93   0.054    -.0026724    .3195407
    1248461  |   .0612554   .1536449     0.40   0.690     -.240311    .3628219
    1248986  |   .3039587   .0810214     3.75   0.000     .1449341    .4629833
    1254046  |   .9222017    .129078     7.14   0.000     .6688539    1.175549
    1257101  |   .5299742   .0751832     7.05   0.000     .3824084    .6775399
    1271075  |     .01466   .1807947     0.08   0.935    -.3401946    .3695147
    1291848  |   .2618775   .1792303     1.46   0.144    -.0899065    .6136615
    1295732  |   .6534593   .1754373     3.72   0.000     .3091199    .9977986
    1318102  |   .0445462   .1117337     0.40   0.690     -.174759    .2638514
    1319847  |    .130276   .0337932     3.86   0.000     .0639485    .1966035
    1322312  |    .694313   .0693444    10.01   0.000     .5582074    .8304187
    1324196  |   1.030455   .0763905    13.49   0.000     .8805202    1.180391
    1324807  |   .5000983   .0763905     6.55   0.000      .350163    .6500337
    1338688  |   .6875982   .0525018    13.10   0.000     .5845503    .7906461
    1361637  |   .7234817   .1425072     5.08   0.000     .4437759    1.003187
    1383985  |   .9209715   .1982244     4.65   0.000     .5319067    1.310036
    1405824  |    .521018   .0527187     9.88   0.000     .4175444    .6244916
    1406858  |   .9760027   .0601917    16.21   0.000     .8578615    1.094144
    1423484  |   .4388978   .1909131     2.30   0.022     .0641834    .8136123
    1448419  |   .6876847   .0527187    13.04   0.000     .5842111    .7911583
    1456817  |   .7683283   .1171593     6.56   0.000      .538374    .9982825
    1495675  |   1.029974   .1458317     7.06   0.000     .7437427    1.316205
    1497624  |     .70428   .0943442     7.47   0.000      .519106     .889454
    1505078  |   .3127787   .0515565     6.07   0.000     .2115863    .4139711
    1515799  |   .0330797   .0829727     0.40   0.690    -.1297749    .1959343
    1531455  |   1.022035   .1262587     8.09   0.000     .7742208    1.269849
    1544863  |   .0441499   .1107396     0.40   0.690    -.1732041    .2615039
    1546908  |   .4810245   .1066827     4.51   0.000     .2716331    .6904159
    1557382  |   .5393255   .1689897     3.19   0.001     .2076411    .8710099
    1558752  |   .9887815   .0474535    20.84   0.000     .8956422    1.081921
    1565512  |  -.0753583    .123079    -0.61   0.541    -.3169314    .1662148
    1608972  |   .7444283   .0599639    12.41   0.000     .6267341    .8621224
    1664083  |   .5089883   .1671677     3.04   0.002     .1808801    .8370965
    1711041  |   .1878621   .0908571     2.07   0.039     .0095325    .3661917
    1720289  |   .5215687   .0585472     8.91   0.000     .4066551    .6364822
    1749253  |   .9282308   .1142783     8.12   0.000     .7039312     1.15253
    1751753  |   1.051392   .1289053     8.16   0.000     .7983834    1.304401
    1755893  |   1.039758   .0997231    10.43   0.000     .8440263    1.235489
    1790032  |   .6980808    .078795     8.86   0.000      .543426    .8527357
    1814259  |   .9212757   .0784117    11.75   0.000     .7673731    1.075178
    1843081  |   .3080057   .2055743     1.50   0.134    -.0954851    .7114965
    1885791  |     .94923   .1273447     7.45   0.000     .6992844    1.199176
    1886818  |   .2637599   .1745088     1.51   0.131     -.078757    .6062767
    1894847  |   .0040677   .1554326     0.03   0.979    -.3010074    .3091429
    1906642  |   1.004065   .0101956    98.48   0.000     .9840533    1.024076
    1937499  |   .4906112   .0514133     9.54   0.000     .3896998    .5915225
    1967571  |   .4670155    .082734     5.64   0.000     .3046294    .6294016
    1975711  |   .1425549   .1152648     1.24   0.217    -.0836809    .3687908
    1985698  |   .6977361   .0673877    10.35   0.000      .565471    .8300012
    1987777  |   .3913579   .0520798     7.51   0.000     .2891383    .4935775
    2003616  |   .7067883   .2337997     3.02   0.003     .2478983    1.165678
    2015211  |   .9853975   .0366271    26.90   0.000     .9135077    1.057287
    2017131  |   .5908453   .1901801     3.11   0.002     .2175696    .9641211
    2023111  |   .2553942    .195492     1.31   0.192    -.1283075     .639096
    2040526  |   .4391988   .0876381     5.01   0.000     .2671871    .6112104
    2080927  |   .4087176   .1623929     2.52   0.012     .0899811    .7274542
    2084795  |   .5918087   .1877637     3.15   0.002     .2232757    .9603417
    2115558  |   .5121752   .0305387    16.77   0.000     .4522354    .5721151
    2126494  |  -.0546317   .0499215    -1.09   0.274     -.152615    .0433516
    2154193  |   .4186447   .2040606     2.05   0.041     .0181249    .8191646
    2171355  |    .614073   .2735847     2.24   0.025     .0770949    1.151051
    2179278  |   1.037613   .0943442    11.00   0.000     .8524393    1.222787
    2183606  |   .0336598   .0844276     0.40   0.690    -.1320505      .19937
    2226268  |   .2781545   .0706189     3.94   0.000     .1395474    .4167615
    2239384  |   .4346748   .0095748    45.40   0.000     .4158818    .4534677
    2269545  |   .4236087   .1256172     3.37   0.001     .1770537    .6701638
    2292099  |  -.0165874   .1076625    -0.15   0.878    -.2279018     .194727
    2292127  |   .9912789   .0218749    45.32   0.000     .9483438    1.034214
    2297739  |    .328522   .0120681    27.22   0.000     .3048353    .3522087
    2301693  |   .0110617   .0277458     0.40   0.690    -.0433962    .0655197
    2317972  |   .4626287   .1321299     3.50   0.000     .2032909    .7219666
    2332463  |   .7326052   .0436309    16.79   0.000     .6469687    .8182416
    2333801  |   .5229428   .0575466     9.09   0.000     .4099932    .6358923
    2336156  |   .0090155   .0944677     0.10   0.924     -.176401    .1944319
    2349525  |   .5874797   .0827516     7.10   0.000      .425059    .7499004
    2354606  |   .6652206   .0036273   183.39   0.000     .6581011      .67234
    2364826  |   .5396074    .169689     3.18   0.002     .2065504    .8726644
    2394661  |   .3760099   .3110001     1.21   0.227    -.2344053    .9864251
    2407414  |   .6635595   .0656352    10.11   0.000     .5347341     .792385
    2408207  |  -.0451195   .0511745    -0.88   0.378    -.1455622    .0553233
    2414295  |  -.0233967   .0586852    -0.40   0.690     -.138581    .0917876
    2473356  |   .3291651   .0631819     5.21   0.000     .2051549    .4531754
    2482873  |   .3821149   .2285571     1.67   0.095    -.0664853     .830715
    2511014  |   .5417278   .1046644     5.18   0.000     .3362979    .7471577
    2516819  |    .051408   .1990138     0.26   0.796    -.3392061    .4420222
    2522458  |   .4355767   .2910357     1.50   0.135    -.1356533    1.006807
    2528294  |   .4949798   .0612245     8.08   0.000     .3748114    .6151482
    2538967  |   .1394097   .1075764     1.30   0.195    -.0717358    .3505551
    2542784  |   .4864517   .0339828    14.31   0.000      .419752    .5531514
    2573218  |   .2387887   .0474689     5.03   0.000     .1456192    .3319582
    2575363  |   .5441499   .1107396     4.91   0.000     .3267959    .7615039
    2578377  |   .4826052   .0436309    11.06   0.000     .3969687    .5682416
    2579974  |   .9601717   .0621946    15.44   0.000     .8380994    1.082244
    2592513  |   .7849604     .08769     8.95   0.000     .6128469    .9570739
    2598595  |  -.0436119   .1093901    -0.40   0.690    -.2583172    .1710935
    2607525  |   .0417329   .1749641     0.24   0.812    -.3016778    .3851435
    2613241  |   1.054267   .1361165     7.75   0.000     .7871047     1.32143
    2627096  |  -.0168415    .036226    -0.46   0.642    -.0879441    .0542611
    2630885  |   .6927123   .0503688    13.75   0.000     .5938509    .7915736
    2635699  |   .0474992   .1892908     0.25   0.802    -.3240311    .4190294
    2636295  |   .2512197   .0757851     3.31   0.001     .1024725    .3999668
    2663167  |   .2893255   .1689897     1.71   0.087    -.0423589    .6210099
    2671285  |   .3916305   .1437703     2.72   0.007     .1094456    .6738155
    2675112  |   .7412789   .0218749    33.89   0.000     .6983438    .7842139
    2678974  |   1.057503   .1442324     7.33   0.000     .7744108    1.340595
    2701443  |   .3415872   .2650899     1.29   0.198    -.1787177    .8618921
    2712596  |   1.008552    .166123     6.07   0.000      .682494    1.334609
    2723052  |   .9899865   .0500493    19.78   0.000     .8917522    1.088221
    2735706  |   .9382452   .1548974     6.06   0.000     .6342206     1.24227
    2736654  |   .9305256   .0622968    14.94   0.000     .8082527    1.052798
    2749057  |    .226826   .1393996     1.63   0.104    -.0467803    .5004324
    2759143  |  -.1235638   .1799975    -0.69   0.493    -.4768536    .2297261
    2768228  |   .7096438   .1780536     3.99   0.000     .3601693    1.059118
    2803748  |    .223968   .0251653     8.90   0.000     .1745749    .2733611
    2812269  |   -.088142   .2210837    -0.40   0.690    -.5220737    .3457897
    2816213  |     .25717   .1910378     1.35   0.179    -.1177893    .6321293
    2825324  |   .0747663   .1875337     0.40   0.690    -.2933153    .4428479
    2833509  |   .0359612   .0902002     0.40   0.690    -.1410791    .2130014
    2845277  |  -.0387935   .0381168    -1.02   0.309    -.1136072    .0360202
    2846647  |   .3952936   .1554128     2.54   0.011     .0902573    .7003298
    2847759  |   .3306488   .0067337    49.10   0.000     .3174323    .3438653
    2856376  |   .3020982   .1593362     1.90   0.058    -.0106388    .6148352
    2884209  |   .3714799   .0956817     3.88   0.000     .1836807     .559279
    2903939  |   .0361048   .0905604     0.40   0.690    -.1416426    .2138521
    2908949  |   .5016692   .0768505     6.53   0.000     .3508309    .6525075
    2914645  |   .5659758   .1654849     3.42   0.001     .2411705    .8907811
    2924076  |   .8292091   .4283889     1.94   0.053    -.0116108    1.670029
    2943741  |   .3060987   .0683117     4.48   0.000       .17202    .4401774
    2946145  |   1.051149   .1282961     8.19   0.000     .7993362    1.302962
    2950071  |   .5440037    .110373     4.93   0.000     .3273692    .7606382
    2971536  |  -.0802763   .0814513    -0.99   0.325    -.2401447    .0795922
    2975277  |   .3203719   .1997285     1.60   0.109    -.0716451    .7123888
    2977764  |  -.0130484   .0436168    -0.30   0.765    -.0986572    .0725605
    2996626  |   .0565941    .141953     0.40   0.690     -.222024    .3352122
    3000408  |   .6011909   .1642308     3.66   0.000     .2788471    .9235346
    3020968  |   .4534456   .0538623     8.42   0.000     .3477273    .5591638
    3030646  |   .0099557   .0967442     0.10   0.918     -.179929    .1998403
    3035049  |   .4777988   .0556866     8.58   0.000        .3685    .5870976
    3038093  |   .5309364    .148211     3.58   0.000     .2400355    .8218373
    3044834  |   .3690493   .0265799    13.88   0.000     .3168795     .421219
    3096085  |    .556815   .1425072     3.91   0.000     .2771092    .8365208
    3139171  |   .3076805    .064344     4.78   0.000     .1813894    .4339717
    3149161  |   .4273633   .1164026     3.67   0.000     .1988942    .6558324
    3161335  |   .7256623   .0610454    11.89   0.000     .6058455    .8454791
    3163095  |  -.0446228   .1119259    -0.40   0.690    -.2643052    .1750596
    3206911  |   .6665699   .0002429  2744.50   0.000     .6660932    .6670466
    3223834  |   .4318054   .0604312     7.15   0.000     .3131941    .5504167
    3234644  |   .9677494    .080893    11.96   0.000     .8089769    1.126522
    3253229  |  -.0256528    .064344    -0.40   0.690     -.151944    .1006384
    3260366  |   .2899846   .1706249     1.70   0.090    -.0449093    .6248785
    3305893  |   .9428314     .05033    18.73   0.000     .8440463    1.041616
    3333764  |  -.0353595   .0886912    -0.40   0.690     -.209438    .1387189
    3338092  |   .8455585   .2553139     3.31   0.001     .3444413    1.346676
    3353152  |   .0048282   .0121103     0.40   0.690    -.0189413    .0285976
    3366959  |   .1809835   .0476985     3.79   0.000     .0873632    .2746037
    3376617  |   .0282264   .1415154     0.20   0.842    -.2495327    .3059856
    3384359  |   .4034879   .2420781     1.67   0.096    -.0716507    .8786265
    3400743  |   .5670546   .1681909     3.37   0.001     .2369382    .8971711
    3405796  |   .7049195   .2548242     2.77   0.006     .2047636    1.205075
    3422779  |   .2766336   .0778319     3.55   0.000     .1238692     .429398
    3430952  |   .4870926   .0439073    11.09   0.000     .4009136    .5732717
    3452869  |   .9211708   .1977246     4.66   0.000     .5330869    1.309255
    3457772  |   1.038518   .0966124    10.75   0.000     .8488917    1.228144
    3458363  |  -.0181343   .0454858    -0.40   0.690    -.1074115    .0711428
    3461217  |   .4476864   .0675036     6.63   0.000     .3151939    .5801789
    3468056  |   .3519404   .0385144     9.14   0.000     .2763463    .4275345
    3474282  |    .879809    .301471     2.92   0.004     .2880972    1.471521
    3508748  |   .4575343   .0710237     6.44   0.000     .3181326     .596936
    3542841  |   .7023799   .2320073     3.03   0.003     .2470078    1.157752
    3558621  |   1.050414   .1264514     8.31   0.000     .8022215    1.298606
    3564317  |   .0314235   .0788184     0.40   0.690    -.1232773    .1861243
    3583048  |   .9174049   .2071705     4.43   0.000     .5107813    1.324029
    3585916  |   .4278588   .1160805     3.69   0.000      .200022    .6556956
    3597995  |   .4435354    .078795     5.63   0.000     .2888805    .5981902
    3607746  |   .8715862   .2548242     3.42   0.001     .3714303    1.371742
    3627494  |   1.045299    .183822     5.69   0.000     .6845027    1.406095
    3643244  |   .4508638    .055671     8.10   0.000     .3415955    .5601321
    3667127  |    .893317   .2006507     4.45   0.000     .4994899    1.287144
    3668458  |   .9645187   .0889965    10.84   0.000      .789841    1.139196
    3668955  |   .5065468   .0885109     5.72   0.000     .3328222    .6802714
    3678184  |   .4869251   .0327952    14.85   0.000     .4225563     .551294
    3693873  |    .521018   .0527187     9.88   0.000     .4175444    .6244916
    3700628  |   .4382913   .0259549    16.89   0.000     .3873483    .4892342
    3709269  |   .3020138   .0809465     3.73   0.000     .1431362    .4608914
    3718783  |   .2800357   .1336847     2.09   0.036     .0176462    .5424251
    3730865  |   .1051867   .0892715     1.18   0.239    -.0700309    .2804042
    3736008  |   .0365397   .0916514     0.40   0.690     -.143349    .2164284
    3743843  |    .356148   .0490683     7.26   0.000     .2598393    .4524567
    3789776  |   .4743472    .064344     7.37   0.000      .348056    .6006384
    3800315  |   .4731056   .0674582     7.01   0.000     .3407021    .6055092
    3806686  |   .0169116   .1136899     0.15   0.882    -.2062332    .2400563
    3813116  |  -.0525564   .1318255    -0.40   0.690    -.3112967    .2061839
    3824554  |    .015753   .0395128     0.40   0.690    -.0618007    .0933067
    3834836  |  -.0154632   .1101685    -0.14   0.888    -.2316963    .2007698
    3836655  |   .8192771   .3856125     2.12   0.034     .0624166    1.576138
    3849661  |   .9980591   .0048683   205.01   0.000      .988504    1.007614
    3875108  |  -.0523474   .0675822    -0.77   0.439    -.1849943    .0802996
    3891804  |   .2315848   .0461902     5.01   0.000     .1409251    .3222445
    3904936  |    .665007    .004163   159.74   0.000     .6568361    .6731778
    3922227  |   .6560232   .2357187     2.78   0.006     .1933666     1.11868
    3929234  |   .0286879   .0719569     0.40   0.690    -.1125454    .1699212
    3931245  |   .3087387   .0640786     4.82   0.000     .1829685    .4345089
    3947017  |    .024697   .1328106     0.19   0.853    -.2359769    .2853709
    3963974  |  -.0074973   .0556089    -0.13   0.893    -.1166436    .1016491
    3975708  |   1.069142   .1734271     6.16   0.000     .7287484    1.409536
    3984153  |   1.042532   .1066827     9.77   0.000     .8331411    1.251924
    3989111  |   .4747745   .0255017    18.62   0.000      .424721     .524828
    4005831  |   .5270999   .0679737     7.75   0.000     .3936845    .6605153
    4043837  |   .6787321   .1787589     3.80   0.000     .3278731    1.029591
    4050403  |    .282662   .0636944     4.44   0.000     .1576458    .4076782
    4053238  |   .5383016   .0960705     5.60   0.000     .3497393    .7268638
    4064468  |  -.0152789   .1105809    -0.14   0.890    -.2323215    .2017637
    4073621  |   .3502863   .1137911     3.08   0.002     .1269429    .5736297
    4119215  |   .9818657   .0454858    21.59   0.000     .8925885    1.071143
    4127444  |    .400388   .1681909     2.38   0.018     .0702715    .7305044
    4140647  |   .5656771   .1203975     4.70   0.000     .3293669    .8019872
    4188128  |   .6949708   .0709941     9.79   0.000     .5556271    .8343144
    4188564  |   .7742712    .083466     9.28   0.000     .6104483     .938094
    4217726  |   .3279331     .03017    10.87   0.000      .268717    .3871491
    4236089  |   .4449037   .1381962     3.22   0.001     .1736591    .7161482
    4238931  |   .1725618   .1894465     0.91   0.363    -.1992741    .5443977
    4250907  |   .9667824   .0833186    11.60   0.000     .8032488    1.130316
    4259748  |  -.0270185   .0249713    -1.08   0.280    -.0760309     .021994
    4261254  |  -.0285992   .0251697    -1.14   0.256    -.0780011    .0208027
    4274855  |   .9639966   .0903061    10.67   0.000     .7867484    1.141245
    4309558  |   .2542711   .1983092     1.28   0.200    -.1349601    .6435022
    4312463  |   .0286557   .0718762     0.40   0.690    -.1124191    .1697306
    4315841  |   .9619069   .0648846    14.82   0.000     .8345548    1.089259
    4315909  |   .4874629   .0446744    10.91   0.000     .3997782    .5751475
    4353246  |   .3120971   .1953918     1.60   0.111     -.071408    .6956023
    4374839  |   .4837837   .0406747    11.89   0.000     .4039495    .5636179
    4383846  |    .299798   .2260229     1.33   0.185    -.1438282    .7434242
    4387728  |   .2079953   .1739606     1.20   0.232    -.1334457    .5494364
    4388653  |   .2910002   .1028393     2.83   0.005     .0891524    .4928479
    4397326  |   .5777616   .0599639     9.64   0.000     .4600674    .6954557
    4399293  |   .6506394   .0801977     8.11   0.000     .4932314    .8080475
    4418283  |   .6980959   .0788327     8.86   0.000      .543367    .8528248
    4439956  |   .3514727   .2407833     1.46   0.145    -.1211245    .8240699
    4451086  |   .4310349   .1074256     4.01   0.000     .2201853    .6418845
    4462565  |    .482844   .0385845    12.51   0.000     .4071122    .5585757
    4498129  |   .0591925   .0997392     0.59   0.553    -.1365705    .2549555
    4509152  |   .0058811   .0869102     0.07   0.946    -.1647018     .176464
    4527045  |   .3890144   .1372741     2.83   0.005     .1195799    .6584489
    4560376  |   .1474436   .1318255     1.12   0.264    -.1112967    .4061839
    4572636  |   -.000287   .1451307    -0.00   0.998    -.2851422    .2845682
    4589088  |  -.0056313   .0141248    -0.40   0.690    -.0333548    .0220922
    4591298  |   .2767692   .1379192     2.01   0.045     .0060685      .54747
    4591884  |   .9435195    .141668     6.66   0.000     .6654608    1.221578
    4598257  |   .4506236   .1556843     2.89   0.004     .1450544    .7561929
    4629146  |   .5298265   .1454676     3.64   0.000     .2443102    .8153428
    4667466  |   .7179626   .0276355    25.98   0.000     .6637211    .7722041
    4699777  |  -.0382179    .064685    -0.59   0.555    -.1651783    .0887424
    4700313  |   .1092109   .0949407     1.15   0.250    -.0771338    .2955557
    4716293  |  -.0212237   .0975083    -0.22   0.828     -.212608    .1701605
    4718887  |   .2434247   .0576848     4.22   0.000      .130204    .3566455
    4723808  |   .8590021   .2862534     3.00   0.003     .2971585    1.420846
    4725006  |   .6485141   .1877233     3.45   0.001     .2800604    1.016968
    4726189  |   .4425737   .0943378     4.69   0.000     .2574122    .6277352
    4744655  |   .0384875   .1669111     0.23   0.818    -.2891172    .3660922
    4766011  |   .2479193   .2142412     1.16   0.248    -.1725825     .668421
    4773504  |   .4973536   .0066379    74.93   0.000     .4843251    .5103821
    4797843  |  -.0707612   .1774878    -0.40   0.690    -.4191253    .2776029
    4813232  |   .5314141    .078795     6.74   0.000     .3767593     .686069
    4831062  |   .6459034   .0520798    12.40   0.000     .5436838     .748123
    4835757  |   .6756424   .0225134    30.01   0.000     .6314543    .7198305
    4851781  |   .5212451   .0532883     9.78   0.000     .4166535    .6258367
    4862495  |  -.0193983    .048656    -0.40   0.690    -.1148979    .0761013
    4865071  |   .6122648   .1364545     4.49   0.000     .3444389    .8800906
    4875878  |   .9283621   .1796868     5.17   0.000      .575682    1.281042
    4893515  |   -.067542   .0595241    -1.13   0.257    -.1843729    .0492889
    4930473  |  -.0094634   .0512498    -0.18   0.854     -.110054    .0911272
    4959708  |   .6937666   .0679737    10.21   0.000     .5603512     .827182
    4965883  |   .9753037   .0901365    10.82   0.000     .7983883    1.152219
    4969979  |  -.0916913   .1055442    -0.87   0.385    -.2988481    .1154655
    4974831  |    .441937    .081078     5.45   0.000     .2828012    .6010728
    4976366  |   .8762639   .1779379     4.92   0.000     .5270164    1.225511
    4979298  |   .0333162   .0835658     0.40   0.690    -.1307026    .1973349
    4998571  |   .3874147   .1537307     2.52   0.012     .0856799    .6891494
    5003933  |   1.027729    .140287     7.33   0.000     .7523806    1.303077
    5005547  |   .9549561   .1129821     8.45   0.000     .7332006    1.176712
    5026681  |   .6601772   .0162775    40.56   0.000     .6282286    .6921257
    5038976  |   .0262184   .0657628     0.40   0.690    -.1028575    .1552944
    5051531  |   .4846171   .0385845    12.56   0.000     .4088853    .5603488
    5059593  |   .0343488   .1566546     0.22   0.826    -.2731248    .3418223
    5065196  |  -.1293083    .257057    -0.50   0.615    -.6338467    .3752301
    5069683  |   .3159385   .0436309     7.24   0.000      .230302     .401575
    5082101  |   .5593377   .1488347     3.76   0.000     .2672125    .8514629
    5084474  |   .5913287   .1739606     3.40   0.001     .2498876    .9327697
    5095951  |   .0329795   .0827214     0.40   0.690    -.1293819    .1953409
    5115496  |  -.0207633   .0520798    -0.40   0.690    -.1229829    .0814563
    5136264  |   .5870177   .1336353     4.39   0.000     .3247252    .8493102
    5140467  |   .9346367   .1639485     5.70   0.000      .612847    1.256426
    5146939  |    .955518   .1115728     8.56   0.000     .7365287    1.174507
    5151535  |   .4255225   .0940816     4.52   0.000     .2408639     .610181
    5154684  |    .238455   .0696016     3.43   0.001     .1018446    .3750653
    5193768  |    .329516   .0095748    34.41   0.000     .3107231     .348309
    5217423  |   .0088568   .0222152     0.40   0.690    -.0347461    .0524596
    5217851  |   .4285968   .0653059     6.56   0.000     .3004178    .5567759
    5224364  |   .0071383   .1627451     0.04   0.965    -.3122894     .326566
    5254931  |   .5415486   .3138295     1.73   0.085    -.0744199    1.157517
    5277639  |   .6747991   .0203984    33.08   0.000     .6347623     .714836
    5317397  |   -.084094   .2109301    -0.40   0.690    -.4980969    .3299089
    5374028  |   1.046579   .1870032     5.60   0.000     .6795386    1.413619
    5383253  |   .5255301   .1289053     4.08   0.000     .2725213     .778539
    5391432  |   .7862199   .1612895     4.87   0.000      .469649    1.102791
    5419808  |   .2066742   .0472979     4.37   0.000     .1138402    .2995082
    5444967  |   .2228633   .0249645     8.93   0.000     .1738644    .2718623
    5452945  |  -.0811723   .0832386    -0.98   0.330    -.2445488    .0822042
    5459046  |   .2515632   .1388656     1.81   0.070    -.0209951    .5241216
    5486605  |   1.007052   .0176893    56.93   0.000     .9723328    1.041772
    5495472  |   .5125928    .031586    16.23   0.000     .4505973    .5745882
    5507221  |   .9909924   .0225936    43.86   0.000     .9466468    1.035338
    5518116  |   .4874725   .1167804     4.17   0.000     .2582619    .7166831
    5526079  |   .4846171   .0385845    12.56   0.000     .4088853    .5603488
    5546165  |   .7214008   .0251697    28.66   0.000     .6719989    .7708027
    5594303  |   .9951886   .0120681    82.46   0.000     .9715019    1.018875
    5615298  |  -.0678608   .1702128    -0.40   0.690    -.4019458    .2662243
    5625605  |   .0222848   .0558961     0.40   0.690    -.0874253    .1319948
    5626832  |   .5304555   .0763905     6.94   0.000     .3805202    .6803908
    5627056  |   .0457514   .2361133     0.19   0.846    -.4176797    .5091826
    5628024  |   1.010651   .0267163    37.83   0.000     .9582139    1.063089
    5642885  |   .0046674   .0117071     0.40   0.690    -.0183106    .0276454
    5653864  |   .7219815   .0250241    28.85   0.000     .6728654    .7710977
    5654561  |   .4360109   .1605017     2.72   0.007     .1209863    .7510355
    5674641  |   .4256844    .120519     3.53   0.000     .1891359     .662233
    5675929  |   .5555081   .1392291     3.99   0.000     .2822363    .8287799
    5692778  |   .5454664    .055087     9.90   0.000     .4373445    .6535884
    5702683  |  -.0560844   .0763714    -0.73   0.463    -.2059823    .0938135
    5708259  |   .5502573   .2919857     1.88   0.060    -.0228373    1.123352
    5712945  |   .9009192   .1221895     7.37   0.000      .661092    1.140746
    5752515  |   1.005353   .0134275    74.87   0.000     .9789985    1.031708
    5773139  |   .0170039   .0426504     0.40   0.690    -.0667081     .100716
    5785051  |   .5696347   .1793948     3.18   0.002     .2175277    .9217417
    5797533  |   .3319368   .0035028    94.76   0.000     .3250616     .338812
    5817208  |   .7600728   .2211836     3.44   0.001     .3259448    1.194201
    5833449  |   .0429862   .1240011     0.35   0.729    -.2003968    .2863693
    5839623  |   .0284204    .071286     0.40   0.690    -.1114961     .168337
    5843135  |   .0233417   .0585472     0.40   0.690    -.0915718    .1382553
    5843198  |   .3097686   .0266688    11.62   0.000     .2574245    .3621128
    5897528  |   -.015639   .1097757    -0.14   0.887    -.2311011    .1998231
    5911188  |   .3489648   .1831378     1.91   0.057    -.0104887    .7084183
    5944107  |   .5538065   .1224211     4.52   0.000     .3135246    .7940884
    5947771  |   1.042806   .1073687     9.71   0.000     .8320682    1.253544
    5969973  |  -.1244943   .1822409    -0.68   0.495    -.4821875    .2331989
    5981056  |   .6324124   .0859188     7.36   0.000     .4637755    .8010494
    5989709  |   .4402841   .1301521     3.38   0.001     .1848283      .69574
    5991507  |   .8832788   .1635769     5.40   0.000     .5622184    1.204339
    5993311  |   1.007282   .0182656    55.15   0.000     .9714313    1.043133
    6005256  |   .0354315   .1593362     0.22   0.824    -.2773055    .3481685
    6019378  |  -.0093754    .023516    -0.40   0.690    -.0555315    .0367807
    6033986  |  -.0489724   .1228359    -0.40   0.690    -.2900684    .1921236
    6053151  |   .4394577   .1518562     2.89   0.004      .141402    .7375133
    6057107  |  -.0135401   .0339621    -0.40   0.690    -.0801993    .0531191
    6076454  |   .5565941    .141953     3.92   0.000      .277976    .8352122
    6095741  |   1.054267   .1361165     7.75   0.000     .7871047     1.32143
    6112571  |   .6337948   .0824515     7.69   0.000     .4719633    .7956263
    6122988  |  -.1308098   .1975239    -0.66   0.508    -.5184996    .2568799
    6123077  |   .9948743   .0128567    77.38   0.000     .9696398    1.020109
    6138666  |    .539011   .0470516    11.46   0.000     .4466605    .6313615
    6146315  |   .5117123   .0293775    17.42   0.000     .4540516     .569373
    6164319  |   .7473944   .1491638     5.01   0.000     .4546233    1.040165
    6168006  |    .400655   .1671677     2.40   0.017     .0725468    .7287632
    6168044  |   .4611725   .0691677     6.67   0.000     .3254136    .5969314
    6173241  |   .3113059   .3123973     1.00   0.319    -.3018516    .9244634
    6182262  |   .4525308   .1190655     3.80   0.000     .2188351    .6862264
    6212052  |   .5622921   .1949067     2.88   0.004     .1797391    .9448451
    6213178  |   .7162176   .0847352     8.45   0.000     .5499037    .8825315
    6214039  |   1.041396   .1038328    10.03   0.000     .8375985    1.245194
    6228226  |   .0360814   .1609465     0.22   0.823    -.2798161     .351979
    6229506  |   .9958182   .0104891    94.94   0.000     .9752307    1.016406
    6243964  |  -.0047374   .0118826    -0.40   0.690      -.02806    .0185852
    6249704  |   .4417742   .1630789     2.71   0.007     .1216913    .7618572
    6250416  |   .4830519   .0425103    11.36   0.000     .3996148     .566489
    6256376  |   .5591871   .1484569     3.77   0.000     .2678034    .8505707
    6274713  |  -.0608012   .0876381    -0.69   0.488    -.2328129    .1112104
    6278882  |   .0427114   .1071317     0.40   0.690    -.1675611     .252984
    6290294  |    .412679   .0635981     6.49   0.000     .2878518    .5375062
    6306459  |   .0298265   .1454676     0.21   0.838    -.2556898    .3153428
    6315265  |  -.0722887   .1155502    -0.63   0.532    -.2990847    .1545073
    6326825  |   .4496539   .1262814     3.56   0.000     .2017953    .6975125
    6328787  |   .4841521    .038071    12.72   0.000     .4094283    .5588759
    6340263  |   .8712333   .1925698     4.52   0.000     .4932671    1.249199
    6358969  |   .2616247   .1007947     2.60   0.010       .06379    .4594595
    6364815  |   .2944117   .0976259     3.02   0.003     .1027966    .4860268
    6380402  |   1.065976   .1654849     6.44   0.000     .7411705    1.390781
    6404687  |   .3821118   .1315461     2.90   0.004     .1239199    .6403038
    6448896  |   .3604332   .0679737     5.30   0.000     .2270178    .4938486
    6462827  |   .3656228   .0815054     4.49   0.000     .2056482    .5255974
    6470448  |   1.035265   .0884551    11.70   0.000     .8616503    1.208881
    6481665  |   1.058132    .145811     7.26   0.000     .7719419    1.344322
    6487821  |   .5019978   .0050109   100.18   0.000     .4921626     .511833
    6488612  |   .7952991    .183822     4.33   0.000     .4345027    1.156095
    6540866  |   .9019339   .1792251     5.03   0.000       .55016    1.253708
    6546397  |    .442867   .1433048     3.09   0.002     .1615956    .7241383
    6563972  |  -.0297286   .0256882    -1.16   0.247    -.0801481    .0206908
    6568232  |   .0360814   .1609465     0.22   0.823    -.2798161     .351979
    6569047  |   .4514934   .0587375     7.69   0.000     .3362064    .5667805
    6576764  |   .0064532   .0161865     0.40   0.690    -.0253167    .0382232
    6582813  |   .9960725   .1365929     7.29   0.000     .7279749     1.26417
    6614541  |    .372281   .2530899     1.47   0.142    -.1244709    .8690328
    6631463  |   .5204253   .0512321    10.16   0.000     .4198695    .6209811
    6646017  |   .4869244   .0327971    14.85   0.000     .4225519    .5512969
    6649404  |   .2219815   .0250241     8.87   0.000     .1728654    .2710977
    6657681  |   .6719274   .0131952    50.92   0.000     .6460285    .6978262
    6668782  |   .5495237   .0707996     7.76   0.000     .4105618    .6884856
    6678008  |  -.1567018   .2608763    -0.60   0.548    -.6687364    .3553328
    6712334  |    .612035   .0499215    12.26   0.000     .5140517    .7100183
    6712438  |   .9622097   .0947882    10.15   0.000     .7761643    1.148255
    6726651  |   .0122627   .1750233     0.07   0.944     -.331264    .3557895
    6752777  |   .6979546   .0784785     8.89   0.000      .543921    .8519883
    6761847  |   .2735719   .1498977     1.83   0.068    -.0206396    .5677834
    6785177  |    .046944   .1177482     0.40   0.690     -.184166    .2780541
    6788936  |   .0224768   .1273453     0.18   0.860      -.22747    .2724236
    6792454  |   .3040438   .0734661     4.14   0.000     .1598483    .4482392
    6800813  |   .9893831   .0266299    37.15   0.000     .9371154    1.041651
    6808982  |   .7620109    .113185     6.73   0.000      .539857    .9841647
    6823682  |   .4018624   .1200342     3.35   0.001     .1662654    .6374593
    6856024  |   .0877837   .3393038     0.26   0.796    -.5781845    .7537518
    6858945  |   .2421116   .1622426     1.49   0.136    -.0763299    .5605532
    6862211  |   .9570779   .1076602     8.89   0.000      .745768    1.168388
    6877503  |   .9930668   .1296046     7.66   0.000     .7386856    1.247448
    6880503  |   .1766237   .1840474     0.96   0.337    -.1846151    .5378624
    6901658  |   .0219622    .055087     0.40   0.690    -.0861598    .1300841
    6926225  |   .6971222   .0763905     9.13   0.000     .5471868    .8470575
    6953631  |   .4352026    .162529     2.68   0.008      .116199    .7542063
    6964809  |   .4570779   .1076602     4.25   0.000      .245768    .6683877
    6968266  |   .9665297   .0839524    11.51   0.000     .8017522    1.131307
    6968899  |   .7210987     .13653     5.28   0.000     .4531245    .9890729
    6971064  |   -.046021    .115433    -0.40   0.690    -.2725869    .1805449
    6978536  |   .6674298   .1408403     4.74   0.000     .3909956    .9438639
    6997962  |   .0518664   .1300947     0.40   0.690    -.2034768    .3072095
    7001269  |   .9474436   .1318255     7.19   0.000     .6887033    1.206184
    7011132  |   .9307916   .1735931     5.36   0.000      .590072    1.271511
    7032521  |   .9120032   .1542549     5.91   0.000     .6092396    1.214767
    7046053  |   .5556895    .139684     3.98   0.000     .2815249     .829854
    7049469  |   .2205859    .051635     4.27   0.000     .1192394    .3219325
    7050208  |   .6444999   .0949534     6.79   0.000     .4581303    .8308695
    7068015  |   .4633903   .0341658    13.56   0.000     .3963314    .5304492
    7068539  |   .9834126   .1076625     9.13   0.000     .7720982    1.194727
    7082059  |   .2127125   .0353486     6.02   0.000     .1433321    .2820929
    7082529  |   .8550988   .2318934     3.69   0.000     .3999503    1.310247
    7085943  |   .3586274   .0810214     4.43   0.000     .1996028     .517652
    7094745  |   .7122566   .1143517     6.23   0.000     .4878129    .9367004
    7104006  |   .6067537   .0855048     7.10   0.000     .4389292    .7745782
    7108788  |   .8972311   .1909131     4.70   0.000     .5225167    1.271946
    7129809  |   .8416647    .264899     3.18   0.002     .3217344    1.361595
    7146557  |   .4960367   .0099411    49.90   0.000     .4765248    .5155485
    7153072  |   .3750568   .1022647     3.67   0.000     .1743368    .5757768
    7174723  |   .0397578   .0997231     0.40   0.690    -.1559737    .2354893
    7198907  |   .3590646   .0645407     5.56   0.000     .2323873    .4857418
    7199325  |   .0406454   .1019495     0.40   0.690    -.1594558    .2407466
    7201337  |   1.051866   .1300947     8.09   0.000     .7965232     1.30721
    7205892  |   .7684935   .0973911     7.89   0.000     .5773392    .9596479
    7209781  |   .2413816   .2306394     1.05   0.296    -.2113057    .6940689
    7257946  |   .0575028   .1442324     0.40   0.690    -.2255892    .3405949
    7259099  |   .2349024   .2468911     0.95   0.342    -.2496829    .7194876
    7268644  |   .4079486   .1642991     2.48   0.013     .0854707    .7304266
    7292386  |   .1964932   .1454676     1.35   0.177    -.0890232    .4820095
    7305951  |   .3547008   .3644489     0.97   0.331    -.3606209    1.070023
    7312902  |   .3664131   .0829727     4.42   0.000     .2035584    .5292677
    7318261  |   1.017004   .0426504    23.85   0.000     .9332919    1.100716
    7321079  |   .2798265   .1454676     1.92   0.055    -.0056898    .5653428
    7333313  |   .7027481   .1609465     4.37   0.000     .3868506    1.018646
    7364107  |   .6368059   .0748988     8.50   0.000     .4897982    .7838135
    7368906  |   .5368434   .1628347     3.30   0.001     .2172397     .856447
    7370462  |   .4570779   .1076602     4.25   0.000      .245768    .6683877
    7379312  |   .0555208   .2117624     0.26   0.793    -.3601157    .4711572
    7379888  |   .2136366   .1879751     1.14   0.256    -.1553113    .5825845
    7434197  |    .087357   .2191145     0.40   0.690    -.3427098    .5174237
    7453285  |     .01466   .1807947     0.08   0.935    -.3401946    .3695147
    7488267  |   .8828077   .2939496     3.00   0.003     .3058585    1.459757
    7499418  |   .7241695   .1442324     5.02   0.000     .4410775    1.007262
    7507104  |    .319422   .1807947     1.77   0.078    -.0354327    .6742766
    7523946  |    .469624   .1442324     3.26   0.001      .186532    .7527161
    7550713  |   .0621522   .1558943     0.40   0.690    -.2438292    .3681337
    7586827  |   .3455585   .2553139     1.35   0.176    -.1555587    .8466756
    7598476  |  -.0441125    .110646    -0.40   0.690    -.2612829    .1730578
    7608259  |   .4858916   .0414643    11.72   0.000     .4045076    .5672756
    7624816  |   1.020487   .0513875    19.86   0.000     .9196264    1.121348
    7630224  |   .3284744   .0121875    26.95   0.000     .3045533    .3523955
    7630258  |   .8324388   .0707996    11.76   0.000      .693477    .9714007
    7642272  |   .2807852   .1478372     1.90   0.058    -.0093822    .5709526
    7665777  |   .5565941    .141953     3.92   0.000      .277976    .8352122
    7691774  |     .68232   .1697594     4.02   0.000     .3491248    1.015515
    7697777  |   .7226015   .0249617    28.95   0.000     .6736079    .7715951
    7704309  |   .6488052   .2492856     2.60   0.009     .1595202     1.13809
    7746468  |  -.0213128   .0534581    -0.40   0.690    -.1262376     .083612
    7798951  |   1.028304   .0709941    14.48   0.000     .8889604    1.167648
    7802026  |     .72576   .0261205    27.79   0.000      .674492    .7770279
    7806392  |   .5154517   .1101206     4.68   0.000     .2993127    .7315908
    7837542  |   .5268482   .2103467     2.50   0.012     .1139904     .939706
    7843653  |  -.0226947   .0275131    -0.82   0.410    -.0766961    .0313067
    7847177  |   .0672742   .3906259     0.17   0.863    -.6994265    .8339749
    7854277  |   .4743472    .064344     7.37   0.000      .348056    .6006384
    7900217  |   .6712664   .3389302     1.98   0.048     .0060315    1.336501
    7908379  |   .3873379   .0826653     4.69   0.000     .2250866    .5495892
    7916474  |   .4980678   .0048465   102.77   0.000     .4885554    .5075802
    7933843  |   .2789314   .1364545     2.04   0.041     .0111056    .5467573
    7941827  |   .2381662    .046148     5.16   0.000     .1475892    .3287432
    7961017  |   .3033738   .1165971     2.60   0.009     .0745229    .5322247
    7966169  |   .4519626   .0576745     7.84   0.000     .3387621    .5651631
    7970249  |   1.026885   .2104372     4.88   0.000     .6138499    1.439921
    7977788  |   .0384485   .2543357     0.15   0.880    -.4607485    .5376456
    7985004  |   .5057599   .0144472    35.01   0.000     .4774035    .5341162
    7992281  |   .9315506   .1716894     5.43   0.000     .5945674    1.268534
    7999227  |   1.005888   .1597633     6.30   0.000     .6923129    1.319463
    8011163  |   .2698825   .1752838     1.54   0.124    -.0741556    .6139205
    8013694  |   .4187383   .3452543     1.21   0.226    -.2589092    1.096386
    8020183  |   .5439682   .1102839     4.93   0.000     .3275085    .7604278
    8029488  |   .3790767   .1147364     3.30   0.001     .1538779    .6042754
    8040728  |    .182574    .111234     1.64   0.101    -.0357503    .4008984
    8042032  |   .3391999    .182906     1.85   0.064    -.0197986    .6981985
    8050174  |   .3985948   .1613043     2.47   0.014     .0819949    .7151947
    8050737  |   .4575617   .0585264     7.82   0.000     .3426891    .5724343
    8052448  |   .4173813   .0745902     5.60   0.000     .2709795    .5637831
    8053482  |   .7223405   .0249762    28.92   0.000     .6733184    .7713626
    8067421  |  -.1243423   .2446628    -0.51   0.611    -.6045541    .3558694
    8080506  |   .2027481   .1609465     1.26   0.208    -.1131494    .5186457
    8086625  |   1.030455   .0763905    13.49   0.000     .8805202    1.180391
    8102401  |    .153518   .0434108     3.54   0.000     .0683136    .2387224
    8136376  |  -.0101822   .1221244    -0.08   0.934    -.2498817    .2295173
    8153445  |   .0420954   .1758641     0.24   0.811    -.3030817    .3872724
    8187087  |   .9806017    .048656    20.15   0.000     .8851021    1.076101
    8199609  |  -.0485296   .1217251    -0.40   0.690    -.2874455    .1903863
    8201999  |   .4743535   .1115096     4.25   0.000     .2554882    .6932188
    8205626  |   .5115253   .0521333     9.81   0.000     .4092008    .6138499
    8215757  |   .6366547   .0752781     8.46   0.000     .4889027    .7844067
    8220359  |   .1769774   .0577469     3.06   0.002     .0636347      .29032
    8231506  |   .3392525   .0148468    22.85   0.000     .3101119    .3683931
    8250273  |   .2952991    .183822     1.61   0.109    -.0654973    .6560955
    8252983  |   .5197035   .1205319     4.31   0.000     .2831297    .7562774
    8258473  |   .3144432   .0473815     6.64   0.000     .2214451    .4074412
    8268443  |    .489675   .0258978    18.91   0.000     .4388441    .5405059
    8270028  |   .0286557   .0718762     0.40   0.690    -.1124191    .1697306
    8290753  |  -.1152998   .1601856    -0.72   0.472    -.4297039    .1991043
    8309948  |   .0430668   .1080229     0.40   0.690    -.1689551    .2550887
    8311783  |   .9351122   .1627559     5.75   0.000     .6156633    1.254561
    8317488  |   .4743472    .064344     7.37   0.000      .348056    .6006384
    8318032  |   .9147509   .2138274     4.28   0.000     .4950613     1.33444
    8321388  |    .330269   .0657345     5.02   0.000     .2012487    .4592892
    8325553  |   .0529558   .1328273     0.40   0.690    -.2077508    .3136625
    8358439  |   .9570779   .1076602     8.89   0.000      .745768    1.168388
    8381734  |    .515432   .1100722     4.68   0.000     .2993878    .7314761
    8391073  |     .04559   .1143517     0.40   0.690    -.1788538    .2700337
    8393262  |   1.067055   .1681909     6.34   0.000     .7369382    1.397171
    8400856  |   .6354681   .2201985     2.89   0.004     .2032737    1.067662
    8413464  |   .7142351   .1193142     5.99   0.000     .4800513    .9484188
    8430567  |   .0012508   .0031374     0.40   0.690    -.0049072    .0074088
    8436047  |   -.113212   .2169094    -0.52   0.602    -.5389508    .3125268
    8438227  |   .3157251    .037183     8.49   0.000     .2427442    .3887059
    8444801  |   .7736201   .1301586     5.94   0.000     .5181514    1.029089
    8463216  |  -.0086145   .0216074    -0.40   0.690    -.0510243    .0337954
    8464345  |   .0452991    .183822     0.25   0.805    -.3154973    .4060955
    8478051  |   .2587516   .0938297     2.76   0.006     .0745875    .4429158
    8480747  |   .1388641   .1062458     1.31   0.192    -.0696698     .347398
    8493522  |   .0456657   .1145416     0.40   0.690    -.1791508    .2704821
    8495973  |   .5575028   .1442324     3.87   0.000     .2744108    .8405949
    8506984  |    .696137   .0739193     9.42   0.000      .551052    .8412219
    8507855  |   .4668661   .0289229    16.14   0.000     .4100978    .5236344
    8520153  |    .378257   .0545372     6.94   0.000     .2712141    .4852999
    8528489  |  -.0038942   .0097677    -0.40   0.690    -.0230657    .0152773
    8528813  |   .0360814   .1609465     0.22   0.823    -.2798161     .351979
    8567489  |  -.0709956   .1123854    -0.63   0.528    -.2915799    .1495888
    8577727  |  -.0912824   .1623929    -0.56   0.574    -.4100189    .2274542
    8590549  |   .7281303    .154167     4.72   0.000     .4255391    1.030721
    8596973  |   .5360814   .1609465     3.33   0.001     .2201839     .851979
    8613356  |   .5201041   .0504263    10.31   0.000     .4211299    .6190782
    8635439  |   .3171171   .0406747     7.80   0.000     .2372829    .3969513
    8657128  |   .9705577   .0738491    13.14   0.000     .8256104    1.115505
    8668985  |   .4054157   .2372426     1.71   0.088    -.0602319    .8710633
    8677168  |   .3380758   .1310288     2.58   0.010     .0808991    .5952526
    8695906  |   .1086274   .0810214     1.34   0.180    -.0503972     .267652
    8720993  |   .0597374   .2197568     0.27   0.786      -.37159    .4910648
    8742588  |  -.0932788   .2339681    -0.40   0.690    -.5524994    .3659418
    8793889  |   .2498291   .0004287   582.82   0.000     .2489878    .2506704
    8874916  |   .2162327    .194431     1.11   0.266    -.1653866    .5978521
    8876922  |  -.0463049   .1161449    -0.40   0.690    -.2742681    .1816584
    8886067  |   -.030012   .0752781    -0.40   0.690     -.177764      .11774
    8887182  |    .521018   .0527187     9.88   0.000     .4175444    .6244916
    8888311  |   .0747663   .1875337     0.40   0.690    -.2933153    .4428479
    8889878  |   .3939667   .1990338     1.98   0.048     .0033134      .78462
    8896452  |   .5260213   .1360745     3.87   0.000     .2589412    .7931013
    8897282  |   .5471626    .299748     1.83   0.068    -.0411673    1.135493
    8927236  |   .5531498   .1333139     4.15   0.000     .2914881    .8148116
    8928709  |   .4954285   .0114664    43.21   0.000     .4729228    .5179343
    8929675  |   .1952349   .1751667     1.11   0.265    -.1485734    .5390433
    8930568  |   .5516713   .1296053     4.26   0.000     .2972885     .806054
    8932689  |   .5801021   .0499093    11.62   0.000     .4821427    .6780615
    8939708  |   .3925204   .1484569     2.64   0.008     .1011368    .6839041
    8968764  |  -.0521371   .0503076    -1.04   0.300    -.1508782    .0466041
    8972811  |   .4792367   .0520798     9.20   0.000     .3770171    .5814563
    8983073  |   .0098907   .0248084     0.40   0.690     -.038802    .0585833
    8991685  |   1.038643   .0969278    10.72   0.000     .8483984    1.228888
    8996971  |    .420196    .050657     8.29   0.000     .3207691     .519623
    9038779  |   .9618568   .0956734    10.05   0.000     .7740739     1.14964
    9045324  |    .363411   .1460882     2.49   0.013     .0766765    .6501454
    9061466  |  -.0052638   .0132029    -0.40   0.690    -.0311778    .0206502
    9090043  |  -.0219536   .0550655    -0.40   0.690    -.1300333    .0861261
    9100651  |   1.051392   .1289053     8.16   0.000     .7983834    1.304401
    9114227  |    .114176   .3406826     0.34   0.738    -.5544984    .7828505
    9117489  |   .0402754   .1010213     0.40   0.690    -.1580041    .2385548
    9119489  |   .1377391   .0252889     5.45   0.000     .0881033    .1873748
    9152213  |   .7860814   .1609465     4.88   0.000     .4701839    1.101979
    9163759  |   .1830528   .2155591     0.85   0.396    -.2400357    .6061412
    9189348  |   .3847256   .1289053     2.98   0.003     .1317167    .6377344
    9191325  |   .4815848   .0461902    10.43   0.000     .3909251    .5722445
    9194011  |   .5441499   .1107396     4.91   0.000     .3267959    .7615039
    9197785  |    .875802   .2443027     3.58   0.000     .3962972    1.355307
    9217812  |   .4107309   .1941337     2.12   0.035     .0296953    .7917665
    9236225  |    .991631   .0209917    47.24   0.000     .9504295    1.032832
    9238377  |   .6719921   .0133576    50.31   0.000     .6457745    .6982097
    9265581  |   .4934619   .0119521    41.29   0.000     .4700029    .5169208
    9292457  |   .6647345   .0048465   137.16   0.000     .6552221    .6742469
    9302524  |    .024518   .0614977     0.40   0.690    -.0961865    .1452225
    9307017  |   .2912169     .04475     6.51   0.000     .2033838    .3790499
    9336534  |   .2397754    .025646     9.35   0.000     .1894388    .2901121
    9361445  |   .4801547    .229106     2.10   0.036     .0304772    .9298322
    9373106  |   .0613471   .1538747     0.40   0.690    -.2406704    .3633645
    9395545  |  -.0212547   .0292167    -0.73   0.467    -.0785998    .0360905
    9397184  |   .0020633   .0051754     0.40   0.690    -.0080947    .0122213
    9403053  |   .5475684   .1193142     4.59   0.000     .3133846    .7817521
    9427606  |   .6513202   .1368117     4.76   0.000     .3827933    .9198471
    9429663  |   .8832022   .2258461     3.91   0.000      .439923    1.326481
    9465837  |    .521018   .0527187     9.88   0.000     .4175444    .6244916
    9468728  |   .5575028   .1442324     3.87   0.000     .2744108    .8405949
    9477401  |   .4419607   .0810214     5.45   0.000     .2829361    .6009853
    9482942  |   .2239747   .2137039     1.05   0.295    -.1954723    .6434217
    9501995  |   .4119399   .1544116     2.67   0.008     .1088686    .7150112
    9524142  |  -.0038173   .0095748    -0.40   0.690    -.0226103    .0149757
    9531502  |   .2443304   .0142208    17.18   0.000     .2164186    .2722423
    9549168  |   .0291994   .0732399     0.40   0.690    -.1145522    .1729511
    9566421  |   .3718023   .0506168     7.35   0.000     .2724542    .4711504
    9566464  |   .1392399   .0249625     5.58   0.000     .0902448    .1882349
    9572523  |   .3237124   .3092378     1.05   0.295    -.2832437    .9306685
    9575801  |   .0550581   .1381003     0.40   0.690    -.2159982    .3261143
    9581031  |   .3171968   .1827126     1.74   0.083    -.0414222    .6758158
    9583499  |   .2602418   .0974378     2.67   0.008     .0689958    .4514878
    9590009  |   .4826052   .0436309    11.06   0.000     .3969687    .5682416
    9618297  |   .5591871   .1484569     3.77   0.000     .2678034    .8505707
    9618903  |  -.0478348   .0527405    -0.91   0.365    -.1513513    .0556816
    9625422  |   .2723546   .1529508     1.78   0.075    -.0278494    .5725587
    9651841  |   .2501483   .0732531     3.41   0.001     .1063708    .3939258
    9663512  |   .5383016   .0960705     5.60   0.000     .3497393    .7268638
    9671015  |   .1334336   .1543888     0.86   0.388    -.1695929    .4364601
    9671063  |   .3984528   .1099049     3.63   0.000      .182737    .6141686
    9694979  |    .365174   .2708349     1.35   0.178     -.166407     .896755
    9717276  |   .4520594   .0526556     8.59   0.000     .3487098    .5554091
    9724622  |   .5820021   .0697756     8.34   0.000     .4450502     .718954
    9740556  |   -.044665   .1120318    -0.40   0.690    -.2645553    .1752252
    9752131  |   .2798265   .1454676     1.92   0.055    -.0056898    .5653428
    9754896  |  -.0297288   .0745678    -0.40   0.690    -.1760868    .1166291
    9772919  |   .2913702   .1037674     2.81   0.005     .0877008    .4950396
    9784716  |   .2902011   .1711621     1.70   0.090    -.0457472    .6261494
    9802901  |   .5898801   .0885109     6.66   0.000     .4161555    .7636048
    9806675  |   .3619891   .0718762     5.04   0.000     .2209142    .5030639
    9811326  |   1.020812    .052203    19.55   0.000      .918351    1.123274
    9820038  |  -.0104965   .1214053    -0.09   0.931    -.2487846    .2277916
    9823206  |   .3690465   .2320073     1.59   0.112    -.0863255    .8244186
    9826437  |   .0203893   .0511418     0.40   0.690    -.0799892    .1207678
    9837961  |   .0038108   .0095586     0.40   0.690    -.0149503    .0225719
    9849331  |   .0105885   .0265589     0.40   0.690    -.0415399     .062717
    9871053  |  -.1063637   .2667884    -0.40   0.690    -.6300023    .4172749
    9873409  |   .0304555   .0763905     0.40   0.690    -.1194798    .1803908
    9910104  |   .6071857   .1372692     4.42   0.000     .3377607    .8766108
    9914734  |  -.0248824   .0624117    -0.40   0.690    -.1473808     .097616
    9915513  |   .0004615   .0011576     0.40   0.690    -.0018106    .0027336
    9936357  |   .3111062   .0557515     5.58   0.000     .2016801    .4205324
    9952575  |   .5262503    .078743     6.68   0.000     .3716977     .680803
    9982136  |  -.0019068   .0047827    -0.40   0.690    -.0112941    .0074805
    9991292  |   .7128901   .1159405     6.15   0.000     .4853279    .9404522
             |
        term |
       2005  |   .0273667   .0846411     0.32   0.747    -.1387626    .1934959
             |
       _cons |   -.135769   .3405447    -0.40   0.690    -.8041728    .5326349
------------------------------------------------------------------------------

. outreg2 fpm using DiD_oppcollege.doc, bdec(3) nocons tex(nopretty) replace
DiD_oppcollege.tex
DiD_oppcollege.doc
dir : seeout

. 
. ***DiD specification for probability of reelection***
. reg reelected fpm i.cityr i.term, cluster(cityr), if rerun == 1

Linear regression                               Number of obs     =        547
                                                F(1, 500)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.9510
                                                Root MSE          =     .38354

                                (Std. err. adjusted for 501 clusters in cityr)
------------------------------------------------------------------------------
             |               Robust
   reelected | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         fpm |   .0038263   .0759278     0.05   0.960    -.1453505    .1530032
             |
       cityr |
      12775  |   .6215977    .416304     1.49   0.136    -.1963231    1.439518
      13056  |   1.618673   .3738648     4.33   0.000     .8841334    2.353213
      15152  |   1.630748   .5672124     2.88   0.004     .5163343    2.745161
      19861  |   1.673602   1.376372     1.22   0.225    -1.030583    4.377787
      20959  |   .6702762   1.311709     0.51   0.610    -1.906865    3.247417
      33386  |   1.032982   .6544758     1.58   0.115    -.2528797    2.318843
      44032  |    .591068   .3938492     1.50   0.134    -.1827354    1.364871
      50674  |   1.093287    1.85114     0.59   0.555    -2.543685    4.730258
      57757  |   .9394971   1.200595     0.78   0.434    -1.419335    3.298329
      58365  |    1.61817   .3669907     4.41   0.000     .8971357    2.339203
      61129  |   1.666301   1.234605     1.35   0.178    -.7593516    4.091953
      75344  |   .6459493   .8450261     0.76   0.445     -1.01429    2.306189
      75623  |   .6696683   1.299903     0.52   0.607    -1.884278    3.223614
      78102  |   .0718878   1.426511     0.05   0.960    -2.730807    2.874583
      87651  |   1.681735   1.534976     1.10   0.274    -1.334063    4.697533
      88022  |   .7995894   .1486176     5.38   0.000     .5075974    1.091581
      88472  |   .9756966   .4822656     2.02   0.044     .0281798    1.923213
     102952  |   1.591068   .3938492     4.04   0.000     .8172646    2.364871
     107506  |     1.6111   .2902577     5.55   0.000     1.040825    2.181375
     108977  |    1.68903   1.677696     1.01   0.315    -1.607173    4.985234
     117839  |   .6307479   .5672124     1.11   0.267    -.4836657    1.745161
     133366  |   1.078321   1.554164     0.69   0.488    -1.975176    4.131818
     147659  |   1.621598    .416304     3.90   0.000     .8036769    2.439518
     155075  |   1.108051   2.144111     0.52   0.606    -3.104526    5.320627
     156473  |    1.60642   .2692842     5.97   0.000     1.077352    2.135488
     164878  |   1.660181   1.116395     1.49   0.138    -.5332216    3.853584
     164885  |   1.068201   1.353354     0.79   0.430     -1.59076    3.727162
     170683  |   1.091349   1.812691     0.60   0.547    -2.470081    4.652779
     171814  |   1.632732   .6021701     2.71   0.007     .4496363    2.815827
     191693  |   1.037979   .7536389     1.38   0.169    -.4427103    2.518668
     209431  |   1.093942   1.864143     0.59   0.558    -2.568578    4.756462
     213299  |    .686629   1.630678     0.42   0.674    -2.517197    3.890455
     229742  |   1.617402   .3567937     4.53   0.000     .9164023    2.318402
     232006  |   .5837551   .5096362     1.15   0.253    -.4175372    1.585048
     254252  |   1.641325   .7585901     2.16   0.031      .150908    3.131742
     256603  |   .6712215   1.330075     0.50   0.614    -1.942004    3.284447
     260258  |   1.613187   .3082885     5.23   0.000     1.007486    2.218887
     284708  |   1.066165   1.312945     0.81   0.417    -1.513404    3.645734
     288527  |   .0002779   .0055139     0.05   0.960    -.0105554    .0111111
     305204  |   1.084846   1.683652     0.64   0.520    -2.223059    4.392751
     343793  |    1.65701   1.055418     1.57   0.117    -.4165916    3.730611
     353884  |   .6405872    .744917     0.86   0.390    -.8229661     2.10414
     363522  |   1.028604   .5676152     1.81   0.071    -.0866003    2.143809
     363604  |   1.626747   .4987166     3.26   0.001     .6469084    2.606585
     382582  |   1.645775   .8417404     1.96   0.051    -.0080095    3.299559
     383076  |   1.599116   .2977713     5.37   0.000     1.014079    2.184153
     387105  |   .3536079   1.017362     0.35   0.728    -1.645223    2.352439
     395289  |   1.612493   .3017857     5.34   0.000     1.019569    2.205418
     415021  |   1.663702   1.184324     1.40   0.161    -.6631636    3.990568
     415177  |   1.688091   1.659307     1.02   0.309    -1.571982    4.948164
     423866  |   1.641085   .7541421     2.18   0.030     .1594072    3.122763
     440577  |   .0371842   .7378682     0.05   0.960     -1.41252    1.486889
     450281  |   .3493026   .9327445     0.37   0.708    -1.483279    2.181884
     457092  |   1.650381   .9288156     1.78   0.076    -.1744817    3.475243
     458642  |   .0821499   1.630147     0.05   0.960    -3.120631    3.284931
     481125  |   .0893884   1.773784     0.05   0.960    -3.395601    3.574378
     495187  |   .8438361   .8255488     1.02   0.307    -.7781361    2.465808
     502051  |    1.64361   .8011588     2.05   0.041     .0695577    3.217663
     507608  |  -.0302446    .600161    -0.05   0.960    -1.209393    1.148904
     538912  |   1.659205   1.097607     1.51   0.131    -.4972851    3.815696
     539921  |    .673468   1.373763     0.49   0.624    -2.025592    3.372528
     546274  |   1.555104   1.036983     1.50   0.134    -.4822775    3.592485
     556475  |   .0634631   1.259335     0.05   0.960    -2.410778    2.537704
     562174  |   1.085831   1.703194     0.64   0.524    -2.260467    4.432129
     591172  |   .3064778   .1530335     2.00   0.046     .0058099    .6071457
     596965  |   1.667056   1.249235     1.33   0.183    -.7873407    4.121453
     623212  |   .5885276   .4320687     1.36   0.174    -.2603664    1.437422
     665845  |   1.094781   1.880791     0.58   0.561    -2.600447    4.790008
     671747  |   .0355085   .7046156     0.05   0.960    -1.348864    1.419881
     677981  |   .6254063   .4765251     1.31   0.190     -.310832    1.561645
     685284  |   1.665927    1.22736     1.36   0.175    -.7454911    4.077345
     725151  |   .7518963   1.018776     0.74   0.461    -1.249713    2.753506
     731479  |   1.012691   .2518413     4.02   0.000     .5178938    1.507489
     736154  |   1.684506   1.589147     1.06   0.290    -1.437723    4.806736
     747542  |   1.642554   .7814503     2.10   0.036     .1072235    3.177885
     754021  |   .0833493   1.653948     0.05   0.960    -3.166195    3.332894
     757066  |   .5994331   .2951161     2.03   0.043     .0196126    1.179254
     762126  |   .2880479   .3218905     0.89   0.371    -.3443766    .9204725
     763699  |   1.637787   .6933867     2.36   0.019     .2754766    3.000098
     772987  |   1.636244   .6652571     2.46   0.014     .3291996    2.943287
     780635  |  -.0347621   .6898048    -0.05   0.960    -1.390035    1.320511
     785219  |   1.633507   .6159739     2.65   0.008     .4232909    2.843723
     817727  |   .9258503   1.471396     0.63   0.529     -1.96503    3.816731
     847551  |   1.663145   1.173554     1.42   0.157    -.6425596    3.968849
     850272  |  -.0647408   1.284689    -0.05   0.960    -2.588795    2.459313
     850863  |   .8135251   .2519001     3.23   0.001      .318612    1.308438
     859017  |   1.697271   1.839302     0.92   0.357    -1.916442    5.310985
     863916  |   .6402304   .7383193     0.87   0.386    -.8103601    2.090821
     866571  |   .0256772   .5095275     0.05   0.960    -.9754017    1.026756
     869899  |   1.028527   .5660853     1.82   0.070    -.0836716    2.140726
     881398  |   1.676419   1.431227     1.17   0.242    -1.135542    4.488379
     886621  |   1.000105   .0020892   478.71   0.000     .9960006     1.00421
     909157  |   .9041208   1.902585     0.48   0.635    -2.833926    4.642168
     913997  |   1.663145   1.173554     1.42   0.157    -.6425596    3.968849
     925841  |   .0626397   1.242995     0.05   0.960    -2.379497    2.504776
     934336  |   .5962565   .3262439     1.83   0.068    -.0447213    1.237234
     947974  |  -.0325249   .6454108    -0.05   0.960    -1.300576    1.235527
     949469  |    .555104   1.036983     0.54   0.593    -1.482277    2.592485
     961701  |   1.620956   .4066569     3.99   0.000     .8219886    2.419923
     980341  |   .0524844   1.041479     0.05   0.960     -1.99373    2.098699
     988713  |   .6107663   .2878208     2.12   0.034     .0452791    1.176254
    1008754  |   1.672644   1.357735     1.23   0.219    -.9949242    4.340213
    1030024  |   .6327318   .6021701     1.05   0.294    -.5503637    1.815827
    1055878  |   1.662364   1.158486     1.43   0.152     -.613737    3.938466
    1059019  |   1.694046   1.776011     0.95   0.341    -1.795319    5.183411
    1087329  |   1.688091   1.659307     1.02   0.309    -1.571982    4.948164
    1162916  |   .9979641   .0403992    24.70   0.000      .918591    1.077337
    1167111  |     .08718   1.729962     0.05   0.960     -3.31171     3.48607
    1181891  |   .0354167   .7027932     0.05   0.960    -1.345375    1.416208
    1194826  |   1.100182   1.987969     0.55   0.580    -2.805621    5.005985
    1199583  |   .6762854   1.428632     0.47   0.636    -2.130576    3.483147
    1201851  |  -.0298518   .5923662    -0.05   0.960    -1.193685    1.133982
    1223136  |   .0521742   1.035322     0.05   0.960    -1.981943    2.086292
    1248461  |   .6898873   1.694483     0.41   0.684    -2.639298    4.019072
    1248986  |   1.614428    .321067     5.03   0.000     .9836208    2.245234
    1254046  |   .9800693   .3954962     2.48   0.014       .20303    1.757109
    1271075  |   1.089771   1.781374     0.61   0.541    -2.410131    4.589672
    1295732  |   .7730482   .6052522     1.28   0.202    -.4161028    1.962199
    1318102  |   1.675379   1.410974     1.19   0.236    -1.096789    4.447547
    1405824  |    1.65495   1.015954     1.63   0.104    -.3411146    3.651015
    1406858  |   1.615865   .3375164     4.79   0.000     .9527398     2.27899
    1423484  |   .9529336   .9339651     1.02   0.308    -.8820461    2.787913
    1456817  |   1.083165   1.650298     0.66   0.512    -2.159208    4.325539
    1495675  |   1.089375   1.773524     0.61   0.539    -2.395102    4.573853
    1497624  |    1.66936    1.29391     1.29   0.198     -.872812    4.211531
    1531455  |   1.084364    1.67408     0.65   0.517    -2.204734    4.373461
    1557382  |   .3910166   1.755919     0.22   0.824    -3.058873    3.840906
    1565512  |   .9829481   .3383697     2.90   0.004     .3181465     1.64775
    1608972  |   .8520338   .9864064     0.86   0.388    -1.085978    2.790046
    1711041  |   .8029191   .1344068     5.97   0.000     .5388473    1.066991
    1749253  |   .2945565   .2115172     1.39   0.164    -.1210154    .7101285
    1751753  |   1.681323   1.526933     1.10   0.271    -1.318673     4.68132
    1755893  |   1.671222   1.330075     1.26   0.210    -.9420036    4.284447
    1814259  |   1.008688    .172403     5.85   0.000     .6699644    1.347412
    1843081  |   .9429833   1.131415     0.83   0.405     -1.27993    3.165897
    1906642  |   .6402304   .7383193     0.87   0.386    -.8103601    2.090821
    1937499  |    1.64023   .7383193     2.22   0.027     .1896399    3.090821
    1975711  |   .0693197   1.375551     0.05   0.960    -2.633252    2.771891
    1985698  |   1.610643   .2869514     5.61   0.000     1.046864    2.174422
    1987777  |    .618673   .3738648     1.65   0.099    -.1158666    1.353213
    2015211  |   .6240221   .4541082     1.37   0.170    -.2681732    1.516217
    2040526  |   .8040797   .1368041     5.88   0.000     .5352981    1.072861
    2080927  |   .9714726   .5660853     1.72   0.087    -.1407263    2.083672
    2126494  |    .029607    .587508     0.05   0.960    -1.124682    1.183896
    2154193  |   1.566063   .8288699     1.89   0.059    -.0624343     3.19456
    2171355  |  -.0730162   1.448902    -0.05   0.960    -2.919703     2.77367
    2183606  |   .6659268    1.22736     0.54   0.588    -1.745491    3.077345
    2269545  |   .2905434   .2776641     1.05   0.296    -.2549887    .8360754
    2292099  |   .0626397   1.242995     0.05   0.960    -2.379497    2.504776
    2292127  |   .6291288   .5391346     1.17   0.244    -.4301196    1.688377
    2333801  |   1.656622   1.047973     1.58   0.115     -.402351    3.715594
    2336156  |   .3646994   1.235869     0.30   0.768    -2.063436    2.792835
    2364826  |    1.10368   2.057381     0.54   0.592    -2.938498    5.145858
    2407414  |     1.0532   1.055675     1.00   0.319    -1.020906    3.127306
    2408207  |   .8176957   .3249122     2.52   0.012     .1793342    1.456057
    2414295  |   1.616386   .3438749     4.70   0.000     .9407686    2.292004
    2473356  |   1.063131   1.252743     0.85   0.396    -1.398157    3.524419
    2482873  |  -.0579861   1.150651    -0.05   0.960    -2.318694    2.202722
    2511014  |    .672932   1.363334     0.49   0.622    -2.005638    3.351502
    2522458  |   1.554392   1.050626     1.48   0.140    -.5097938    3.618579
    2528294  |   .8525126   .9958216     0.86   0.392    -1.103998    2.809023
    2542784  |   .6249375   .4688723     1.33   0.183    -.2962652     1.54614
    2573218  |   1.033826   .6712275     1.54   0.124     -.284948      2.3526
    2579974  |   .0424603   .8425643     0.05   0.960    -1.612943    1.697863
    2598595  |   .5988342   .3002198     1.99   0.047     .0089864    1.188682
    2607525  |   1.686032   1.618991     1.04   0.298    -1.494831    4.866895
    2613241  |    1.68382   1.575718     1.07   0.286    -1.412025    4.779665
    2627096  |   1.657093   1.057015     1.57   0.118    -.4196456    3.733831
    2635699  |   .8981136   1.896365     0.47   0.636    -2.827713     4.62394
    2636295  |   1.057693   1.144827     0.92   0.356    -1.191571    3.306957
    2663167  |   1.093942   1.864143     0.59   0.558    -2.568578    4.756462
    2671285  |   .9829481   .3383697     2.90   0.004     .3181465     1.64775
    2701443  |   .9394971   1.200595     0.78   0.434    -1.419335    3.298329
    2712596  |   1.084467   1.676131     0.65   0.518    -2.208661    4.377595
    2723052  |   1.035441   .7032708     1.47   0.142    -.3462893    2.417171
    2735706  |   .5830813   .5210445     1.12   0.264    -.4406251    1.606788
    2736654  |   1.016719   .3317745     3.06   0.002     .3648755    1.668563
    2759143  |   .9697554    .600161     1.62   0.107    -.2093929    2.148904
    2768228  |   1.101153   2.007234     0.55   0.584      -2.8425    5.044805
    2803748  |   .6430151   .7900428     0.81   0.416    -.9091977    2.195228
    2812269  |    1.56017   .9402498     1.66   0.098    -.2871573    3.407497
    2816213  |   1.570571   .7448129     2.11   0.035     .1072221     3.03392
    2825324  |   1.701618   1.924676     0.88   0.377    -2.079831    5.483068
    2845277  |   1.620883   .4055717     4.00   0.000     .8240479    2.417717
    2856376  |   .6860047   1.618461     0.42   0.672    -2.493818    3.865828
    2903939  |    1.66805   1.268497     1.31   0.189    -.8241924    4.160292
    2908949  |   1.659587   1.104949     1.50   0.134    -.5113289    3.830503
    2924076  |   1.488409   2.340505     0.64   0.525    -3.110027    6.086845
    2977764  |   1.632524   .5984743     2.73   0.007     .4566893    2.808358
    2996626  |    1.68584   1.615237     1.04   0.297    -1.487648    4.859328
    3020968  |   .0366202   .7266764     0.05   0.960    -1.391095    1.464336
    3030646  |   .0804092   1.595605     0.05   0.960    -3.054508    3.215327
    3044834  |   1.620892   .4057055     4.00   0.000      .823794    2.417989
    3096085  |   1.686032   1.618991     1.04   0.298    -1.494831    4.866895
    3149161  |   .7938033   .2232615     3.56   0.000     .3551571     1.23245
    3163095  |   1.597956   .3083762     5.18   0.000     .9920836    2.203829
    3260366  |   .0982808   1.950242     0.05   0.960    -3.733398     3.92996
    3305893  |   1.027404   .5437979     1.89   0.059    -.0410063    2.095815
    3333764  |   1.605999   .2688946     5.97   0.000     1.077697    2.134302
    3338092  |   .9429452   1.132171     0.83   0.405    -1.281453    3.167344
    3353152  |   .6408932   .7505841     0.85   0.394    -.8337943    2.115581
    3376617  |   1.084846   1.683652     0.64   0.520    -2.223059    4.392751
    3400743  |   .6949225   1.793206     0.39   0.699    -2.828225     4.21807
    3405796  |   .9337923   1.313796     0.71   0.478    -1.647449    3.515034
    3430952  |   .0540949   1.073437     0.05   0.960    -2.054908    2.163098
    3457772  |   .6701447   1.309155     0.51   0.609    -1.901979    3.242268
    3461217  |   1.011798   .2341199     4.32   0.000     .5518183    1.471778
    3468056  |   .6500333   .9222204     0.70   0.481    -1.161871    2.461938
    3474282  |   1.532343   1.477853     1.04   0.300    -1.371224     4.43591
    3508748  |   .0425559   .8444618     0.05   0.960    -1.616575    1.701687
    3564317  |   1.663985   1.189794     1.40   0.163    -.6736276    4.001598
    3607746  |   .9337923   1.313796     0.71   0.478    -1.647449    3.515034
    3627494  |   1.693986   1.774831     0.95   0.340    -1.793059    5.181031
    3643244  |   1.047357   .9397414     1.11   0.266    -.7989711    2.893686
    3667127  |   1.575714   .6506753     2.42   0.016     .2973192    2.854109
    3668458  |   1.605894   .2688372     5.97   0.000     1.077704    2.134084
    3668955  |   1.061967    1.22965     0.86   0.388    -1.353951    3.477886
    3700628  |   .3356231   .6652781     0.50   0.614     -.971462    1.642708
    3709269  |    1.60868    .275732     5.83   0.000     1.066944    2.150416
    3743843  |   1.653687   .9917941     1.67   0.096    -.2949109    3.602284
    3834836  |   1.063616   1.262363     0.84   0.400    -1.416575    3.543806
    3836655  |   .6999554   2.044987     0.34   0.732    -3.317871    4.717782
    3849661  |   .6350159   .6430472     0.99   0.324    -.6283917    1.898423
    3929234  |    1.66161   1.143929     1.45   0.147     -.585891    3.909111
    3931245  |   .6145194   .3220681     1.91   0.057    -.0182542    1.247293
    3947017  |   1.687222   1.642278     1.03   0.305    -1.539394    4.913837
    3963974  |   1.641939   .7699932     2.13   0.033     .1291179     3.15476
    3975708  |   1.696735   1.828776     0.93   0.354    -1.896297    5.289767
    3984153  |   1.673631   1.376929     1.22   0.225    -1.031649     4.37891
    3989111  |    1.64785   .8808716     1.87   0.062    -.0828157    3.378516
    4050403  |   1.610766   .2878208     5.60   0.000     1.045279    2.176254
    4053238  |   1.669957   1.305512     1.28   0.201    -.8950087    4.234923
    4064468  |   .0637758    1.26554     0.05   0.960    -2.422656    2.550207
    4073621  |   .0768453   1.524886     0.05   0.960    -2.919129     3.07282
    4127444  |   .6949225   1.793206     0.39   0.699    -2.828225     4.21807
    4188564  |   .8055897   .1454272     5.54   0.000      .519866    1.091313
    4217726  |   1.016801    .333389     3.05   0.002     .3617849    1.671817
    4236089  |   1.588863   .4268838     3.72   0.000     .7501556     2.42757
    4250907  |   .6078592   .2725549     2.23   0.026     .0723652    1.143353
    4259748  |   .8334122   .6223734     1.34   0.181     -.389377    2.056202
    4261254  |   1.635552   .6527295     2.51   0.013     .3531215    2.917983
    4274855  |    1.60544   .2687769     5.97   0.000     1.077369    2.133512
    4312463  |   .6615819    1.14339     0.58   0.563     -1.58486    2.908024
    4353246  |  -.0589139   1.169062    -0.05   0.960    -2.355794    2.237966
    4387728  |   1.690666   1.709741     0.99   0.323    -1.668496    5.049828
    4399293  |   1.007136    .141595     7.11   0.000      .728941     1.28533
    4418283  |     .66399    1.18989     0.56   0.577    -1.673811    3.001791
    4451086  |   1.593126   .3650598     4.36   0.000     .8758859    2.310366
    4498129  |  -.0022115   .0438833    -0.05   0.960    -.0884299    .0840069
    4509152  |   .8619779     1.1822     0.73   0.466    -1.460714     3.18467
    4572636  |   .0767928   1.523843     0.05   0.960    -2.917131    3.070717
    4591298  |   1.090084   1.787591     0.61   0.542    -2.422032      4.6022
    4591884  |   1.587661   .4456648     3.56   0.000     .7120543    2.463267
    4598257  |   1.084619   1.679147     0.65   0.519    -2.214435    4.383673
    4667466  |   1.022807   .4525695     2.26   0.024     .1336345    1.911979
    4699777  |   .0438585   .8703103     0.05   0.960    -1.666057    1.753774
    4700313  |   .0573067   1.137171     0.05   0.960    -2.176915    2.291528
    4716293  |   1.058614   1.163113     0.91   0.363    -1.226577    3.343805
    4718887  |   .8511624   .9692802     0.88   0.380    -1.053202    2.755526
    4723808  |   .9137908   1.710698     0.53   0.593    -2.447252    4.274834
    4725006  |   1.575243   .6592043     2.39   0.017     .2800908    2.870394
    4726189  |   .0573287   1.137607     0.05   0.960     -2.17775    2.292407
    4766011  |   .5625387   .8953103     0.63   0.530    -1.196495    2.321573
    4797843  |   1.575261   .6588642     2.39   0.017     .2807777    2.869745
    4851781  |   1.655148   1.019728     1.62   0.105    -.3483318    3.658627
    4865071  |   1.589466   .4176562     3.81   0.000     .7688881    2.410043
    4893515  |   1.018397   .3650697     2.79   0.005     .3011377    1.735657
    4930473  |   .3486547   .9200253     0.38   0.705    -1.458937    2.156247
    4974831  |   1.010048   .1993933     5.07   0.000     .6182963      1.4018
    4976366  |   1.689967   1.696042     1.00   0.320     -1.64228    5.022214
    4998571  |  -.0207124   .4110074    -0.05   0.960    -.8282268    .7868021
    5003933  |   1.088136    1.74894     0.62   0.534    -2.348041    4.524314
    5005547  |   .5975908   .3119978     1.92   0.056    -.0153974    1.210579
    5059593  |   .3866955   1.670437     0.23   0.817    -2.895245    3.668636
    5065196  |    1.56073   .9296017     1.68   0.094    -.2656767    3.387137
    5069683  |   1.621598    .416304     3.90   0.000     .8036769    2.439518
    5084474  |   .6906659   1.709741     0.40   0.686    -2.668496    4.049828
    5095951  |   .6653362   1.215927     0.55   0.584    -1.723619    3.054291
    5136264  |   .2877148   .3279084     0.88   0.381    -.3565333     .931963
    5140467  |   .5799482    .575203     1.01   0.314    -.5501646    1.710061
    5151535  |   1.061967    1.22965     0.86   0.388    -1.353951    3.477886
    5154684  |   1.614864   .3258827     4.96   0.000     .9745954    2.255132
    5193768  |   1.633387   .6138252     2.66   0.008      .427392    2.839381
    5217851  |   1.015045   .2985434     3.40   0.001     .4284907    1.601599
    5224364  |    1.08324   1.651778     0.66   0.512    -2.162041    4.328521
    5277639  |   1.643762   .8039995     2.04   0.041     .0641285    3.223396
    5317397  |   1.563685   .8736416     1.79   0.074    -.1527762    3.280146
    5374028  |   .3973147   1.880552     0.21   0.833    -3.297443    4.092073
    5383253  |   1.681323   1.526933     1.10   0.271    -1.318673     4.68132
    5391432  |   1.094745   1.880082     0.58   0.561     -2.59909     4.78858
    5419808  |   .3192531   .3532805     0.90   0.367    -.3748441     1.01335
    5444967  |   .8333096   .6203847     1.34   0.180    -.3855724    2.052192
    5459046  |  -.0157815   .3131607    -0.05   0.960    -.6310545    .5994916
    5486605  |   1.642824   .7864854     2.09   0.037     .0976009    3.188048
    5495472  |    .647635   .8768042     0.74   0.460     -1.07504     2.37031
    5518116  |   1.066165   1.312945     0.81   0.417    -1.513404    3.645734
    5526079  |   1.623345   .4433415     3.66   0.000     .7523028    2.494386
    5615298  |    1.57778   .6135767     2.57   0.010     .3722734    2.783286
    5626832  |   .6631446   1.173554     0.57   0.572     -1.64256    2.968849
    5627056  |  -.0333011   .6608134    -0.05   0.960    -1.331614    1.265012
    5628024  |   .6459493   .8450261     0.76   0.445     -1.01429    2.306189
    5653864  |   .0273008   .5417458     0.05   0.960    -1.037078     1.09168
    5654561  |   .5811413   .5543807     1.05   0.295    -.5080614    1.670344
    5674641  |  -.0084074   .1668338    -0.05   0.960    -.3361892    .3193743
    5702683  |   .9985281   .0292075    34.19   0.000     .9411437    1.055913
    5712945  |  -.0089868   .1783294    -0.05   0.960    -.3593541    .3413805
    5752515  |   1.641349   .7590389     2.16   0.031     .1500503    3.132648
    5773139  |   1.651465   .9494339     1.74   0.083    -.2139065    3.516837
    5817208  |   1.549071   1.153021     1.34   0.180    -.7162915    3.814434
    5843198  |    .836411   .6805978     1.23   0.220     -.500773    2.173595
    5897528  |   1.063463   1.259335     0.84   0.399    -1.410778    3.537704
    5944107  |   .6798867   1.498879     0.45   0.650    -2.264991    3.624765
    5969973  |   .9689475   .6161927     1.57   0.116    -.2416985    2.179593
    5989709  |   .0900841   1.787591     0.05   0.960    -3.422032      3.6022
    5991507  |   .9756966   .4822656     2.02   0.044     .0281798    1.923213
    6005256  |   1.089266   1.771366     0.61   0.539    -2.390971    4.569504
    6019378  |   .6285607   .5293921     1.19   0.236    -.4115466    1.668668
    6033986  |   .5941798   .3512478     1.69   0.091    -.0959238    1.284283
    6053151  |   .5841341   .5032635     1.16   0.246    -.4046378    1.572906
    6122988  |   .9634639   .7250075     1.33   0.184    -.4609728    2.387901
    6138666  |   1.071655   1.421901     0.75   0.451    -1.721981    3.865292
    6164319  |   .7822534   .4290688     1.82   0.069    -.0607465    1.625253
    6168006  |   1.084846   1.683652     0.64   0.520    -2.223059    4.392751
    6168044  |   1.656903   1.053367     1.57   0.116    -.4126678    3.726473
    6173241  |   .9077192   1.831181     0.50   0.620    -2.690038    4.505477
    6212052  |   .9494114   1.003859     0.95   0.345    -1.022891    2.921714
    6214039  |   .6726442   1.357735     0.50   0.621    -1.994924    3.340213
    6228226  |   1.089771   1.781374     0.61   0.541    -2.410131    4.589672
    6229506  |   .6330701    .608185     1.04   0.298     -.561843    1.827983
    6256376  |   .6880914   1.659307     0.41   0.679    -2.571982    3.948164
    6274713  |   1.608159   .2736081     5.88   0.000     1.070596    2.145723
    6278882  |   .6737861   1.379954     0.49   0.626    -2.037436    3.385009
    6290294  |   .8534092   1.013452     0.84   0.400     -1.13774    2.844558
    6315265  |   1.002595   .0514988    19.47   0.000     .9014144    1.103776
    6328787  |   1.643762   .8039995     2.04   0.041     .0641285    3.223396
    6358969  |   .0749655   1.487583     0.05   0.960    -2.847718    2.997649
    6404687  |   .5997208   .2928037     2.05   0.041     .0244435    1.174998
    6462827  |   .0560735   1.112699     0.05   0.960    -2.130068    2.242215
    6481665  |   1.687175   1.641374     1.03   0.304    -1.537665    4.912016
    6488612  |   .6939858   1.774831     0.39   0.696    -2.793059    4.181031
    6540866  |  -.0305107   .6054406    -0.05   0.960    -1.220032     1.15901
    6563972  |   1.033176   .6583257     1.57   0.117    -.2602497    2.326601
    6568232  |   1.686629   1.630678     1.03   0.301    -1.517197    4.890455
    6569047  |   1.028927   .5740073     1.79   0.074    -.0988368     2.15669
    6614541  |   .9326032   1.337393     0.70   0.486    -1.694998    3.560205
    6649404  |   1.637787   .6933867     2.36   0.019     .2754766    3.000098
    6668782  |   1.055568   1.102671     0.96   0.339    -1.110871    3.222007
    6678008  |   .9409827   1.171115     0.80   0.422    -1.359929    3.241895
    6712438  |   .6038889   .2708408     2.23   0.026     .0717626    1.136015
    6761847  |    .584812   .4919416     1.19   0.235    -.3817154    1.551339
    6785177  |   1.677461   1.451553     1.16   0.248    -1.174433    4.529355
    6788936  |   1.668328   1.273892     1.31   0.191    -.8345129    4.171169
    6800813  |   1.627483   .5110796     3.18   0.002     .6233546    2.631611
    6823682  |   .9918321   .1620796     6.12   0.000     .6733911    1.310273
    6856024  |   .8972483   2.038961     0.44   0.660    -3.108738    4.903235
    6858945  |   .7776665   .5162965     1.51   0.133    -.2367114    1.792045
    6953631  |    1.58044   .5666006     2.79   0.005      .467228    2.693651
    6964809  |   .5994331   .2951161     2.03   0.043     .0196126    1.179254
    6968266  |    1.60764   .2718652     5.91   0.000     1.073501    2.141779
    6978536  |   1.583651   .5113898     3.10   0.002     .5789136    2.588389
    7001269  |   1.591068   .3938492     4.04   0.000     .8172646    2.364871
    7032521  |   1.597459   .3133363     5.10   0.000     .9818407    2.213077
    7046053  |   .6850545    1.59987     0.43   0.669    -2.458242    3.828351
    7050208  |   1.005223    .103641     9.70   0.000     .8015974    1.208848
    7068015  |   1.620139   .3946381     4.11   0.000     .8447854    2.395492
    7082059  |   1.630464   .5622662     2.90   0.004     .5257689     2.73516
    7104006  |     .99777   .0442503    22.55   0.000     .9108307    1.084709
    7108788  |   1.582347   .5335736     2.97   0.003     .5340248     2.63067
    7129809  |   .9395643    1.19926     0.78   0.434    -1.416645    3.295773
    7153072  |   .6721013   1.347178     0.50   0.618    -1.974726    3.318929
    7174723  |   .6712215   1.330075     0.50   0.614    -1.942004    3.284447
    7199325  |   .6719922   1.345056     0.50   0.618    -1.970666    3.314651
    7201337  |   1.681735   1.534976     1.10   0.274    -1.334063    4.697533
    7205892  |   1.599936   .2911335     5.50   0.000     1.027941    2.171932
    7257946  |    .686629   1.630678     0.42   0.674    -2.517197    3.890455
    7268644  |   .9699952   .5954019     1.63   0.104    -.1998027    2.139793
    7312902  |   .6654232    1.21761     0.55   0.585     -1.72684    3.057686
    7318261  |   1.651465   .9494339     1.74   0.083    -.2139065    3.516837
    7321079  |   .6762854   1.428632     0.47   0.636    -2.130576    3.483147
    7333313  |   .3881999   1.700195     0.23   0.819    -2.952207    3.728607
    7370462  |   1.599433   .2951161     5.42   0.000     1.019613    2.179254
    7379312  |   1.581141   .5543807     2.85   0.005     .4919386    2.670344
    7379888  |   1.694923   1.793206     0.95   0.345    -1.828225     5.21807
    7434197  |   .7125504   2.139697     0.33   0.739    -3.491355    4.916456
    7453285  |   1.089771   1.781374     0.61   0.541    -2.410131    4.589672
    7488267  |   .5349466    1.42708     0.37   0.708    -2.268866    3.338759
    7507104  |   1.089771   1.781374     0.61   0.541    -2.410131    4.589672
    7550713  |   .6906659   1.709741     0.40   0.686    -2.668496    4.049828
    7586827  |   .9429452   1.132171     0.83   0.405    -1.281453    3.167344
    7608259  |   1.048223   .9569168     1.10   0.274    -.8318505    2.928297
    7624816  |    1.65449   1.007139     1.64   0.101    -.3242558    3.633235
    7630258  |   1.055568   1.102671     0.96   0.339    -1.110871    3.222007
    7642272  |   .0982387   1.949407     0.05   0.960      -3.7318    3.928277
    7697777  |   1.035417   .7027932     1.47   0.141     -.345375    2.416208
    7746468  |   .6181959   .3673467     1.68   0.093    -.1035374    1.339929
    7798951  |   .6612766   1.137502     0.58   0.561    -1.573597     2.89615
    7802026  |   .8358247   .6691949     1.25   0.212    -.4789559    2.150605
    7806392  |   1.663609   1.182525     1.41   0.160    -.6597212    3.986939
    7837542  |   1.100353    1.99137     0.55   0.581    -2.812132    5.012838
    7843653  |   .3371664   .6952991     0.48   0.628    -1.028902    1.703234
    7900217  |    1.51636   1.790653     0.85   0.398    -2.001771    5.034491
    7908379  |    .052428   1.040358     0.05   0.960    -1.991584     2.09644
    7916474  |   .6350234   .6431831     0.99   0.324    -.6286512    1.898698
    7941827  |   .0530534   1.052769     0.05   0.960    -2.015343     2.12145
    7966169  |   .0096125   .1907469     0.05   0.960    -.3651517    .3843768
    7977788  |  -.0550166   1.091726    -0.05   0.960    -2.199951    2.089918
    7985004  |   .6417022   .7655941     0.84   0.402    -.8624757     2.14588
    7992281  |   .5772685   .6227104     0.93   0.354    -.6461829     1.80072
    7999227  |   .0821544   1.630237     0.05   0.960    -3.120805    3.285114
    8013694  |   .8998526   1.987282     0.45   0.651    -3.004599    4.804304
    8040728  |   1.676285   1.428632     1.17   0.241    -1.130576    4.483147
    8050174  |   .6925387    1.74645     0.40   0.692    -2.738747    4.123824
    8050737  |   1.040194   .7975955     1.30   0.193    -.5268575    2.607246
    8052448  |    .857492   1.093808     0.78   0.433    -1.291534    3.006518
    8053482  |   1.028527   .5660853     1.82   0.070    -.0836716    2.140726
    8067421  |    .748909   1.077566     0.70   0.487    -1.368207    2.866025
    8080506  |   .0897709   1.781374     0.05   0.960    -3.410131    3.589672
    8086625  |   1.663145   1.173554     1.42   0.157    -.6425596    3.968849
    8102401  |   1.030034   .5959757     1.73   0.085    -.1408916    2.200959
    8136376  |   1.068201   1.353354     0.79   0.430     -1.59076    3.727162
    8153445  |   1.094781   1.880791     0.58   0.561    -2.600447    4.790008
    8187087  |   .6198581   .3905793     1.59   0.113    -.1475208    1.387237
    8205626  |   .6547477   1.012076     0.65   0.518    -1.333699    2.643194
    8215757  |   .6106426   .2869514     2.13   0.034     .0468635    1.174422
    8231506  |    1.64184   .7681647     2.14   0.033     .1326121    3.151069
    8250273  |   1.098421    1.95302     0.56   0.574    -2.738716    4.935558
    8252983  |   1.074173   1.471856     0.73   0.466    -1.817611    3.965957
    8290753  |   .9769307   .4577764     2.13   0.033     .0775283    1.876333
    8309948  |   .6740946   1.385959     0.49   0.627    -2.048927    3.397116
    8311783  |   1.580361   .5679729     2.78   0.006     .4644533    2.696269
    8318032  |   .5626819   .8925993     0.63   0.529    -1.191026    2.316389
    8321388  |   .6659268    1.22736     0.54   0.588    -1.745491    3.077345
    8358439  |   1.599433   .2951161     5.42   0.000     1.019613    2.179254
    8381734  |   .0693197   1.375551     0.05   0.960    -2.633252    2.771891
    8400856  |   .9534796   .9231316     1.03   0.302    -.8602154    2.767175
    8436047  |   .7585731   .8876154     0.85   0.393    -.9853424    2.502489
    8444801  |   .0843638    1.67408     0.05   0.960    -3.204734    3.373461
    8463216  |   1.629221   .5407287     3.01   0.003     .5668409    2.691602
    8464345  |   1.693986   1.774831     0.95   0.340    -1.793059    5.181031
    8480747  |   1.082943   1.645892     0.66   0.511    -2.150773     4.31666
    8493522  |   1.676351   1.429913     1.17   0.242    -1.133028     4.48573
    8495973  |    .686629   1.630678     0.42   0.674    -2.517197    3.890455
    8507855  |   .8281024   .5199897     1.59   0.112    -.1935317    1.849736
    8520153  |   1.617822    .362334     4.47   0.000     .9059376    2.329707
    8528813  |   1.089771   1.781374     0.61   0.541    -2.410131    4.589672
    8567489  |   .7952283   .2014014     3.95   0.000     .3995309    1.190926
    8577727  |   .9714726   .5660853     1.72   0.087    -.1407263    2.083672
    8596973  |   1.089771   1.781374     0.61   0.541    -2.410131    4.589672
    8613356  |   1.654157   1.000777     1.65   0.099    -.3120894    3.620403
    8677168  |   .5960209   .3289161     1.81   0.071     -.050207    1.242249
    8695906  |   1.614428    .321067     5.03   0.000     .9836208    2.245234
    8720993  |   1.117034   2.322373     0.48   0.631    -3.445778    5.679846
    8874916  |   .1030813   2.045501     0.05   0.960    -3.915755    4.121918
    8876922  |   1.596496   .3235734     4.93   0.000     .9607649    2.232227
    8886067  |   1.610643   .2869514     5.61   0.000     1.046864    2.174422
    8888311  |   1.701618   1.924676     0.88   0.377    -2.079831    5.483068
    8889878  |   1.568543    .782468     2.00   0.046     .0312131    3.105874
    8896452  |    .879465   1.527466     0.58   0.565    -2.121578    3.880508
    8897282  |   1.532939   1.466216     1.05   0.296    -1.347765    4.413644
    8972811  |    .618673   .3738648     1.65   0.099    -.1158666    1.353213
    9045324  |   1.082154   1.630237     0.66   0.507    -2.120805    4.285114
    9117489  |   1.671671    1.33881     1.25   0.212     -.958715    4.302057
    9119489  |   1.633507   .6159739     2.65   0.008     .4232909    2.843723
    9152213  |   1.089771   1.781374     0.61   0.541    -2.410131    4.589672
    9163759  |   1.110852   2.199695     0.51   0.614    -3.210933    5.432637
    9189348  |   .6813233   1.526933     0.45   0.656    -2.318673     3.68132
    9197785  |   .7490343   1.075099     0.70   0.486    -1.363234    2.861302
    9292457  |   .6350234   .6431831     0.99   0.324    -.6286512    1.898698
    9302524  |   .6579893   1.074228     0.61   0.540    -1.452567    2.768546
    9307017  |   .0253972   .5039713     0.05   0.960    -.9647653     1.01556
    9361445  |   .1123927   2.230272     0.05   0.960    -4.269467    4.494252
    9395545  |   1.035509   .7046156     1.47   0.142    -.3488637    2.419881
    9397184  |   1.638493   .7063121     2.32   0.021     .2507872    3.026198
    9427606  |    1.68584   1.615237     1.04   0.297    -1.487648    4.859328
    9429663  |   1.575597   .6527799     2.41   0.016     .2930678    2.858127
    9465837  |   .6549503   1.015954     0.64   0.519    -1.341115    2.651015
    9482942  |   1.109261   2.168127     0.51   0.609    -3.150501    5.369023
    9549168  |   1.662054   1.152498     1.44   0.150    -.6022819     3.92639
    9566464  |   1.037979   .7536389     1.38   0.169    -.4427103    2.518668
    9572523  |  -.0760231    1.50857    -0.05   0.960     -3.03994    2.887893
    9618297  |   1.688091   1.659307     1.02   0.309    -1.571982    4.948164
    9618903  |   .0355085   .7046156     0.05   0.960    -1.348864    1.419881
    9651841  |   .6604714   1.121983     0.59   0.556     -1.54391    2.864853
    9671015  |   .6949225   1.793206     0.39   0.699    -2.828225     4.21807
    9671063  |   .0749802   1.487874     0.05   0.960    -2.848276    2.998236
    9694979  |   .9269838   1.448902     0.64   0.523    -1.919703     3.77367
    9717276  |   1.035417   .7027932     1.47   0.141     -.345375    2.416208
    9740556  |    1.59792   .3087336     5.18   0.000     .9913448    2.204495
    9752131  |   1.676285   1.428632     1.17   0.241    -1.130576    4.483147
    9754896  |   1.610888   .2886968     5.58   0.000      1.04368    2.178097
    9784716  |   1.089568   1.777348     0.61   0.540    -2.402423    4.581559
    9802901  |   1.061967    1.22965     0.86   0.388    -1.353951    3.477886
    9811326  |   .6547718   1.012538     0.65   0.518    -1.334582    2.644126
    9820038  |   1.067928   1.347938     0.79   0.429    -1.580393    3.716249
    9826437  |   1.654404   1.005512     1.65   0.101    -.3211449    3.629954
    9871053  |   1.544349   1.244342     1.24   0.215    -.9004341    3.989132
    9873409  |   .6631446   1.173554     0.57   0.572     -1.64256    2.968849
    9915513  |   1.637102   .6808706     2.40   0.017     .2993819    2.974822
    9936357  |   1.617402   .3567937     4.53   0.000     .9164023    2.318402
    9952575  |   1.613187   .3082885     5.23   0.000     1.007486    2.218887
             |
        term |
       2005  |   .5834207    .515287     1.13   0.258    -.4289739    1.595815
             |
       _cons |  -.7545851   2.969058    -0.25   0.799    -6.587952    5.078782
------------------------------------------------------------------------------

. outreg2 fpm using DiD_reelection.doc, bdec(3) nocons tex(nopretty) replace
DiD_reelection.tex
DiD_reelection.doc
dir : seeout

. 
. /*
> ==============================================================================
> ==============================================================================
> =*/
. 
.         
. 
. ****Closing the log file ****
. log close
      name:  <unnamed>
       log:  C:\Users\DELL\Desktop\Uni\2C1 Coursework\30152_logfile.log
  log type:  text
 closed on:   7 May 2024, 23:22:15
--------------------------------------------------------------------------------
